{
  "filename": "Rahimi.pdf",
  "markdown": "(Slip Opinion)\n\nOCTOBER  TERM,  2023\n\n1\n\nSyllabus\n\nNOTE:  Where  it  is  feasible,  a  syllabus  (headnote)  will  be  released,  as  is\nbeing  done  in  connection  with  this  case,  at  the  time  the  opinion  is  issued.\nThe  syllabus  constitutes  no  part  of  the  opinion  of  the  Court  but  has  been\nprepared  by  the  Reporter  of  Decisions  for  the  convenience  of  the  reader.\nSee United States v. Detroit Timber & Lumber Co., 200 U. S. 321, 337.\n\nSUPREME COURT OF THE UNITED STATES\n\nSyllabus\n\nUNITED STATES v. RAHIMI\n\nCERTIORARI TO THE UNITED STATES COURT OF APPEALS FOR\nTHE FIFTH CIRCUIT\n\nNo. 22–915.  Argued November 7, 2023—Decided June 21, 2024\n\nRespondent Zackey Rahimi was indicted under 18 U. S. C. §922(g)(8), a\nfederal statute that prohibits individuals subject to a domestic violence\nrestraining order from possessing a firearm.  A prosecution under Sec-\ntion 922(g)(8) may proceed only if the restraining order meets certain\nstatutory criteria.  In particular, the order must either contain a find-\ning  that  the  defendant  “represents  a  credible  threat  to  the  physical\nsafety”  of  his  intimate  partner  or  his  or  his  partner’s  child,\n§922(g)(8)(C)(i),  or  “by  its  terms  explicitly  prohibit[ ]  the  use,”  at-\ntempted use, or threatened use of “physical force” against those indi-\nviduals, §922(g)(8)(C)(ii).  Rahimi concedes here that the restraining\norder against him satisfies the statutory criteria, but argues that on\nits face Section 922(g)(8) violates the Second Amendment.  The District\nCourt  denied  Rahimi’s  motion  to  dismiss  the  indictment  on  Second\nAmendment  grounds.    While  Rahimi’s  case  was  on  appeal,  the  Su-\npreme Court decided New York State Rifle & Pistol Assn., Inc. v. Bruen,\n597 U. S. 1 (2022).  In light of Bruen, the Fifth Circuit reversed, con-\ncluding that the Government had not shown that Section 922(g)(8) “fits\nwithin our Nation’s historical tradition of firearm regulation.”  61 F.\n4th 443, 460 (CA5 2023).\n\nHeld: When an individual has been found by a court to pose a credible\nthreat to the physical safety of another, that individual may be tempo-\nrarily disarmed consistent with the Second Amendment.  Pp. 5–17.\n\n(a) Since the Founding, the Nation’s firearm laws have included reg-\nulations to stop individuals who threaten physical harm to others from\nmisusing firearms.  As applied to the facts here, Section 922(g)(8) fits\nwithin this tradition.\n\nThe right to keep and bear arms is among the “fundamental rights\nnecessary to our system of ordered liberty.”  McDonald v. Chicago, 561\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nSyllabus\n\nU. S. 742, 778.  That right, however, “is not unlimited,” District of Co-\nlumbia v. Heller, 554 U. S. 570, 626.  The reach of the Second Amend-\nment is not limited only to  those arms that were in existence at the\nFounding.  Heller, 554 U. S., at 582.  Rather, it “extends, prima facie,\nto all instruments that constitute bearable arms, even those that were\nnot [yet] in existence.”  Ibid.  By that same logic, the Second Amend-\nment permits more than just regulations identical to those existing in\n1791.\nUnder  our  precedent,  the  appropriate  analysis  involves  considering\nwhether  the  challenged  regulation  is  consistent  with  the  principles\nthat underpin the Nation’s regulatory tradition.  Bruen, 597 U. S., at\n26–31.    When  firearm  regulation  is  challenged  under  the  Second\nAmendment, the Government must show that the restriction “is con-\nsistent  with  the  Nation’s  historical  tradition  of  firearm  regulation.”\nBruen, 597 U. S., at 24.  A court must ascertain whether the new law\nis “relevantly similar” to laws that our tradition is understood to per-\nmit, “apply[ing] faithfully the balance struck by the founding genera-\ntion to modern circumstances.”  Id., at 29, and n. 7.  Why and how the\nregulation burdens the right are central to this inquiry.  As Bruen ex-\nplained, a challenged regulation that does not precisely match its his-\ntorical  precursors  “still  may  be  analogous  enough  to  pass  constitu-\ntional muster.”  Id., at 30.  Pp. 5–8.\n\n(b) Section 922(g)(8) survives Rahimi’s challenge.  Pp. 8–17.\n\n(1) Rahimi’s facial challenge to Section 922(g)(8) requires him to\n“establish  that  no  set  of  circumstances  exists  under  which  the  Act\nwould be valid.”  United States v. Salerno, 481 U. S. 739, 745.  Here,\nSection 922(g)(8) is constitutional as applied to the facts of Rahimi’s\nown case.  Rahimi has been found by a court to pose a credible threat\nto the physical safety of others, see §922(g)(8)(C)(i), and the Govern-\nment offers ample evidence that the Second Amendment permits such\nindividuals to be disarmed.  P. 8.\n\n(2) The Court reviewed the history of American gun laws exten-\nsively in Heller and Bruen.  At common law people were barred from\nmisusing weapons to harm or menace others.  Such conduct was often\naddressed  through  ordinary  criminal  laws  and  civil  actions,  such  as\nprohibitions  on  fighting  or  private  suits  against  individuals  who\nthreatened others.  By the 1700s and early 1800s, though, two distinct\nlegal regimes had developed that specifically addressed firearms vio-\nlence: the surety laws and the “going armed” laws.  Surety laws were\na form of “preventive justice,” 4 W. Blackstone, Commentaries on the\nLaws of England 251 (10th ed. 1787), which authorized magistrates to\nrequire individuals suspected of future misbehavior to post a bond.  If\nan individual failed to post a bond, he would be jailed.  If the individual\ndid post a bond and then broke the peace, the bond would be forfeit.\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nSyllabus\n\nSurety laws could be invoked to prevent all forms of violence, including\nspousal abuse, and also targeted the misuse of firearms.  These laws\noften offered the accused significant procedural protections.\n\nThe “going armed” laws—a particular subset of the ancient common\nlaw  prohibition  on  affrays,  or  fighting  in  public—provided  a  mecha-\nnism for punishing those who had menaced others with firearms.  Un-\nder  these  laws,  individuals  were  prohibited  from  “riding  or  going\narmed, with dangerous or unusual weapons, [to] terrify[ ] the good peo-\nple of the land.”  4 Blackstone 149.  Those who did so faced forfeiture\nof  their  arms  and  imprisonment.    Prohibitions  on  going  armed  were\nincorporated  into  American  jurisprudence  through  the  common  law,\nand some States expressly codified them.  Pp. 9–13.\n\n(3) Together, the surety and going armed laws confirm what com-\nmon sense suggests: When an individual poses a clear threat of physi-\ncal violence to another, the threatening individual may be disarmed.\nSection 922(g)(8) is not identical to these founding-era regimes, but it\ndoes not need to be.  Like the surety and going armed laws, Section\n922(g)(8)(C)(i) applies to individuals found by a court to threaten the\nphysical safety of another.  This prohibition is “relevantly similar” to\nthose founding era regimes in both why and how it burdens the Second\nAmendment  right.  Id.,  at  29.  Section  922(g)(8)  restricts  gun  use  to\ncheck demonstrated threats of physical violence, just as the surety and\ngoing  armed  laws  do.  Unlike  the  regulation  struck  down  in  Bruen,\nSection 922(g)(8) does not broadly restrict arms use by the public gen-\nerally.\n\nThe burden that Section 922(g)(8) imposes on the right to bear arms\nalso fits within the Nation’s regulatory tradition.  While the Court does\nnot  suggest  that  the  Second  Amendment  prohibits  the  enactment  of\nlaws banning the possession of guns by categories of persons thought\nby a legislature to present a special danger of misuse, see Heller, 554\nU. S., at 626, Section 922(g)(8) applies only once a court has found that\nthe defendant “represents a credible threat to the physical safety” of\nanother,  §922(g)(8)(C)(i),  which  notably  matches  the  similar  judicial\ndeterminations required in the surety and going armed laws.  Moreo-\nver, like surety bonds of limited duration, Section 922(g)(8) only pro-\nhibits firearm possession so long as the defendant “is” subject to a re-\nstraining order.  Finally, the penalty—another relevant aspect of the\nburden—also  fits  within  the  regulatory  tradition.    The  going  armed\nlaws provided for imprisonment, and if imprisonment was permissible\nto respond to the use of guns to threaten the physical safety of others,\nthen  the  lesser  restriction  of  temporary  disarmament  that  Section\n922(g)(8) imposes is also permissible.\n\nThe Court’s decisions in Heller and Bruen do not help Rahimi.  While\nSection  922(g)(8)  bars  individuals  subject  to  restraining  orders  from\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nSyllabus\n\npossessing  guns  in  the  home,  Heller  never  established  a  categorical\nrule  that  the  Constitution  prohibits  regulations  that  forbid  firearm\npossession in the home.  Indeed, Heller stated that many such prohi-\nbitions, like those on the possession of firearms by “felons and the men-\ntally  ill,”  are  “presumptively  lawful.”  Heller,  554  U. S.,  at  626,  627,\nn. 26.  And the Court’s conclusion in Bruen that regulations like the\nsurety laws are not a proper historical analogue for a broad gun licens-\ning regime does not mean that they cannot be an appropriate analogue\nfor a narrow one. Pp. 13–15.\n\n(4) The Fifth Circuit erred in reading Bruen to require a “histori-\ncal  twin”  rather  than  a  “historical  analogue.”   597  U. S.,  at  30.   The\npanel  also  misapplied  the  Court’s  precedents  when  evaluating\nRahimi’s facial challenge.  Rather than consider the circumstances in\nwhich Section 922(g)(8) was most likely to be constitutional, the panel\ninstead focused on hypothetical scenarios where the provision might\nraise constitutional concerns.  P. 16.\n\n(5) Finally,  the  Court  rejects  the  Government’s  contention  that\nRahimi may be disarmed simply because he is not “responsible.”  The\nCourt used this term in Heller and Bruen to describe the class of citi-\nzens who undoubtedly enjoy the Second Amendment right.  Those de-\ncisions, however, did not define the term and said nothing about the\nstatus of citizens who were not “responsible.”  P. 17.\n\n61 F. 4th 443, reversed and remanded.\n\nROBERTS,  C. J.,  delivered  the  opinion  for  the  Court,  in  which  ALITO,\nSOTOMAYOR, KAGAN, GORSUCH, KAVANAUGH, BARRETT, and JACKSON, JJ.,\njoined.  SOTOMAYOR, J., filed a concurring opinion, in which KAGAN, J.,\njoined. GORSUCH, J., KAVANAUGH, J., BARRETT, J., and JACKSON, J., filed\nconcurring opinions. THOMAS, J., filed a dissenting opinion.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nOpinion of the Court\n\nNOTICE: This opinion is subject to formal revision before publication in the\nUnited  States  Reports.  Readers  are  requested  to  notify  the  Reporter  of\nDecisions,  Supreme  Court  of  the  United  States,  Washington,  D. C.  20543,\npio@supremecourt.gov, of any typographical or other formal errors.\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nCHIEF  JUSTICE  ROBERTS  delivered  the  opinion  of  the\n\nCourt.\n\nA federal statute prohibits an individual subject to a do-\nmestic violence restraining order from possessing a firearm\nif that order includes a finding that he “represents a credi-\nble threat to the physical safety of [an] intimate partner,”\nor  a  child  of  the  partner  or  individual.\n18  U. S. C.\n§922(g)(8).  Respondent Zackey Rahimi is subject to such an\norder.  The question is whether this provision may be en-\nforced against him consistent with the Second Amendment.\n\nI\nA\n\nIn December 2019, Rahimi met his girlfriend, C. M., for\nlunch in a parking lot.  C. M. is also the mother of Rahimi’s\nyoung child, A. R.  During the meal, Rahimi and C. M. be-\ngan arguing, and Rahimi became enraged.  Brief for United\nStates 2.  C. M. attempted to leave, but Rahimi grabbed her\nby the wrist, dragged her back to his car, and shoved her in,\ncausing  her  to  strike  her  head  against  the  dashboard.\nWhen he realized that a bystander was watching the alter-\ncation, Rahimi paused to retrieve a gun from under the pas-\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nsenger seat.  C. M. took advantage of the opportunity to es-\ncape.  Rahimi  fired  as  she  fled,  although  it  is  unclear\nwhether  he  was  aiming  at  C. M.  or  the  witness.  Rahimi\nlater called C. M. and warned that he would shoot her if she\nreported the incident.  Ibid.\n\nUndeterred by this threat, C. M. went to court to seek a\nrestraining order.  In the affidavit accompanying her appli-\ncation, C. M. recounted the parking lot incident as well as\nother assaults.  She also detailed how Rahimi’s conduct had\nendangered A. R.  Although Rahimi had an opportunity to\ncontest C. M.’s testimony, he did not do so.  On February 5,\n2020, a state court in Tarrant County, Texas, issued a re-\nstraining order against him.  The order, entered with the\nconsent of both parties, included a finding that Rahimi had\ncommitted “family violence.”  App. 2.  It also found that this\nviolence was “likely to occur again” and that Rahimi posed\n“a credible threat” to the “physical safety” of C. M. or A. R.\nId., at 2–3.  Based on these findings, the order prohibited\nRahimi from threatening C. M. or her family for two years\nor  contacting  C. M.  during  that  period  except  to  discuss\nA. R.  Id., at 3–7.  It also suspended Rahimi’s gun license\nfor  two  years.    Id.,  at  5–6.    If  Rahimi  was  imprisoned  or\nconfined when the order was set to expire, the order would\ninstead terminate either one or two years after his release\ndate, depending on the length of his imprisonment.  Id., at\n6–7.\n\nIn May, however, Rahimi violated the order by approach-\ning  C. M.’s  home  at  night.    He  also  began  contacting  her\nthrough several social media accounts.\n\nIn November, Rahimi threatened a different woman with\na gun, resulting in a charge for aggravated assault with a\ndeadly  weapon.    And  while  Rahimi  was  under  arrest  for\nthat assault, the Texas police identified him as the suspect\nin a spate of at least five additional shootings.\n\nThe first, which occurred in December 2020, arose from\nRahimi’s dealing in illegal drugs.  After one of his customers\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nOpinion of the Court\n\n“started  talking  trash,”  Rahimi  drove  to  the  man’s  home\nand shot into it.  Brief for United States 3.  While driving\nthe next day, Rahimi collided with another car, exited his\nvehicle, and proceeded to shoot at the other car.  Three days\nlater,  he  fired  his  gun  in  the  air  while  driving  through  a\nresidential neighborhood.  A few weeks after that, Rahimi\nwas speeding on a highway near Arlington, Texas, when a\ntruck flashed its lights at him.  Rahimi hit the brakes and\ncut across traffic to chase the truck.  Once off the highway,\nhe  fired  several  times  toward  the  truck  and  a  nearby  car\nbefore fleeing.  Two weeks after that, Rahimi and a friend\nwere dining at a roadside burger restaurant.  When the res-\ntaurant  declined  his  friend’s  credit  card,  Rahimi  pulled  a\ngun and shot into the air.\n\nThe  police  obtained  a  warrant  to  search  Rahimi’s  resi-\ndence.  There they discovered a pistol, a rifle, ammunition—\nand a copy of the restraining order.\n\nB\nRahimi was indicted on one count of possessing a firearm\nwhile subject to a domestic violence restraining order, in vi-\nolation of 18 U. S. C. §922(g)(8).  At the time, such a viola-\ntion was punishable by up to 10 years’ imprisonment (since\namended  to  15  years).  §924(a)(2);  see  Bipartisan  Safer\nCommunities Act, Pub. L. 117–159, §12004(c)(2), 136 Stat.\n1329, 18 U. S. C. §924(a)(8).  A prosecution under Section\n922(g)(8) may proceed only if three criteria are met.  First,\nthe defendant must have received actual notice and an op-\nportunity  to  be  heard  before  the  order  was  entered.\n§922(g)(8)(A).  Second, the order must prohibit the defend-\nant  from  either  “harassing,  stalking,  or  threatening”  his\n“intimate partner” or his or his partner’s child, or “engaging\nin other conduct that would place [the] partner in reasona-\nble  fear  of  bodily  injury”  to  the  partner  or  child.\n§922(g)(8)(B).  A defendant’s “intimate partner[s]” include\nhis spouse or any former spouse, the parent of his child, and\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nanyone  with  whom  he  cohabitates  or  has  cohabitated.\n§921(a)(32).  Third,  under  Section  922(g)(8)(C),  the  order\nmust  either  contain  a  finding  that  the  defendant  “repre-\nsents a credible threat to the physical safety” of his intimate\npartner or his or his partner’s child, §922(g)(8)(C)(i), or “by\nits  terms  explicitly  prohibit[ ]  the  use,”  attempted  use,  or\nthreatened use of “physical force” against those individuals,\n§922(g)(8)(C)(ii).\n\nRahimi’s restraining order met all three criteria.  First,\nRahimi had received notice and an opportunity to be heard\nbefore  the  order  was  entered.    App.  2.    Second,  the  order\nprohibited  him  from  communicating  with  or  threatening\nC. M.  Id., at 3–4.  Third, the order met the requirements of\nSection  922(g)(8)(C)(i),  because  it  included  a  finding  that\nRahimi  represented  “a  credible  threat  to  the  physical\nsafety” of C. M. or her family.  Id., at 2–3.  The order also\n“explicitly  prohibit[ed]”  Rahimi  from  “the  use,  attempted\nuse, or threatened use of physical force” against C. M., sat-\nisfying  the  independent  basis  for  liability  in  Section\n922(g)(8)(C)(ii).  Id., at 3.\n\nRahimi  moved  to  dismiss  the  indictment,  arguing  that\nSection  922(g)(8)  violated  on  its  face  the  Second  Amend-\nment right to keep and bear arms.  No. 4:21–cr–00083 (ND\nTex., May 7, 2021), ECF Doc. 17.  Concluding that Circuit\nprecedent  foreclosed  Rahimi’s  Second  Amendment  chal-\nlenge, the District Court denied his motion.  Rahimi then\npleaded  guilty.  On  appeal,  he  again  raised  his  Second\nAmendment challenge.  The appeal was denied, and Rahimi\npetitioned for rehearing en banc.\n\nWhile Rahimi’s petition was pending, this Court decided\nNew York State Rifle & Pistol Assn., Inc. v. Bruen, 597 U. S.\n1 (2022).  In Bruen, we explained that when a firearm reg-\nulation  is  challenged  under  the  Second  Amendment,  the\nGovernment  must  show  that  the  restriction  “is  consistent\nwith the Nation’s historical tradition of firearm regulation.”\nId., at 24.\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nOpinion of the Court\n\nIn  light  of  Bruen,  the  panel  withdrew  the  prior  opinion\nand ordered additional briefing.  A new panel then heard\noral argument and reversed.  61 F. 4th 443, 448 (CA5 2023).\nSurveying  the  evidence  that  the  Government  had  identi-\nfied, the panel concluded that Section 922(g)(8) does not fit\nwithin our tradition of firearm regulation.  Id., at 460–461.\nJudge  Ho  wrote  separately  to  express  his  view  that  the\npanel’s ruling did not conflict with the interest in protecting\npeople from violent individuals.  Id., at 461–462 (concurring\nopinion).\n\nWe granted certiorari. 600 U. S. ___ (2023)\n\nII\nWhen a restraining order contains a finding that an indi-\nvidual poses a credible threat to the physical safety of an\nintimate partner, that individual may—consistent with the\nSecond Amendment—be banned from possessing firearms\nwhile the order is in effect.  Since the founding, our Nation’s\nfirearm laws have included provisions preventing individu-\nals  who  threaten  physical  harm  to  others  from  misusing\nfirearms.  As  applied  to  the  facts  of  this  case,  Section\n922(g)(8) fits comfortably within this tradition.\n\nA\nWe  have  held  that  the  right  to  keep  and  bear  arms  is\namong the “fundamental rights necessary to our system of\nordered liberty.”  McDonald v. Chicago, 561 U. S. 742, 778\n(2010).  Derived from English practice and codified in the\nSecond  Amendment,  the  right  secures  for  Americans  a\nmeans of self-defense.  Bruen, 597 U. S., at 17.  The spark\nthat ignited the American Revolution was struck at Lexing-\nton and Concord, when the British governor dispatched sol-\ndiers to seize the local farmers’ arms and powder stores.  In\nthe aftermath of the Civil War, Congress’s desire to enable\nthe newly freed slaves to defend themselves against former\nConfederates helped inspire the passage of the Fourteenth\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nAmendment, which secured the right to bear arms against\ninterference by the States.  McDonald,  561 U. S., at 771–\n776.  As a leading and early proponent of emancipation ob-\nserved,  “Disarm  a  community  and  you  rob  them  of  the\nmeans  of  defending  life.    Take  away  their  weapons  of  de-\nfense and you take away the inalienable right of defending\nliberty.”  Cong.  Globe,  40th  Cong.,  2d  Sess.,  1967  (1868)\n(statement of Rep. Stevens).\n\n“Like most rights,” though, “the right secured by the Sec-\nond Amendment is not unlimited.”  District of Columbia v.\nHeller, 554 U. S. 570, 626 (2008).  In Heller, this Court held\nthat the right applied to ordinary citizens within the home.\nEven as  we did so, however,  we recognized that the right\nwas never thought to sweep indiscriminately.  “From Black-\nstone  through  the  19th-century  cases,  commentators  and\ncourts routinely explained that the right was not a right to\nkeep  and  carry  any  weapon  whatsoever  in  any  manner\nwhatsoever and for whatever purpose.”  Ibid.  At the found-\ning, the bearing of arms was subject to regulations ranging\nfrom rules about firearm storage to restrictions on gun use\nby drunken New Year’s Eve revelers.  Act of Mar. 1, 1783,\n1783 Mass. Acts and Laws ch.13, pp. 218–219; 5 Colonial\nLaws of New York ch. 1501, pp. 244–246 (1894).  Some ju-\nrisdictions banned the carrying of “dangerous and unusual\nweapons.”  554 U. S., at 627 (citing 4 W. Blackstone, Com-\nmentaries on the Laws of England 148–149 (1769)).  Others\nforbade carrying concealed firearms.  554 U. S., at 626.\n\nIn  Heller,  our  inquiry  into  the  scope  of  the  right  began\nwith “constitutional text and history.”  Bruen, 597 U. S., at\n22.  In Bruen, we directed courts to examine our “historical\ntradition  of  firearm  regulation”  to  help  delineate  the  con-\ntours of the right.  Id., at 17.  We explained that if a chal-\nlenged regulation fits within that tradition, it is lawful un-\nder  the  Second  Amendment.  We also  clarified  that  when\nthe Government regulates arms-bearing conduct, as when\nthe  Government  regulates  other  constitutional  rights,  it\n\n\fCite as:  602 U. S. ____ (2024)\n\n7\n\nOpinion of the Court\n\nbears the burden to “justify its regulation.”  Id., at 24.\n\nNevertheless, some courts have misunderstood the meth-\nodology  of  our  recent  Second  Amendment  cases.  These\nprecedents were not meant to suggest a law trapped in am-\nber.  As  we explained in Heller, for example,  the reach of\nthe  Second  Amendment  is  not  limited  only  to  those  arms\nthat were in existence at the founding.  554 U. S., at 582.\nRather, it “extends, prima facie, to all instruments that con-\nstitute bearable arms, even those that were not [yet] in ex-\nistence.”  Ibid.  By that same logic, the Second Amendment\npermits more than just those regulations identical to ones\nthat could be found in 1791.  Holding otherwise would be as\nmistaken  as  applying  the  protections  of  the  right  only  to\nmuskets and sabers.\n\nAs  we  explained  in  Bruen,  the  appropriate  analysis  in-\nvolves  considering  whether  the  challenged  regulation  is\nconsistent with the principles that underpin our regulatory\ntradition.  597  U. S.,  at  26–31.    A  court  must  ascertain\nwhether the new law is “relevantly similar” to laws that our\ntradition is understood to permit, “apply[ing] faithfully the\nbalance  struck  by  the  founding  generation  to  modern  cir-\ncumstances.”  Id., at 29, and n. 7.  Discerning and develop-\ning the law in this way is “a commonplace task for any law-\nyer or judge.”  Id., at 28.\n\nWhy and how the regulation burdens the right are cen-\ntral to this inquiry.  Id., at 29.  For example, if laws at the\nfounding regulated firearm use to address particular prob-\nlems, that will be a strong indicator that contemporary laws\nimposing similar restrictions for similar reasons fall within\na permissible category of regulations.  Even when a law reg-\nulates  arms-bearing  for  a  permissible  reason,  though,  it\nmay not be compatible with the right if it does so to an ex-\ntent beyond what was done at the founding.  And when a\nchallenged regulation does not precisely match its histori-\ncal  precursors,  “it  still  may  be  analogous  enough  to  pass\nconstitutional muster.”  Id., at 30.  The law must comport\n\n\f8\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nwith the principles underlying the Second Amendment, but\nit need not be a “dead ringer” or a “historical twin.”  Ibid.\n(emphasis deleted).1\n\nB\nBearing these principles in mind, we conclude that Sec-\n\ntion 922(g)(8) survives Rahimi’s challenge.\n\n1\n\nRahimi challenges Section 922(g)(8) on its face.  This is\nthe  “most  difficult  challenge  to  mount  successfully,”  be-\ncause it requires a defendant to “establish that no set of cir-\ncumstances  exists  under  which  the  Act  would  be  valid.”\nUnited States v. Salerno, 481 U. S. 739, 745 (1987).  That\nmeans  that  to  prevail, the  Government  need only  demon-\nstrate that Section 922(g)(8) is constitutional in some of its\napplications.  And here the provision is constitutional as ap-\nplied to the facts of Rahimi’s own case.\n\nRecall  that  Section  922(g)(8)  provides  two  independent\nbases for liability.  Section 922(g)(8)(C)(i) bars an individual\nfrom possessing a firearm if his restraining order includes\na  finding  that  he  poses  “a  credible  threat  to  the  physical\nsafety”  of  a  protected  person.\nSeparately,  Section\n922(g)(8)(C)(ii)  bars  an  individual  from  possessing  a  fire-\narm if his restraining order “prohibits the use, attempted\nuse,  or  threatened  use  of  physical  force.”    Our  analysis\nstarts  and  stops  with  Section  922(g)(8)(C)(i)  because  the\nGovernment offers ample evidence that the Second Amend-\nment  permits  the  disarmament  of  individuals  who  pose  a\ncredible threat to the physical safety of others.  We need not\n\n——————\n\n1 We  also  recognized  in  Bruen  the  “ongoing  scholarly  debate  on\nwhether courts should primarily rely on the prevailing understanding of\nan  individual  right  when  the  Fourteenth  Amendment  was  ratified  in\n1868 when defining its scope (as well as the scope of the right against the\nFederal Government).”  597 U. S., at 37.  We explained that under the\ncircumstances, resolving the dispute was unnecessary to decide the case.\nId., at 37–38.  The same is true here.\n\n\fCite as:  602 U. S. ____ (2024)\n\n9\n\nOpinion of the Court\n\ndecide whether regulation under Section 922(g)(8)(C)(ii) is\nalso permissible.\n\n2\nThis Court reviewed the history of American gun laws ex-\ntensively in Heller and Bruen.  From the earliest days of the\ncommon law, firearm regulations have included provisions\nbarring people from misusing weapons to harm or menace\nothers.  The act of “go[ing] armed to terrify the King’s sub-\njects” was recognized at common law as a “great offence.”\nSir John Knight’s Case, 3 Mod. 117, 118, 87 Eng. Rep. 75,\n76  (K.  B.  1686).  Parliament  began  codifying  prohibitions\nagainst such conduct as early as the 1200s and 1300s, most\nnotably in the Statute of Northampton of 1328.  Bruen, 597\nU. S., at 40.  In the aftermath of the Reformation and the\nEnglish Civil War, Parliament passed further restrictions.\nThe Militia Act of 1662, for example, authorized the King’s\nagents  to  “seize  all  Armes  in  the  custody  or  possession  of\nany person . . . judge[d] dangerous to the Peace of the King-\ndome.”  14 Car. 2 c. 3, §13 (1662); J. Greenlee, The Histori-\ncal  Justification  for  Prohibiting  Dangerous  Persons  From\nPossessing Arms, 20 Wyo. L. Rev. 249, 259 (2020).\n\nThe  Glorious  Revolution  cut  back  on  the  power  of  the\nCrown to disarm its subjects unilaterally.  King James II\nhad “caus[ed] several good Subjects being Protestants to be\ndisarmed at the same Time when Papists were . . . armed.”\n1 Wm. & Mary c. 2, §6, in 3 Eng. Stat. at Large 440 (1689).\nBy way of rebuke, Parliament adopted the English Bill of\nRights,  which  guaranteed  “that  the  Subjects  which  are\nProtestants,  may  have  Arms  for  their  Defence  suitable  to\ntheir Conditions, and as allowed by Law.”  §7, id., at 441.\nBut as the document itself memorialized, the principle that\narms-bearing was constrained “by Law” remained.  Ibid.\n\nThrough these centuries, English law had disarmed not\nonly brigands and highwaymen but also political opponents\n\n\f10\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nand disfavored religious groups.  By the time of the found-\ning,  however,  state  constitutions  and  the  Second  Amend-\nment had largely eliminated governmental authority to dis-\narm  political  opponents  on  this  side  of  the  Atlantic.    See\nHeller, 554 U. S., at 594–595, 600–603.  But regulations tar-\ngeting  individuals  who  physically  threatened  others  per-\nsisted.  Such conduct was often addressed through ordinary\ncriminal  laws  and  civil  actions,  such  as  prohibitions  on\nfighting or private suits against individuals who threatened\nothers.  See 4 W. Blackstone, Commentaries on the Laws of\nEngland 145–146, 149–150 (10th ed. 1787) (Blackstone); 3\nid.,  at  120.    By  the  1700s  and  early  1800s,  however,  two\ndistinct  legal  regimes  had  developed  that  specifically  ad-\ndressed firearms violence.\n\nThe first were the surety laws.  A form of “preventive jus-\ntice,” these laws derived from the ancient practice of frank-\npledges.  4 id., at 251–253.  Reputedly dating to the time of\nCanute, the frankpledge system involved compelling adult\nmen  to  organize  themselves  into  ten-man  “tithing[s].”    A.\nLefroy, Anglo-Saxon Period of English Law, Part II, 26 Yale\nL. J.  388,  391  (1917).  The  members  of  each  tithing  then\n“mutually  pledge[d]  for  each  other’s  good  behaviour.”    4\nBlackstone 252.  Should any of the ten break the law, the\nremaining nine would be responsible for producing him in\ncourt,  or  else  face  punishment  in his  stead.    D.  Levinson,\nCollective Sanctions, 56 Stan. L. Rev. 345, 358 (2003).\n\nEventually,  the  communal  frankpledge  system  evolved\ninto  the  individualized  surety  regime.    Under  the  surety\nlaws, a magistrate could “oblig[e] those persons, [of] whom\nthere is a probable ground to suspect of future misbehav-\niour,  to  stipulate  with  and  to  give  full  assurance  . . .  that\nsuch  offence  . . .  shall  not  happen[,]  by  finding  pledges  or\nsecurities.”  4 Blackstone 251.  In other words, the law au-\nthorized magistrates to require individuals suspected of fu-\nture  misbehavior  to  post  a  bond.  Ibid.   If  an  individual\nfailed to post a bond,  he would be jailed.  See,  e.g., Mass.\n\n\fCite as:  602 U. S. ____ (2024)\n\n11\n\nOpinion of the Court\n\nRev. Stat., ch. 134, §6 (1836).  If the individual did post a\nbond and then broke the peace, the bond would be forfeit.  4\nBlackstone 253.\n\nWell  entrenched  in  the  common  law,  the  surety  laws\ncould be invoked to prevent all forms of violence, including\nspousal  abuse.    As  Blackstone  explained,  “[w]ives  [could]\ndemand [sureties] against their husbands; or husbands, if\nnecessary,  against  their  wives.”  Id.,  at  254.  These  often\ntook the form of a surety of the peace, meaning that the de-\nfendant pledged to “keep the peace.”  Id., at 252–253; see R.\nBloch,  The  American  Revolution,  Wife  Beating,  and  the\nEmergent Value of Privacy, 5 Early American Studies 223,\n232–233, 234–235 (2007) (Bloch) (discussing peace bonds).\nWives also demanded sureties for good behavior, whereby a\nhusband pledged to “demean and behave himself well.”  4\nBlackstone 253; see Bloch 232–233, 234–235, and n. 34.\n\nWhile  communities  sometimes  resorted  to  public  sham-\ning  or  vigilante  justice  to  chastise  abusers,  sureties  pro-\nvided  the  public  with  a  more  measured  solution.  B.\nMcConville, The Rise of Rough Music, in Riot and Revelry\nin Early America 90–100 (W. Pencak, M. Dennis, & S. New-\nman eds. 2002).  In one widely reported incident, Susannah\nWyllys  Strong,  the  wife  of  a  Connecticut  judge,  appeared\nbefore Tapping Reeve in 1790 to make a complaint against\nher husband.  K. Ryan, “The Spirit of Contradiction”: Wife\nAbuse  in  New  England,  1780–1820,  13  Early  American\nStudies 586, 602 (2015).  Newspapers carried the story in\nConnecticut, Massachusetts, and New York.  Ibid.  Reeve\nultimately ordered the man to post a bond of £1,000.  Id., at\n603.\n\nImportantly  for  this  case,  the  surety  laws  also  targeted\nthe  misuse  of  firearms.  In  1795,  for  example,  Massachu-\nsetts enacted a law authorizing justices of the peace to “ar-\nrest” all who “go armed offensively [and] require of the of-\nfender  to  find  sureties  for  his  keeping  the  peace.”    1795\nMass.  Acts  ch.  2,  in  Acts  and  Resolves  of  Massachusetts,\n\n\f12\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\n1794–1795, ch. 26, pp. 66–67 (1896).  Later, Massachusetts\namended its surety laws to be even more specific, authoriz-\ning  the  imposition  of  bonds  from  individuals  “[who  went]\narmed with a dirk, dagger, sword, pistol, or other offensive\nand dangerous weapon.”  Mass. Rev. Stat., ch. 134, §16; see\nibid.  (marginal  note)  (referencing  the  earlier  statute).    At\nleast nine other jurisdictions did the same.  See Bruen, 597\nU. S., at 56, and n. 23.\n\nThese  laws  often  offered  the  accused  significant  proce-\ndural protections.  Before the accused could be compelled to\npost a bond for “go[ing] armed,” a complaint had to be made\nto a judge or justice of the peace by “any person having rea-\nsonable cause to fear” that the accused would do him harm\nor breach the peace.  Mass. Rev. Stat., ch. 134, §§1, 16.  The\nmagistrate  would  take  evidence,  and—if  he  determined\nthat  cause  existed  for  the  charge—summon  the  accused,\nwho could respond to the allegations.  §§3–4.  Bonds could\nnot be required for more than six months at a time, and an\nindividual could obtain an exception if he needed his arms\nfor self-defense or some other legitimate reason.  §16.\n\nWhile the surety laws provided a mechanism for prevent-\ning violence before it occurred, a second regime provided a\nmechanism  for  punishing  those  who  had  menaced  others\nwith firearms.  These were the “going armed” laws, a par-\nticular subset of the ancient common-law prohibition on af-\nfrays.\n\nDerived from the French word “affraier,” meaning “to ter-\nrify,” 4 Blackstone 145, the affray laws traced their origin\nto the Statute of Northampton, 2 Edw. 3 c. 3 (1328).  Alt-\nhough  the  prototypical  affray  involved  fighting  in  public,\ncommentators understood affrays to encompass the offense\nof “arm[ing]” oneself “to the Terror of the People,” T. Bar-\nlow, The Justice of the Peace: A Treatise 11 (1745).  Moreo-\nver, the prohibitions—on fighting and going armed—were\noften codified in the same statutes.  E.g., 2 Edw. 3 c. 3; Acts\nand Laws of His Majesty’s Province of New-Hampshire in\n\n\fCite as:  602 U. S. ____ (2024)\n\n13\n\nOpinion of the Court\n\nNew-England 2 (1761).\n\nWhether classified as an affray law or a distinct prohibi-\ntion,  the  going  armed  laws  prohibited  “riding  or  going\narmed,  with  dangerous  or  unusual  weapons,  [to]  terrify[ ]\nthe good people of the land.”  4 Blackstone 149 (emphasis\ndeleted).  Such  conduct  disrupted  the  “public  order”  and\n“le[d]  almost  necessarily  to  actual  violence.”    State  v.\nHuntly, 25 N. C. 418, 421–422 (1843) (per curiam).  There-\nfore,  the  law  punished  these  acts  with  “forfeiture  of  the\narms . . . and imprisonment.”  4 Blackstone 149.\n\nIn  some  instances,  prohibitions  on  going  armed  and  af-\nfrays  were  incorporated  into  American  jurisprudence\nthrough  the  common  law.    See,  e.g.,  Huntly,  25  N. C.,  at\n421–422; O’Neill v. State, 16 Ala. 65, 67 (1849); Hickman v.\nState, 193 Md. App. 238, 253–255, 996 A. 2d 974, 983 (2010)\n(recognizing  that  common-law  prohibition  on  fighting  in\npublic remains even now chargeable in Maryland).  More-\nover, at least four States—Massachusetts, New Hampshire,\nNorth  Carolina,  and  Virginia—expressly  codified  prohibi-\ntions on going armed.  1786 Va. Acts ch. 21; 2 Laws of the\nCommonwealth  of  Massachusetts  from  Nov.  28,  1780  to\nFeb.  28,  1807,  pp.  652–653  (1807);  Acts  and  Laws  of  His\nMajesty’s  Province  of  New-Hampshire  in  New-England  2\n(1761); Collection of All of the Public Acts of Assembly, of\nthe Province of North-Carolina: Now in Force and Use 131\n(1751) (1741 statute).\n\n3\n\nTaken together, the surety and going armed laws confirm\nwhat common sense suggests: When an individual poses a\nclear threat of physical violence to another, the threatening\nindividual  may  be  disarmed.    Section  922(g)(8)  is  by  no\nmeans identical to these founding era regimes, but it does\nnot need to be.  See Bruen, 597 U. S., at 30.  Its prohibition\non the possession of firearms by those found by a court to\npresent  a  threat  to  others  fits  neatly  within  the  tradition\n\n\f14\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nthe surety and going armed laws represent.\nLike  the  surety  and  going  armed\n\nlaws,  Section\n922(g)(8)(C)(i) applies to individuals found to threaten the\nphysical  safety  of  another.  This  provision  is  “relevantly\nsimilar” to those founding era regimes in both why and how\nit burdens the Second Amendment right.  Id., at 29.  Section\n922(g)(8)  restricts  gun  use  to  mitigate  demonstrated\nthreats  of  physical  violence,  just  as  the  surety  and  going\narmed  laws  do.  Unlike  the  regulation  struck  down  in\nBruen, Section 922(g)(8) does not broadly restrict arms use\nby the public generally.\n\nThe burden Section 922(g)(8) imposes on the right to bear\narms also fits within our regulatory tradition.  While we do\nnot suggest that the Second Amendment prohibits the en-\nactment of laws banning the possession of guns by catego-\nries of persons thought by a legislature to present a special\ndanger of misuse, see Heller, 554 U. S., at 626, we note that\nSection 922(g)(8) applies only once a court has found that\nthe defendant “represents a credible threat to the physical\nsafety”  of  another.  §922(g)(8)(C)(i).  That  matches  the\nsurety and going armed laws, which involved judicial deter-\nminations  of  whether  a  particular  defendant  likely  would\nthreaten or had threatened another with a weapon.\n\nMoreover, like surety bonds of limited duration, Section\n922(g)(8)’s restriction was temporary as applied to Rahimi.\nSection 922(g)(8) only prohibits firearm possession so long\nas  the  defendant  “is”  subject  to  a  restraining  order.\n§922(g)(8).  In Rahimi’s case that is one to two years after\nhis release from prison, according to Tex. Fam. Code Ann.\n§85.025(c) (West 2019).  App. 6–7.\n\nFinally, the penalty—another relevant aspect of the bur-\nden—also  fits  within  the  regulatory  tradition.    The  going\narmed laws provided for imprisonment, 4 Blackstone 149,\nand if imprisonment was permissible to respond to the use\nof guns to threaten the physical safety of others, then the\nlesser  restriction  of  temporary  disarmament  that  Section\n\n\fCite as:  602 U. S. ____ (2024)\n\n15\n\nOpinion of the Court\n\n922(g)(8) imposes is also permissible.\n  Rahimi argues Heller requires us to affirm, because Sec-\ntion 922(g)(8) bars individuals subject to restraining orders\nfrom possessing guns in the home, and in Heller we invali-\ndated  an  “absolute  prohibition  of  handguns  . . .  in  the\nhome.”  554 U. S., at 636; Brief for Respondent 32.  But Hel-\nler never established a categorical rule that the Constitu-\ntion prohibits regulations that forbid firearm possession in\nthe home.  In fact, our opinion stated that many such pro-\nhibitions, like those on the possession of firearms by “felons\nand the mentally ill,” are “presumptively lawful.”  554 U. S.,\nat 626, 627, n. 26.\n\nOur  analysis  of  the  surety  laws  in  Bruen  also  does  not\nhelp Rahimi.  In Bruen, we explained that the surety laws\nwere not a proper historical analogue for New York’s gun\nlicensing regime.  597 U. S., at 55–60.  What distinguished\nthe  regimes,  we  observed,  was  that  the  surety  laws  “pre-\nsumed that individuals had a right to . . . carry,” whereas\nNew  York’s  law  effectively  presumed  that  no  citizen  had\nsuch  a  right,  absent  a  special  need.  Id.,  at  56  (emphasis\ndeleted).  Section  922(g)(8)(C)(i)  does  not  make  the  same\nfaulty presumption.  To the contrary, it presumes, like the\nsurety  laws  before  it,  that  the  Second  Amendment  right\nmay only be burdened once a defendant has been found to\npose a credible threat to the physical safety of others.  See\nibid.\n\nWhile we also noted that the surety laws applied different\npenalties than New York’s special-need regime, we did so\nonly to emphasize just how severely the State treated the\nrights of its citizens.  Id., at 57.  But as we have explained,\nour  Nation’s  tradition  of  firearm  regulation  distinguishes\ncitizens  who  have  been  found  to  pose  a  credible  threat  to\nthe physical safety of others from those who have not.  The\nconclusion that focused regulations like the surety laws are\nnot a historical analogue for a broad prohibitory regime like\n\n\f16\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nNew York’s does not mean that they cannot be an appropri-\nate analogue for a narrow one.\n\n4\nIn  short,  we  have  no  trouble  concluding  that  Section\n922(g)(8) survives Rahimi’s facial challenge.  Our tradition\nof firearm regulation allows the Government to disarm in-\ndividuals  who  present  a  credible  threat  to  the  physical\nsafety of others.  Section 922(g)(8) can be applied lawfully\nto Rahimi.\n\nThe dissent reaches a contrary conclusion, primarily on\nthe  ground  that  the  historical  analogues  for  Section\n922(g)(8) are not sufficiently similar to place that provision\nin  our  historical  tradition.  The  dissent  does,  however,\nacknowledge that Section 922(g)(8) is within that tradition\nwhen it comes to the “why” of the appropriate inquiry.  The\nobjection  is  to  the  “how.”    See  post,  at  18  (opinion  of\nTHOMAS, J.).  For the reasons we have set forth, however,\nwe conclude that Section 922(g)(8) satisfies that part of the\ninquiry  as  well.  See  supra,  at  7,  13–15.  As  we  said  in\nBruen, a “historical twin” is not required.  597 U. S., at 30.\nFor its part, the Fifth Circuit made two errors.  First, like\nthe dissent, it read Bruen to require a “historical twin” ra-\nther than a “historical analogue.”  Ibid. (emphasis deleted).\nSecond, it did not correctly apply our precedents governing\nfacial  challenges.  61  F. 4th,  at  453.    As  we  have  said  in\nother  contexts,  “[w]hen  legislation  and  the  Constitution\nbrush up against each other, [a court’s] task is to seek har-\nmony, not to manufacture conflict.”  United States v. Han-\nsen,  599  U. S.  762,  781  (2023).    Rather  than  consider  the\ncircumstances in which Section 922(g)(8) was most likely to\nbe constitutional, the panel instead focused on hypothetical\nscenarios  where  Section  922(g)(8)  might  raise  constitu-\ntional concerns.  See 61 F. 4th, at 459; id., at 465–467 (Ho,\nJ.,  concurring).    That  error  left  the  panel  slaying  a  straw\n\n\fCite as:  602 U. S. ____ (2024)\n\n17\n\nman.2\n\nOpinion of the Court\n\n5\n\nFinally, in holding that Section 922(g)(8) is constitutional\nas  applied  to  Rahimi,  we  reject  the  Government’s  conten-\ntion that Rahimi may be disarmed simply because he is not\n“responsible.”  Brief for United States 6; see Tr. of Oral Arg.\n8–11.  “Responsible”  is  a  vague  term.    It  is  unclear  what\nsuch a rule would entail.  Nor does such a line derive from\nour case law.  In Heller and Bruen, we used the term “re-\nsponsible” to describe the class of ordinary citizens who un-\ndoubtedly  enjoy  the  Second  Amendment  right.  See,  e.g.,\nHeller, 554 U. S., at 635; Bruen, 597 U. S., at 70.  But those\ndecisions did not define the term and said nothing about the\nstatus of citizens who were not “responsible.”  The question\nwas simply not presented.\n\n*\n\n*\n\n*\nIn Heller, McDonald, and Bruen, this Court did not “un-\ndertake  an  exhaustive  historical  analysis  . . .  of  the  full\nscope of the Second Amendment.”  Bruen, 597 U. S., at 31.\nNor do we do so today.  Rather, we conclude only this: An\nindividual found by a court to pose a credible threat to the\nphysical  safety  of  another  may  be  temporarily  disarmed\nconsistent with the Second Amendment.\n\nThe judgment of the Court of Appeals for the Fifth Circuit\n\n——————\n\n2 Many of the potential faults that the Fifth Circuit identifies in Section\n922(g)(8) appear to sound in due process rather than the Second Amend-\nment.  E.g., 61 F. 4th, at 459; id., at 465–467 (Ho, J., concurring).  As we\nhave explained, unless these hypothetical faults occur in every case, they\ndo not justify invalidating Section 922(g)(8) on its face.  See United States\nv. Salerno, 481 U. S. 739, 745 (1987) (a facial challenge fails if the law is\nconstitutional in at least some of its applications).  In any event, we need\nnot address any due process concern here because this challenge was not\nlitigated as a due process challenge and there is no such claim before us.\nSee this Court’s Rule 14.1(a).\n\n\f18\n\nUNITED STATES v. RAHIMI\n\nOpinion of the Court\n\nis reversed, and the case is remanded for further proceed-\nings consistent with this opinion.\n\nIt is so ordered.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nSOTOMAYOR, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE SOTOMAYOR, with  whom  JUSTICE KAGAN  joins,\n\nconcurring.\n\nToday, the Court applies its decision in New York State\nRifle  &  Pistol  Assn.,  Inc.  v.  Bruen,  597  U. S.  1  (2022),  for\nthe  first  time.    Although  I  continue  to  believe  that  Bruen\nwas wrongly decided, see id., at 83–133 (Breyer, J., joined\nby  SOTOMAYOR  and  KAGAN,  JJ.,  dissenting),  I  join  the\nCourt’s  opinion  applying  that  precedent  to  uphold  18\nU. S. C. §922(g)(8).\n\nThe Court today emphasizes that a challenged regulation\n“must  comport  with  the  principles  underlying  the  Second\nAmendment,” but need not have a precise historical match.\nAnte, at 7–8.  I agree.  I write separately to highlight why\nthe Court’s interpretation of Bruen, and not the dissent’s, is\nthe right one.  In short, the Court’s interpretation permits\na  historical  inquiry  calibrated  to  reveal  something  useful\nand transferable to the present day, while the dissent would\nmake the historical inquiry so exacting as to be useless, a\ntoo-sensitive alarm that sounds whenever a regulation did\nnot exist in an essentially identical form at the founding.\n\nI\n  Even under Bruen, this is an easy case.  Section 922(g)(8)\nprohibits  an  individual  subject  to  a  domestic  violence  re-\nstraining order from possessing a firearm, so long as certain\ncriteria  are  met.  See  ante,  at  3–4.    Section  922(g)(8)  is\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nSOTOMAYOR, J., concurring\n\nwholly consistent with the Nation’s history and tradition of\nfirearm regulation.\n\nThe Court correctly concludes that “the Second Amend-\nment  permits  the  disarmament  of  individuals  who  pose  a\ncredible threat to the physical safety of others.”  Ante, at 8.\nThat conclusion finds historical support in both the surety\nlaws, which “provided a mechanism for preventing violence\nbefore it occurred” by requiring an individual who posed a\ncredible threat of violence to another to post a surety, and\nthe “going armed” laws, which “provided a mechanism for\npunishing  those  who  had  menaced  others  with  firearms”\nthrough  forfeiture  of  the  arms  or imprisonment.  Ante,  at\n12.  “Taken together, the surety and going armed laws con-\nfirm  what  common  sense  suggests:  When  an  individual\nposes  a  clear  threat  of  physical  violence  to  another,  the\nthreatening individual may be disarmed.”  Ante, at 13.  Sec-\ntion 922(g)(8)’s prohibition on gun possession for individu-\nals subject to domestic violence restraining orders is part of\nthat “tradition of firearm regulation allow[ing] the Govern-\nment to disarm individuals who present a credible threat to\nthe physical safety of others,” ante, at 16, as are the similar\nrestrictions that have been adopted by 48 States and Terri-\ntories, see Brief for United States 34–35, and nn. 22–23 (col-\nlecting statutes).\n\nThe Court’s opinion also clarifies an important methodo-\nlogical  point  that  bears  repeating:  Rather  than  asking\nwhether a present-day gun regulation has a precise histor-\nical  analogue,  courts  applying  Bruen  should  “conside[r]\nwhether  the  challenged  regulation  is  consistent  with  the\nprinciples that underpin our regulatory tradition.”  Ante, at\n7  (emphasis  added);  see  also  ante,  at  7–8  (“The  law  must\ncomport with the principles underlying the Second Amend-\nment, but it need not be a ‘dead ringer’ or a ‘historical twin’ ”\n(quoting  Bruen,  597  U. S.,  at  30)).    Here,  for  example,\nthe  Government  has  not  identified  a  founding-era  or\nReconstruction-era law that specifically disarmed domestic\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nSOTOMAYOR, J., concurring\n\nabusers, see, e.g., Tr. of Oral Arg. 40 (conceding as much),\nbut it did not need to do so.  Although §922(g)(8) “is by no\nmeans identical” to the surety or going armed laws, ante, at\n13, it “restricts gun use to mitigate demonstrated threats of\nphysical violence, just as the surety and going armed laws\nd[id],” ante, at 14.  That shared principle is sufficient.\n\nII\nThe  dissent  reaches  a  different  conclusion  by  applying\nthe  strictest  possible  interpretation  of  Bruen.  It  picks  off\nthe  Government’s  historical  sources  one  by  one,  viewing\nany basis for distinction as fatal.  See, e.g., post, at 18 (opin-\nion of THOMAS, J.) (“Although surety laws shared a common\njustification with §922(g)(8), surety laws imposed a materi-\nally  different  burden”);  post,  at  25–26  (explaining  that\n“[a]ffray laws are wide of the mark” because they “expressly\ncarve out the very conduct §922(g)(8) was designed to pre-\nvent  (interpersonal  violence  in  the  home)”).    The  dissent\nurges a close look “at the historical law’s justification as ar-\nticulated during the relevant time period,” post, at 28, and\na  “careful  parsing  of  regulatory  burdens”  to  ensure  that\ncourts do not “stray too far from [history] by eliding mate-\nrial differences between historical and modern laws,” post,\nat 15.  The dissent criticizes this Court for adopting a more\n“piecemeal approach” that distills principles from a variety\nof historical evidence rather than insisting on a precise his-\ntorical analogue.  Post, at 21.\n\nIf the dissent’s interpretation of Bruen were the law, then\nBruen really would be the “one-way ratchet” that I and the\nother dissenters in that case feared, “disqualify[ing] virtu-\nally any ‘representative historical analogue’ and mak[ing]\nit  nearly  impossible  to  sustain  common-sense  regulations\nnecessary to our Nation’s safety and security.”  597 U. S., at\n112 (Breyer, J., dissenting).  Thankfully, the Court rejects\nthat rigid approach to the historical inquiry.  As the Court\nputs  it  today,  Bruen  was  “not  meant  to  suggest  a  law\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nSOTOMAYOR, J., concurring\n\ntrapped in amber.”  Ante, at 7.\n\nThis case lays bare the perils of the dissent’s approach.\nBecause the dissent concludes that “§922(g)(8) addresses a\nsocietal problem—the risk of interpersonal violence—‘that\nhas  persisted  since  the  18th  century,’ ”  it  insists  that  the\nmeans  of  addressing  that  problem  cannot  be  “ ‘materially\ndifferent’ ” from the means that existed in the 18th century.\nPost, at 7.  That is so, it seems, even when the weapons in\nquestion  have  evolved  dramatically.    See  R.  Roth,  Why\nGuns  Are  and  Are  Not  the  Problem,  in  A  Right  To  Bear\nArms?: The Contested Role of History in Contemporary De-\nbates on the Second Amendment 117 (J. Tucker, B. Hacker,\n&  M.  Vining  eds.  2019)  (explaining  that  guns  in  the  18th\ncentury  took  a  long  time  to  load,  typically  fired  only  one\nshot, and often misfired).  According to the dissent, the so-\nlution cannot be “materially different” even when societal\nperception of the problem has changed, and even if it is now\nclear  to  everyone  that  the  historical  means  of  addressing\nthe  problem  had  been  wholly  inadequate.  Given  the  fact\nthat the law at the founding was more likely to protect hus-\nbands who abused their spouses than offer some measure\nof  accountability,  see,  e.g.,  R.  Siegel,  “The  Rule  of  Love”:\nWife  Beating  as  Prerogative  and  Privacy,  105  Yale  L. J.\n2117, 2154–2170 (1996), it is no surprise that that genera-\ntion  did  not  have  an  equivalent  to  §922(g)(8).  Under  the\ndissent’s approach, the legislatures of today would be lim-\nited not by a distant generation’s determination that such\na  law  was  unconstitutional,  but  by  a  distant  generation’s\nfailure to consider that such a law might be necessary.  His-\ntory has a role to play in Second Amendment analysis, but\na rigid adherence to history, (particularly history predating\nthe inclusion of women and people of color as full members\nof  the  polity),  impoverishes  constitutional  interpretation\nand hamstrings our democracy.\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nSOTOMAYOR, J., concurring\n\nIII\nThe Court today clarifies Bruen’s historical inquiry and\nrejects the dissent’s exacting historical test.  I welcome that\ndevelopment.  That being said, I remain troubled by Bruen’s\nmyopic  focus  on  history  and  tradition,  which  fails  to  give\nfull consideration to the real and present stakes of the prob-\nlems  facing  our  society  today.    In  my  view,  the  Second\nAmendment allows legislators “to take account of the seri-\nous problems posed by gun violence,” Bruen, 597 U. S., at\n91 (Breyer, J., dissenting), not merely by asking what their\npredecessors at the time of the founding or Reconstruction\nthought, but by listening to their constituents and crafting\nnew  and  appropriately  tailored  solutions.  Under  the\nmeans-end scrutiny  that this Court rejected in  Bruen but\n“regularly use[s] . . . in cases involving other constitutional\nprovisions,” id., at 106, the constitutionality of §922(g)(8) is\neven more readily apparent.*\n\nTo  start,  the  Government  has  a  compelling  interest  in\nkeeping firearms out of the hands of domestic abusers.  A\nwoman who lives in a house with a domestic abuser is five\ntimes more likely to be murdered if the abuser has access\nto a gun.  See A. Kivisto & M. Porter, Firearm Use Increases\nRisk of Multiple Victims in Domestic Homicides, 48 J. Am.\nAcad. Psychiatry & L. 26 (2020).  With over 70 people shot\nand killed by an intimate partner each month in the United\nStates, the seriousness of the problem can hardly be over-\nstated.  See  Centers  for  Disease  Control  and  Prevention,\n\n——————\n\n*By “means-end scrutiny,” I refer to the mode of analysis that would\npermit courts “to consider the State’s interest in preventing gun violence,\nthe effectiveness of the contested law in achieving that interest, the de-\ngree to which the law burdens the Second Amendment right, and, if ap-\npropriate,  any  less  restrictive  alternatives.”  Bruen,  597  U. S.,  at  131\n(Breyer, J., dissenting).  Prior to Bruen, the Courts of Appeals would ap-\nply a level of means-end scrutiny “ ‘proportionate to the severity of the\nburden that the law imposes on the right’: strict scrutiny if the burden is\nsevere, and intermediate scrutiny if it is not.”  Id., at 103.\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nSOTOMAYOR, J., concurring\n\nWISQARS  Nat.  Violent  Death  Reporting  System,  Violent\nDeaths  Report  2020,  https://wisqars.cdc.gov/nvdrs  (show-\ning that 863 people were killed with a firearm by a spouse\nor other intimate partner in 2020).  Because domestic vio-\nlence is rarely confined to the intimate partner that receives\nthe  protective  order,  the  Government’s  interest  extends\neven further.  In roughly a quarter of cases where an abuser\nkilled an intimate partner, the abuser also killed someone\nelse, such as a child, family member, or roommate.  See S.\nSmith, K. Fowler, & P. Niolon, Intimate Partner Homicide\nand Corollary Victims in 16 States: National Violent Death\nReporting System, 2003–2009, 104 Am. J. Pub. Health 461,\n463–464 (2014).  Moreover, one study found that domestic\ndisputes were the most dangerous type of call for respond-\ning officers, causing more officer deaths with a firearm than\nany  other  type  of  call.  See  N.  Breul  &  M.  Keith,  Deadly\nCalls and Fatal Encounters: Analysis of U. S. Law Enforce-\nment Line of Duty Deaths When Officers Responded to Dis-\npatched  Calls  for  Service  and  Conducted  Enforcement,\n2010–2014, p. 15 (2016).\n\nWhile  the  Second  Amendment  does  not  yield  automati-\ncally to the Government’s compelling interest, §922(g)(8) is\ntailored  to  the  vital  objective  of  keeping  guns  out  of  the\nhands of domestic abusers.  See ante, at 3–4, 14.  Section\n922(g)(8)  should  easily  pass  constitutional  muster  under\nany level of scrutiny.\n\nAlthough  I  continue  to  think  that  the  means-end  ap-\nproach to Second Amendment analysis is the right one, nei-\nther party asks the Court to reconsider Bruen at this time,\nand that question would of course involve other considera-\ntions  than  whether  Bruen  was  rightly  decided.    Whether\nconsidered  under  Bruen  or  under  means-end  scrutiny,\n§922(g)(8)  clears  the  constitutional  bar.  I  join  in  full  the\nCourt’s opinion, which offers a more helpful model than the\ndissent for lower courts struggling to apply Bruen.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nGORSUCH, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE GORSUCH, concurring.\nMr.  Rahimi  pursues  the  “most  difficult  challenge  to\nmount  successfully”:  a  facial  challenge.  United  States  v.\nSalerno,  481  U. S.  739,  745  (1987).    He  contends  that  18\nU. S. C. §922(g)(8) violates the Second Amendment “in all\nits applications.”  Bucklew v. Precythe, 587 U. S. 119, 138\n(2019).  To prevail, he must show “no set of circumstances”\nexists  in  which  that  law  can  be  applied  without  violating\nthe Second Amendment.  Salerno, 481 U. S., at 745.  I agree\nwith  the  Court  that  he  has  failed  to  make  that  showing.\nAnte, at 8.\n\nThat  is  not  because  the  Constitution  has  little  to  say\nabout  the  matter.  The  Second  Amendment  protects  the\n“right of the people to keep and bear Arms.”  “ ‘[T]ext and\nhistory’ ” dictate the contours of that right.  Ante, at 6 (quot-\ning New York State Rifle & Pistol Assn., Inc. v. Bruen, 597\nU. S. 1, 22 (2022)).  As this Court has recognized, too, the\nAmendment’s  text  “ ‘guarantee[s]  the  individual  right  to\npossess and carry weapons in case of confrontation.’ ”  Id.,\nat 32 (quoting District of Columbia v. Heller, 554 U. S. 570,\n592  (2008)).  And  where  that  “text  covers  an  individual’s\nconduct,” a law regulating that conduct may be upheld only\nif it is “consistent with this Nation’s historical tradition of\nfirearms regulation.”  597 U. S., at 17; see ante, at 6.\n\nIn  this  case,  no  one  questions  that  the  law  Mr.  Rahimi\nchallenges addresses individual conduct covered by the text\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nGORSUCH, J., concurring\n\nof the Second Amendment.  So, in this facial challenge, the\nquestion becomes whether that law, in at least some of its\napplications, is consistent with historic firearm regulations.\nTo prevail, the government need not show that the current\nlaw is a “ ‘dead ringer’ ” for some historical analogue.  Ante,\nat 8 (quoting Bruen, 597 U. S., at 30).  But the government\nmust establish that, in at least some of its applications, the\nchallenged law “impose[s] a comparable burden on the right\nof armed self-defense” to that imposed by a historically rec-\nognized regulation.  Id., at 29; see ante, at 7.  And it must\nshow that the burden imposed by the current law “is com-\nparably justified.”  Bruen, 597 U. S., at 29; see ante, at 7.\n\nWhy do we require those showings?  Through them, we\nseek to honor the fact that the Second Amendment “codified\na pre-existing right” belonging to the American people, one\nthat carries the same “scope” today that it was “understood\nto have when the people adopted” it.  Heller, 554 U. S., at\n592, 634–635.  When the people ratified the Second Amend-\nment,  they  surely  understood  an  arms-bearing  citizenry\nposed some risks.  But just as surely they believed that the\nright protected by the Second Amendment was itself vital\nto  the  preservation  of  life  and  liberty.    See,  e.g.,  1  Black-\nstone’s Commentaries, Editor’s App. 300 (St. George Tucker\ned. 1803) (observing that the Second Amendment may rep-\nresent the “palladium of liberty,” for “[t]he right of self de-\nfence is the first law of nature,” and “in most governments[,]\nit has been the study of rulers to confine this right within\nthe  narrowest  limits”);  3  J.  Story,  Commentaries  on  the\nConstitution of the United States §1890, p. 746 (1833) (“The\nright of the citizens to keep and bear arms has justly been\nconsidered, as the palladium of the liberties of a republic”).\nWe  have  no  authority  to  question  that  judgment.    As\njudges  charged  with  respecting  the  people’s  directions  in\nthe  Constitution—directions  that  are  “trapped  in  amber,”\nsee ante, at 7—our only lawful role is to apply them in the\ncases that come before us.  Developments in the world may\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nGORSUCH, J., concurring\n\nchange, facts on the ground may evolve, and new laws may\ninvite  new  challenges,  but  the  Constitution  the  people\nadopted remains our enduring guide.  Bruen, 597 U. S., at\n27–28; see, e.g., United States v. Jones, 565 U. S. 400, 404–\n405 (2012); Caetano v. Massachusetts, 577 U. S. 411, 411–\n412 (2016) (per curiam).  If changes are to be made to the\nConstitution’s directions, they must be made by the Ameri-\ncan people.  Nor is there anything remotely unusual about\nany of this.  Routinely, litigants and courts alike must con-\nsult history when seeking to discern the meaning and scope\nof  a  constitutional  provision.\nSee  post,  at  6–16\n(KAVANAUGH,  J.,  concurring)  (offering  examples).  And\nwhen  doing  so,  litigants  and  courts  “must  exercise  care.”\nSee post, at 3, n. (BARRETT, J., concurring).\n\nConsider just one example.  We have recognized that the\nSixth  Amendment  enshrines  another  pre-existing  right:\nthe  right  of  a  defendant  to  confront  his  accusers  at  trial.\nCrawford v. Washington, 541 U. S. 36, 54 (2004).  Just as\nhere, we have recognized that, in placing this right in the\nConstitution, the people set its scope, “admitting only those\nexceptions established at the time of the founding.”  Ibid.\nAnd,  just  as  here,  when  a  party  asks  us  to  sustain  some\nmodern  exception  to  the  confrontation  right,  we  require\nthem to point to a close historic analogue to justify it.  See\nGiles v. California, 554 U. S. 353, 358–361 (2008).  Just as\nhere, too, we have expressly rejected arguments that courts\nshould proceed differently, such as by trying to glean from\nhistoric  exceptions  overarching  “policies,”  “ ‘purposes,’ ”  or\n“values” to guide them in future cases.  See id., at 374–375\n(opinion  of  Scalia,  J.).    We  have  rejected  those  paths  be-\ncause  the  Constitution  enshrines  the  people’s  choice  to\nachieve certain policies, purposes, and values “through very\nspecific means”:  the right of confrontation as originally un-\nderstood  at  the  time  of  the  founding.    Id.,  at  375.    As  we\nhave put it, a court may not “extrapolate” from the Consti-\ntution’s text and history “the values behind [that right], and\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nGORSUCH, J., concurring\n\nthen . . . enforce its guarantees only to the extent they serve\n(in the courts’ views) those underlying values.”  Ibid.  Pro-\nceeding that way, we have warned, risks handing judges a\nlicense  to  turn  “the  guarantee  of  confrontation”  into  “no\nguarantee at all.”  Ibid.  As there, so too here:  Courts must\nproceed  with  care  in  making  comparisons  to  historic  fire-\narms regulations, or else they risk gaming away an individ-\nual right the people expressly preserved for themselves in\nthe Constitution’s text.\n\nProceeding with this well in mind today, the Court rightly\nholds that Mr. Rahimi’s facial challenge to §922(g)(8) can-\nnot  succeed.  It  cannot  because,  through  surety  laws  and\nrestrictions  on  “going  armed,”  the  people  in  this  country\nhave understood from the start that the government may\ndisarm an individual temporarily after a “judicial determi-\nnatio[n]” that he “likely would threaten or ha[s] threatened\nanother with a weapon.”  Ante, at 14.  And, at least in some\ncases, the statute before us works in the same way and does\nso for the same reasons:  It permits a court to disarm a per-\nson only if, after notice and hearing, it finds that he “repre-\nsents  a  credible  threat  to  the  physical  safety”  of  others.\n§§922(g)(8)(A), (g)(8)(C)(i).  A court, too, may disarm an in-\ndividual only for so long as its order is in effect.  §922(g)(8).\nIn short, in at least some applications, the challenged law\ndoes  not  diminish  any  aspect  of  the  right  the  Second\nAmendment  was  originally  understood  to  protect.  See\nBruen, 597 U. S., at 24.\n\nI appreciate that one of our colleagues sees things differ-\nently.  Post, at 6–7 (THOMAS, J., dissenting).  But if reason-\nable minds can disagree whether §922(g)(8) is analogous to\npast practices originally understood to fall outside the Sec-\nond Amendment’s scope, we at least agree that is the only\nproper  question  a  court  may  ask.  Post,  at  5.  Discerning\nwhat the original meaning of the Constitution requires in\nthis or that case may sometimes be difficult.  Asking that\nquestion,  however,  at  least  keeps  judges  in  their  proper\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nGORSUCH, J., concurring\n\nlane, seeking to honor the supreme law the people have or-\ndained  rather  than  substituting  our  will  for  theirs.  And\nwhatever indeterminacy may be associated with seeking to\nhonor  the  Constitution’s  original  meaning  in  modern  dis-\nputes,  that  path  offers  surer  footing  than  any  other  this\nCourt has attempted from time to time.  Come to this Court\nwith arguments from text and history, and we are bound to\nreason  through  them  as  best  we  can.  (As  we have  today.)\nAllow judges to reign unbounded by those materials, or per-\nmit  them  to  extrapolate  their  own  broad  new  principles\nfrom those sources, and no one can have any idea how they\nmight rule.  (Except the judges themselves.)  Faithful ad-\nherence to the Constitution’s original meaning may be an\nimperfect guide, but I can think of no more perfect one for\nus to follow.\n\nJust  consider  how  lower  courts  approached  the  Second\nAmendment before our decision in Bruen.  They reviewed\nfirearm regulations under a two-step test that quickly “de-\nvolved”  into  an  interest-balancing  inquiry,  where  courts\nwould weigh a law’s burden on the right against the bene-\nfits  the  law  offered.  See Rogers  v.  Grewal,  590  U. S.  ___,\n___, and n. 1 (2020) (THOMAS, J., joined by KAVANAUGH, J.,\ndissenting from denial of certiorari) (slip op., at 5, and n. 1);\nsee also, e.g., Peruta v. County of San Diego, 742 F. 3d 1144,\n1167–1168,  1176–1177  (CA9  2014);  Drake  v.  Filko,  724\nF. 3d 426, 457 (CA3 2013) (Hardiman, J., dissenting).  Some\njudges expressed concern that the prevailing two-step test\nhad  become  “just  window  dressing  for  judicial  policymak-\ning.”  Duncan v. Bonta, 19 F. 4th 1087, 1148 (CA9 2021) (en\nbanc)  (Bumatay,  J.,  dissenting).    To  them,  the  inquiry\nworked as a “black box regime” that gave a judge broad li-\ncense to support policies he “[f]avored” and discard those he\ndisliked.  Ibid.    How  did  the  government  fare  under  that\nregime?  In one circuit, it had an “undefeated, 50–0 record.”\nId., at 1167, n. 8 (VanDyke, J., dissenting).  In Bruen, we\nrejected that approach for one guided by constitutional text\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nGORSUCH, J., concurring\n\nand history.  597 U. S., at 19.  Perhaps judges’ jobs would\nbe easier if they could simply strike the policy balance they\nprefer.  And a principle that the government always wins\nsurely would be simple for judges to implement.  But either\napproach would let judges stray far from the Constitution’s\npromise.  See Heller, 554 U. S., at 634.\n\nOne  more  point:    Our  resolution  of  Mr.  Rahimi’s  facial\nchallenge to §922(g)(8) necessarily leaves open the question\nwhether the statute might be unconstitutional as applied in\n“particular circumstances.”  Salerno, 481 U. S., at 751.  So,\nfor  example,  we  do  not  decide  today  whether  the  govern-\nment may disarm a person without a judicial finding that\nhe  poses  a  “credible  threat”  to  another’s  physical  safety.\n§922(g)(8)(C)(i); see ante, at 8.  We do not resolve whether\nthe  government  may  disarm  an  individual  permanently.\nSee ante, at 14 (stressing that, “like surety bonds of limited\nduration,  Section  922(g)(8)’s  restriction  was  temporary  as\napplied  to  [Mr.]  Rahimi”).  We  do  not  determine  whether\n§922(g)(8) may be constitutionally enforced against a per-\nson who uses a firearm in self-defense.  Notably, the surety\nlaws that inform today’s decision allowed even an individ-\nual found to pose a threat to another to “obtain an exception\nif he needed his arms for self-defense.”  Ante, at 12; see also\npost, at 23 (THOMAS, J., dissenting).  Nor do we purport to\napprove in advance other laws denying firearms on a cate-\ngorical basis to any group of persons a legislature happens\nto  deem,  as  the  government  puts  it,  “not  ‘responsible.’”\nAnte,  at  17  (quoting  Brief  for  United  States  6);  see  Tr.  of\nOral Arg. 31–32; see also post, at 27 (opinion of THOMAS, J.)\n(“Not  a  single  Member  of  the  Court  adopts  the  Govern-\nment’s theory”).\n\nWe  do  not  resolve  any  of  those  questions  (and  perhaps\nothers like them) because we cannot.  Article III of the Con-\nstitution  vests  in  this  Court  the  power  to  decide  only  the\n“ ‘actual  cas[e]’ ”  before  us,  “ ‘not  abstractions.’ ”    Public\nWorkers v. Mitchell, 330 U. S. 75, 89 (1947).  And the case\n\n\fCite as:  602 U. S. ____ (2024)\n\n7\n\nGORSUCH, J., concurring\n\nbefore us does not pose the question whether the challenged\nstatute  is  always  lawfully  applied,  or  whether  other  stat-\nutes  might  be  permissible,  but  only  whether  this  one  has\nany  lawful  scope.  Nor  should  future  litigants  and  courts\nread any more into our decision than that.  As this Court\nhas long recognized, what we say in our opinions must “be\ntaken  in  connection  with  the  case  in  which  those  expres-\nsions  are  used,”  Cohens  v.  Virginia,  6  Wheat.  264,  399\n(1821),  and  may  not  be  “stretch[ed]  . . .  beyond  their  con-\ntext,” Brown v. Davenport, 596 U. S. 118, 141 (2022).\n\nAmong  all  the  opinions  issued  in  this  case,  its  central\nmessages should not be lost.  The Court reinforces the focus\non text, history, and tradition, following exactly the path we\ndescribed in Bruen.  Ante, at 5–8.  And after carefully con-\nsulting  those  materials,  the  Court  “conclude[s]  only  this”:\n“An individual found by a court to pose a credible threat to\nthe physical safety of another may be temporarily disarmed\nconsistent with the Second Amendment.”  Ante, at 17 (em-\nphasis  added).  With  these  observations,  I  am  pleased  to\nconcur.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nKAVANAUGH, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE KAVANAUGH, concurring.\nThe Framers of the Constitution and Bill of Rights wisely\nsought the best of both worlds: democratic self-government\nand the protection of individual rights against excesses of\nthat  form  of  government.  In  justiciable  cases,  this  Court\ndetermines whether a democratically enacted law or other\nrights\ninfringes  on\ngovernment  action\nguaranteed  by  the  Constitution.  When  performing  that\nArticle  III  duty,  the  Court  does  not  implement  its  own\npolicy  judgments  about,  for  example,  free  speech  or  gun\nregulation.    Rather,  the  Court  interprets  and  applies  the\nConstitution  by  examining  text,  pre-ratification  and  post-\nratification  history,  and  precedent.  The  Court’s  opinion\ntoday does just that, and I join it in full.\n\nindividual\n\nThe concurring opinions, and the briefs of the parties and\namici in this case, raise important questions about judicial\nreliance  on  text,  history,  and  precedent,  particularly  in\nSecond Amendment cases.  I add this concurring opinion to\nreview  the  proper  roles  of  text,  history,  and  precedent  in\nconstitutional interpretation.\n\nI\nThe American people established an enduring American\nConstitution.  The  first  and  most  important  rule  in\nconstitutional  interpretation  is  to  heed  the  text—that  is,\nthe actual words of the Constitution—and to interpret that\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\ntext  according  to  its  ordinary  meaning  as  originally\nunderstood.  The text of the Constitution is the “Law of the\nLand.”  Art.  VI.    As  a  general  matter,  the  text  of  the\nConstitution says what it means and means what it says.\nAnd unless and until it is amended, that text controls.\n\nIn  many  important  provisions,  the  Constitution  is  a\ndocument  of  majestic  specificity  with  “strikingly  clean\nprose.”  A.  Amar,  America’s  Constitution  xi  (2005).    Two\nHouses  of  Congress.  A  House  elected  every  two  years.\nSenators serve 6-year terms.  Two Senators per State.  A\nState’s  equal  suffrage  in  the  Senate  may  not  be  changed\nwithout  the  State’s  consent.    A  two-thirds  House  vote  to\nexpel  a  Member  of  the  House.    The  same  for  the  Senate.\nAppropriations  are  made  by  law.    Bicameralism  and\npresentment.  The  Presidential  veto.  The  Presidential\npardon.  The President serves a 4-year term.  A maximum\nof two elected terms for a President.  The salary of a sitting\nPresident may not be increased or decreased.  A vote of a\nmajority  of  the  House  and  two-thirds  of  the  Senate  to\nremove  a  President.  The  President  nominates  and  the\nSenate confirms principal executive officers.  One Supreme\nCourt.  Tenure  and  salary  protection  for  Supreme  Court\nand  other  federal  judges.  Two-thirds  of  each  House  of\nCongress  together  with  three-fourths  of  the  States  may\namend  the  Constitution.  Congress  meets  at  noon  on\nJanuary 3rd unless otherwise specified by Congress.  The\nDistrict  of  Columbia  votes  in  Presidential  elections.    The\nlist goes on.\n\nThose  and  many  other  constitutional  provisions  are\nrelatively clear.  And when the “framers of the Constitution\nemployed words in their natural sense; and where they are\nplain and clear, resort to collateral aids to interpretation is\nunnecessary and cannot be indulged in to narrow or enlarge\nthe text.”  McPherson v. Blacker, 146 U. S. 1, 27 (1892).\n\nOf course, some provisions of the Constitution are broadly\nworded  or  vague—to  put  it  in  Madison’s  words,  “more  or\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nKAVANAUGH, J., concurring\n\nless obscure and equivocal.”  The Federalist No. 37, p. 229\n(C.  Rossiter  ed.  1961).  As  Chief  Justice  Rehnquist\nexplained, the Constitution is in some parts “obviously not\na specifically worded document but one couched in general\nphraseology.”  W.  Rehnquist,  The  Notion  of  a  Living\nConstitution, 54 Texas L. Rev. 693, 697 (1976).\n\nThat is especially true with respect to the broadly worded\nor vague individual-rights provisions.  (I will use the terms\n“broadly  worded”  and  “vague”  interchangeably  in  this\nopinion.)  For example, the First Amendment provides that\n“Congress  shall  make  no  law”  “abridging  the  freedom  of\nspeech.”  And  the  Second  Amendment,  at  issue  here,\nguarantees  that “the right of  the  people to keep and bear\nArms” “shall not be infringed.”\n\nRead  literally,  those  Amendments  might  seem  to  grant\nabsolute  protection,  meaning  that  the  government  could\nnever regulate speech or guns in any way.  But American\nlaw  has\nlong  recognized,  as  a  matter  of  original\nunderstanding  and  original  meaning,  that  constitutional\nrights generally come with exceptions.\n\nWith respect to the First Amendment, for example, this\nCourt’s  “jurisprudence  over  the  past  216”—now  233—\n“years has rejected an absolutist interpretation.”   Federal\nElection Comm’n v. Wisconsin Right to Life, Inc., 551 U. S.\n449,  482  (2007)  (opinion  of  ROBERTS, C. J.);  see  R.  Bork,\nNeutral Principles and Some First Amendment Problems,\n47 Ind. L. J. 1, 21–22 (1971).  From 1791 to the present, “the\nFirst  Amendment  has  permitted  restrictions  upon  the\ncontent  of  speech  in  a  few  limited  areas”—including\nobscenity,  defamation,  fraud,  and  incitement.    United\nStates  v.  Stevens,  559  U. S.  460,  468  (2010)  (quotation\nmarks  omitted).    So  too  with  respect  to  the  Second\nAmendment:  “Like  most  rights,  the  right  secured  by  the\nSecond Amendment is not unlimited”; it is “not a right to\nkeep  and  carry  any  weapon  whatsoever  in  any  manner\nwhatsoever  and  for  whatever  purpose.”  District  of\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nColumbia v. Heller, 554 U. S. 570, 626 (2008).\n\nII\n\nA  recurring  and  difficult  issue  for  judges,  therefore,  is\nhow to interpret vague constitutional text.  That issue often\narises (as here) in the context of determining exceptions to\ntextually  guaranteed  individual  rights.  To  what  extent\ndoes  the  Constitution  allow  the  government  to  regulate\nspeech or guns, for example?1\n\nIn many cases, judicial precedent informs or controls the\nanswer (more on that later).  But absent precedent, there\nare really only two potential answers to the question of how\nto  determine  exceptions  to  broadly  worded  constitutional\nrights: history or policy.\n\nGenerally speaking, the historical approach examines the\nlaws, practices, and understandings from before and after\nratification  that  may  help  the  interpreter  discern  the\nmeaning  of  the  constitutional  text  and  the  principles\nembodied  in  that  text.  The  policy  approach  rests  on  the\nphilosophical or policy dispositions of the individual judge.\n\nHistory, not policy, is the proper guide.\nFor more than 200 years, this Court has relied on history\nwhen construing vague constitutional text in all manner of\nconstitutional  disputes.  For  good  reason.    History  can\nsupply  evidence  of  the  original  meaning  of  vague  text.\nHistory is far less subjective than policy.  And reliance on\nhistory is more consistent with the properly neutral judicial\n\n——————\n\n1 There  are  two  ways  to  frame  this  point—either  (i)  determining  the\nexceptions  to  a  constitutional  right  or  (ii)  determining  the  affirmative\nscope or contours of that constitutional right.  Either way, the analysis\nis the same—does the constitutional provision, as originally understood,\npermit  the  challenged  law?    This  opinion  uses  the  term  “exceptions,”\nwhich  underscores  that  the  constitutional  baseline  is  protection  of  the\ntextually enumerated right.  See Federal Election Comm’n v. Wisconsin\nRight to Life, Inc., 551 U. S. 449, 482 (2007) (opinion of ROBERTS, C. J.)\n(stating  in  a  First  Amendment  case  that  “it  is  worth  recalling  the\nlanguage we are applying”).\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nKAVANAUGH, J., concurring\n\nrole than an approach where judges subtly (or not so subtly)\nimpose their own policy views on the American people.\n\nJudges are like umpires, as THE CHIEF JUSTICE has aptly\nexplained.  And in a constitutional system that counts on\nan independent Judiciary, judges must act like umpires.  To\nbe an umpire, the judge “must stick close to the text and the\nhistory,  and  their  fair  implications,”  because  there  “is  no\nprincipled way” for a neutral judge “to prefer any claimed\nhuman value to any other.”  R. Bork, Neutral Principles and\nSome First Amendment Problems, 47 Ind. L. J. 1, 8 (1971).\nHistory  establishes  a  “criterion  that  is  conceptually  quite\nseparate  from  the  preferences  of  the  judge  himself.”  A.\nScalia, Originalism: The Lesser Evil, 57 U. Cin. L. Rev. 849,\n864  (1989).  When  properly  applied,  history  helps  ensure\nthat  judges  do  not  simply  create  constitutional  meaning\n“out of whole cloth.”  A. Scalia, The Rule of Law as a Law of\nRules, 56 U. Chi. L. Rev. 1175, 1183 (1989).2\n\nAbsent  precedent,\n\ntherefore,  history  guides\n\nthe\ninterpretation of vague constitutional text.  Of course, this\nCourt has been deciding constitutional cases for about 230\nyears,  so  relevant  precedent  often  exists.  As  the  Court’s\nopinions over time amply demonstrate, precedent matters\na great deal in constitutional interpretation.\n\nI now turn to explaining how courts apply pre-ratification\n\n——————\n\n2 The historical approach applies when the text is vague.  But the text\nof the Constitution always controls.  So history contrary to clear text is\nnot  to  be  followed.    See,  e.g.,  INS  v.  Chadha,  462  U. S.  919,  945–959\n(1983); Powell v. McCormack, 395 U. S. 486, 546–547 (1969); Brown v.\nBoard of Education, 347 U. S. 483, 490–495, and n. 5 (1954); cf. Sedition\nAct of 1798, ch. 74, 1 Stat. 596.  In some cases, there may be debate about\nwhether  the  relevant  text  is  sufficiently  clear  to  override  contrary\nhistorical practices.  See, e.g., NLRB v. Noel Canning, 573 U. S. 513, 613\n(2014) (Scalia, J., concurring in judgment) (“What the majority needs to\nsustain its judgment is an ambiguous text and a clear historical practice.\nWhat it has is a clear text and an at-best-ambiguous historical practice”).\nThe  basic  principle  remains:    Text  controls  over  contrary  historical\npractices.\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nhistory,  post-ratification  history,  and  precedent  when\nanalyzing vague constitutional text.\n\nA\n\nPre-ratification  history.  When\n\ninterpreting  vague\nconstitutional  text,  the  Court  typically  scrutinizes  the\nstated intentions and understandings of the Framers and\nRatifiers  of  the  Constitution\n(or,  as  relevant,  the\nAmendments).  The Court also looks to the understandings\nof the American people from the pertinent ratification era.\nThose  intentions  and  understandings  do  not  necessarily\ndetermine  meaning,  but  they  may  be  strong  evidence  of\nmeaning.  See  generally,  e.g.,  The  Federalist  (C.  Rossiter\ned.  1961);  Records  of  the  Federal  Convention  of  1787  (M.\nFarrand ed. 1911); Debates on the Federal Constitution (J.\nElliot ed. 1836).\n\nEspecially  for  the  original  Constitution  and  the  Bill  of\nRights, the Court also examines the pre-ratification history\nin  the  American  Colonies,  including  pre-ratification  laws\nand practices.  And the Court pays particular attention to\nthe historical laws and practices in the United States from\nIndependence  in  1776  until  ratification  in  1788  or  1791.\nPre-ratification  American  history  can  shed  light  on\nconstitutional meaning in various ways.\n\nFor  example,  some  provisions  of  the  Constitution  use\nlanguage that appeared in the Articles of Confederation or\nstate  constitutional  provisions.  And  when  the  language\nthat  appeared  in  the  Articles  of  Confederation  or  in  state\nconstitutions is the same as or similar to the language in\nthe U. S. Constitution, the history of how people understood\nthe  language  in  the  Articles  or  state  constitutions  can\ninform  interpretation  of  that  language  in  the  U. S.\nConstitution.  See,  e.g.,  Moore  v.  Harper,  600  U. S.  1,  33\n(2023) (the “Framers did not write the Elections Clause on\na blank slate—they instead borrowed from the Articles of\nConfederation”  as  evidenced  by  their  use  of  “closely\n\n\fCite as:  602 U. S. ____ (2024)\n\n7\n\nKAVANAUGH, J., concurring\n\nparallel” language); District of Columbia v. Heller, 554 U. S.\n570,  600–601  (2008)  (“Our  interpretation  is  confirmed  by\nanalogous  arms-bearing  rights  in  state  constitutions  that\npreceded and immediately followed adoption of the Second\nAmendment”); United States Steel Corp. v. Multistate Tax\nComm’n, 434 U. S. 452, 460, and n. 10 (1978) (“The history\nof\nof\nConfederation  suggests  the  same  distinction  between\n‘treaties,  alliances,  and  confederations’  on  the  one  hand,\nand  ‘agreements  and  compacts’  on  the  other,”  as  the\ndistinction made in the Constitution’s Treaty and Compact\nClauses).\n\ninterstate  agreements  under\n\nthe  Articles\n\nSimilarly,  other  pre-ratification  national  or  state  laws\nand  practices  may  sometimes  help  an  interpreter  discern\nthe meaning of particular constitutional provisions.  Those\npre-ratification American laws and practices formed part of\nthe  foundation  on  which  the  Framers  constructed  the\nConstitution  and  Bill  of  Rights.    Indeed,  the  Constitution\ndid  not  displace  but\nlargely  co-exists  with  state\nconstitutions  and  state  laws,  except  to  the  extent  they\nconflict with federal law.  See Art. VI.\n\nOn the other hand, some pre-ratification history can be\nprobative  of  what  the  Constitution  does  not  mean.  The\nFramers  drafted  and  approved  many  provisions  of  the\nConstitution precisely to depart from rather than adhere to\ncertain pre-ratification laws, practices, or understandings.\n\nFor example, the “defects” of the Articles of Confederation\ninspired some of the key decisions made by the Framers in\nPhiladelphia and by the First Congress in drafting the Bill\nof Rights.  The Federalist No. 37, at 224 (J. Madison); see,\ne.g., id., at 226 (“the existing Confederation is founded on\nprinciples which are fallacious; that we must consequently\nchange this first foundation, and with it the superstructure\nresting upon it”); PennEast Pipeline Co. v. New Jersey, 594\nU. S.  482,  508  (2021)  (“When  the  Framers  met  in\nPhiladelphia in the summer of 1787, they sought to create\n\n\f8\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\na cohesive national sovereign in response to the failings of\nthe  Articles  of  Confederation”);  Sosa  v.  Alvarez-Machain,\n542 U. S. 692, 716–717 (2004) (“The Continental Congress\nwas  hamstrung  by  its  inability  to  ‘cause  infractions  of\ntreaties, or of the law of nations to be punished,’ ” and the\n“Framers  responded  by  vesting  the  Supreme  Court  with\noriginal jurisdiction over ‘all Cases affecting Ambassadors,\nother public ministers and Consuls,’ and the First Congress\nfollowed  through”  (citation  omitted));  U. S.  Term  Limits,\nInc.  v.  Thornton,  514  U. S.  779,  803  (1995)  (“After  the\nConstitutional  Convention  convened,  the  Framers  were\npresented  with,  and  eventually  adopted  a  variation  of,  a\nplan not merely to amend the Articles of Confederation but\nto  create  an  entirely  new  National  Government  with  a\nNational  Executive,  National  Judiciary,  and  a  National\nLegislature” (quotation marks omitted)).\n\nof\n\nlikewise\n\nThe pre-ratification history of America’s many objections\nto  British  laws  and  the  system  of  oppressive  British  rule\nover  the  Colonies—identified  most  prominently  in  the\nDeclaration\ninform\nIndependence—can\ninterpretation  of  some  of  the  crucial  provisions  of  the\noriginal  Constitution  and  Bill  of  Rights.\nCompare\nDeclaration  of  Independence  ¶11  (under  British  rule,  the\nKing  “made  Judges  dependent  on  his  Will  alone,  for  the\ntenure of their offices, and the amount and payment of their\nsalaries”) with U. S. Const., Art. III, §1 (“The Judges, both\nof the supreme and inferior Courts, shall hold their Offices\nduring good Behaviour, and shall, at stated Times, receive\nfor  their  Services,  a  Compensation,  which  shall  not  be\ndiminished during  their  Continuance  in  Office”);  see, e.g.,\nThe  Federalist  No.  37,  at  226  (“The  most  that  the\nconvention could do” “was to avoid the errors suggested by\nthe  past  experience  of  other  countries,  as  well  as  of  our\nown”);  1  Annals  of  Cong.  436  (1789)  (J.  Madison)  (“The\nfreedom of the press and rights of conscience, those choicest\nprivileges  of  the  people,  are  unguarded  in  the  British\n\n\fCite as:  602 U. S. ____ (2024)\n\n9\n\nKAVANAUGH, J., concurring\n\nConstitution”).\n\nThis Court has recognized, for example, that no “purpose\nin  ratifying  the  Bill  of  Rights  was  clearer  than  that  of\nsecuring for the people of the United States much greater\nfreedom of religion, expression, assembly, and petition than\nthe  people  of  Great  Britain  had  ever  enjoyed.”    Bridges\nv. California, 314 U. S. 252, 265 (1941).  Ratified as it was\n“while the memory of many oppressive English restrictions\non  the  enumerated  liberties  was  still  fresh,”  the  Bill  of\nRights “cannot reasonably be taken as approving prevalent\nEnglish  practices.”\nIbid.;  see,  e.g.,  Hosanna-Tabor\nEvangelical  Lutheran  Church  and  School  v.  EEOC,  565\nU. S.  171,  183  (2012)  (“Familiar  with  life  under  the\nestablished  Church  of  England,  the  founding  generation\nsought  to  foreclose  the  possibility  of  a  national  church”\nthrough  the  First  Amendment’s  Establishment  Clause);\nPowell v. Alabama, 287 U. S. 45, 60 (1932) (right to counsel\nunder  the  Sixth  Amendment  reflected  America’s  rejection\nof the English common law rule that a “person charged with\ntreason or felony was denied the aid of counsel”).3\n\n——————\n\n3 To be sure, as the Court’s cases reveal, pre-ratification English law\nand practices may supply background for some constitutional provisions.\nBut the Constitution, including the Bill of Rights, did not purport to take\nEnglish law or history wholesale and silently download it into the U. S.\nConstitution.  See, e.g., Harmelin v. Michigan, 501 U. S. 957, 975 (1991)\n(opinion  of  Scalia,  J.)  (“Unless  one  accepts  the  notion  of  a  blind\nincorporation,  however,  the  ultimate  question  is  not  what  ‘cruell  and\nunusuall punishments’ meant in the [English] Declaration of Rights, but\nwhat  its  meaning  was  to  the  Americans  who  adopted  the  Eighth\nAmendment”).  Therefore, reflexively resorting to English law or history\nwithout careful analysis can sometimes be problematic because America\nhad fought a war—and would soon fight another in 1812—to free itself\nfrom British law and practices and rid itself of tyrannical British rule.\nSee  The  Federalist  No.  45,  p.  289  (C.  Rossiter  ed.  1961)  (J.  Madison)\n(“Was,  then,  the  American  Revolution  effected,  was  the  American\nConfederacy formed, was the precious blood of thousands spilt, and the\nhard-earned  substance  of  millions  lavished,  not  that  the  people  of\nAmerica  should  enjoy  peace,  liberty,  and  safety,”  but  that  they  should\n\n\f10\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nThe Equal Protection Clause provides another example.\nRatified in 1868, that Clause sought to reject the Nation’s\nhistory of racial discrimination, not to backdoor incorporate\nracially discriminatory and oppressive historical practices\nand  laws  into  the  Constitution.    See  generally  Flowers  v.\nMississippi, 588 U. S. 284 (2019); Batson v. Kentucky, 476\nU. S.  79  (1986);  Loving  v.  Virginia,  388  U. S.  1  (1967);\nBrown v. Board of Education, 347 U. S. 483 (1954).\n\nIn short, pre-ratification American history—that is, pre-\nlaws,  practices,  and  understandings—can\nratification\ninform interpretation of vague constitutional provisions in\nthe  original  Constitution  and  Bill  of  Rights.  The  same\nprinciple  of  looking  to  relevant  pre-ratification  history\napplies when interpreting broadly worded language in the\nlater  amendments,  including  the  Fourteenth  Amendment\nratified  in  1868.  But  in  using  pre-ratification  history,\ncourts  must  exercise  care  to  rely  only  on  the  history  that\nthe  Constitution  actually  incorporated  and  not  on  the\nhistory that the Constitution left behind.\n\nB\n\ntext  and  determining  exceptions\n\nPost-ratification history.  As the Framers made clear, and\nas this Court has stated time and again for more than two\ncenturies, post-ratification history—sometimes referred to\nas tradition—can also be important for interpreting vague\nconstitutional\nto\nindividual  constitutional  rights.  When  the  text  is  vague\nand  the  pre-ratification  history  is  elusive  or  inconclusive,\npost-ratification  history  becomes  especially  important.\nIndeed, absent precedent, there can be little else to guide a\njudge  deciding  a  constitutional  case  in  that  situation,\nunless  the  judge  simply  defaults  to  his  or  her  own  policy\npreferences.\n\nAfter ratification, the National Government and the state\n\n——————\ncontinue to be subject to the “impious doctrine in the old world, that the\npeople were made for kings, not kings for the people”?).\n\n\fCite as:  602 U. S. ____ (2024)\n\n11\n\nKAVANAUGH, J., concurring\n\ninterpreting  and  applying\n\ngovernments  began\nthe\nConstitution’s  text.  They  have  continued  to  do  so  ever\nsince.  As  the  national  and  state  governments  over  time\nhave  enacted  laws  and  implemented  practices  to  promote\nthe  general  welfare,  those  laws  and  practices  have  often\nreflected  and  reinforced  common  understandings  of  the\nConstitution’s authorizations and limitations.\n\nPost-ratification  interpretations  and  applications  by\ngovernment  actors—at  least  when  reasonably  consistent\nand  longstanding—can  be  probative  of  the  meaning  of\nvague constitutional text.  The collective understanding of\nAmericans who, over time, have interpreted and applied the\nbroadly  worded  constitutional  text  can  provide  good\nguidance  for  a  judge  who  is  trying  to  interpret  that  same\ntext decades or centuries later.  See, e.g., Republican Party\nof Minn. v.  White, 536  U. S. 765, 785 (2002) (a “universal\nlong-established  tradition  of  prohibiting  certain\nand\nconduct creates a strong presumption that the prohibition\nis constitutional” (quotation marks omitted)); United States\nv. Midwest Oil Co., 236 U. S. 459, 472–473 (1915) (“officers,\nlaw-makers and citizens naturally adjust themselves to any\nlong-continued  action”  of  the  government  “on  the\npresumption  that”  unconstitutional  “acts  would  not  have\nbeen allowed to be so often repeated as to crystallize into a\nregular  practice”);  McPherson  v.  Blacker,  146  U. S.  1,  27\n(1892)\nvague,\n“contemporaneous  and  subsequent  practical  construction\nare entitled to the greatest weight”).4\n——————\n\nconstitutional\n\n(when\n\ntext\n\nis\n\n4 Post-ratification  history  is  sometimes  also  referred  to  as  tradition,\nliquidation, or historical gloss.  Those concepts are probably not identical\nin all respects.  In any event, in applying those concepts in constitutional\ninterpretation, some important questions can arise, such as: (i) the level\nof generality at which to define a historical practice; (ii) how widespread\na  historical  practice  must  have  been; (iii) how  long  ago  it  must  have\nstarted; and (iv) how long it must have endured.\n\nAlthough this Court’s constitutional precedents routinely rely on post-\nratification  history,  those  precedents  do  not  supply  a  one-size-fits-all\n\n\f12\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nImportantly, the Framers themselves intended that post-\nratification  history  would  shed  light  on  the  meaning  of\nvague  constitutional  text.    They  understood  that  some\nconstitutional  text  may  be  “more  or  less  obscure  and\nequivocal” such that questions “daily occur in the course of\npractice.”  The  Federalist  No.  37,  at  228–229.  Madison\nexplained  that  the  meaning  of  vague  text  would  be\n“liquidated  and  ascertained  by  a  series  of  particular\ndiscussions and adjudications.”  Id., at 229.  In other words,\nMadison  articulated  the  Framers’  expectation  and  intent\nthat  post-ratification  history  would  be  a  proper  and\nimportant tool to help constitutional interpreters determine\nthe meaning of vague constitutional text.\n\nFrom  early  on,  this  Court  followed  Madison’s  lead.    In\n1819, in one of its most important decisions ever, the Court\naddressed  the  scope  of  Article  I’s  Necessary  and  Proper\nClause.  McCulloch  v.  Maryland,  4  Wheat.  316  (1819).\nWriting for the Court, Chief Justice Marshall invoked post-\nratification history to conclude that Congress’s authority to\nestablish a national bank could “scarcely be considered as\nan open question.”  Id., at 401.  The constitutionality of the\n\n——————\nanswer  to  those  various  methodological  questions.  See,  e.g.,  Noel\nCanning, 573 U. S., at 522–556; Youngstown Sheet & Tube Co. v. Sawyer,\n343 U. S. 579, 610–611 (1952) (Frankfurter, J., concurring).\n\nAnd I will not attempt to answer all of those questions here.  Respected\nscholars are continuing to undertake careful analysis.  See generally J.\nAlicea, Practice-Based Constitutional Theories, 133 Yale L. J. 568 (2023);\nR. Barnett & L. Solum, Originalism After Dobbs, Bruen, and Kennedy:\nThe  Role  of  History  and  Tradition,  118  Nw.  U.  L.  Rev.  433  (2023);  M.\nDeGirolami,  Traditionalism  Rising,  24  J.  Contemp.  Legal  Issues  9\n(2023); S. Girgis, Living Traditionalism, 98 N. Y. U. L. Rev. 1477 (2023);\nW.  Baude,  Constitutional  Liquidation,  71  Stan.  L.  Rev.  1  (2019);  C.\nBradley,  Doing  Gloss,  84  U.  Chi.  L. Rev.  59  (2017);  C.  Bradley  &  T.\nMorrison, Historical Gloss and the Separation of Powers, 126 Harv. L.\nRev.  411  (2012);  A.  Amar,  America’s  Constitution  (2005);  C.  Nelson,\nOriginalism and Interpretive Conventions, 70 U. Chi. L. Rev. 519 (2003);\nM. McConnell, Tradition and Constitutionalism Before the Constitution,\n1998 U. Ill. L. Rev. 173.\n\n\fCite as:  602 U. S. ____ (2024)\n\n13\n\nKAVANAUGH, J., concurring\n\nnational  bank  had  “been  recognised  by  many  successive\nlegislatures,”  and  an  “exposition  of  the  constitution,\ndeliberately established by legislative acts, on the faith of\nwhich an immense property has been advanced, ought not\nto  be  lightly  disregarded.”    Ibid.   Marshall  added:  The\n“respective  powers  of  those  who  are  equally  the\nrepresentatives of the people, are to be adjusted; if not put\nat rest by the practice of the government, ought to receive a\nconsiderable impression from that practice.”  Ibid.\n\nIn relying on post-ratification history as a proper tool to\ndiscern  constitutional  meaning,  Madison  and  Marshall\nmake for a formidable duo.  Moving from distant American\nhistory  to  more  recent  times,  one  can  add  Justice  Scalia.\nThroughout his consequential 30-year tenure on this Court,\nJustice  Scalia  repeatedly  emphasized  that  constitutional\ninterpretation  must  take  account  of  text,  pre-ratification\nhistory, and post-ratification history—the last of which he\noften referred to as “tradition.”  In his words, when judges\ninterpret vague or broadly worded constitutional text, the\n“traditions  of  our  people”  are  “paramount.”    McDonald  v.\nChicago, 561 U. S. 742, 792 (2010) (Scalia, J., concurring).\nConstitutional interpretation should reflect “the principles\nadhered to, over time, by the American people, rather than\nthose  favored  by  the  personal  (and  necessarily  shifting)\nphilosophical  dispositions  of  a  majority  of  this  Court.”\nRutan  v.  Republican  Party  of  Ill.,  497  U. S.  62,  96  (1990)\n(Scalia, J., dissenting).\n\nThe U. S. Reports are well stocked with Scalia opinions\nlooking to post-ratification history and tradition.5  In Heller,\n\n——————\n\n5 Justice  Scalia’s  opinions  “made  extensive  use  of  post-ratification\nhistory,”  and  “his  assessment  of  post-ratification  history”  in  those\nopinions  extended  “far  beyond  the  time  of  enactment.”    M.  Ramsey,\nBeyond the Text: Justice Scalia’s Originalism in Practice, 92 Notre Dame\nL. Rev. 1945, 1957, 1960 (2017).  Justice Scalia did not necessarily “use[ ]\ntradition as an independent source of interpretive authority; rather, he\nhad a very broad view of what traditions might be indicative of original\n\n\f14\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nJustice  Scalia  wrote  for  the  Court  that  “a  critical  tool  of\nconstitutional  interpretation”  is  “the  examination  of  a\nvariety  of  legal  and  other  sources  to  determine  the  public\nunderstanding  of  a  legal  text  in  the  period  after  its\nenactment or ratification.”  554 U. S., at 605 (emphasis in\noriginal); see also ibid. (“We now address how the Second\nAmendment  was  interpreted  from  immediately  after  its\nratification through the end of the 19th century”).\n\nHeller  echoed  years  of  earlier  Scalia  opinions.    To  take\none:  “Where the meaning of a constitutional text (such as\n‘the freedom of speech’) is unclear, the widespread and long-\naccepted  practices  of  the  American  people  are  the  best\nindication  of  what  fundamental  beliefs  it  was intended  to\nenshrine.”  McIntyre  v.  Ohio  Elections  Comm’n,  514  U. S.\n334,  378  (1995)  (Scalia,  J.,  dissenting).  Or  another:  A\n“venerable  and  accepted  tradition  is  not  to  be  laid  on  the\n\n——————\nmeaning.”  Id., at 1962, n. 79; see, e.g., NLRB v. Noel Canning, 573 U. S.\n513,  584–593,  602–615  (2014)  (Scalia,  J.,  concurring  in  judgment);\nDistrict of Columbia v. Heller, 554 U. S. 570, 605–619, 626–628 (2008);\nMcCreary County v. American Civil Liberties Union of Ky., 545 U. S. 844,\n886–900  (2005)  (Scalia,  J.,  dissenting);  Hamdi  v.  Rumsfeld,  542  U. S.\n507, 558–563 (2004) (Scalia, J., dissenting); Crawford v. Washington, 541\nU. S. 36, 47–50 (2004); Mitchell v. United States, 526 U. S. 314, 334–336,\nand  n.  1  (1999)  (Scalia,  J.,  dissenting);  Department  of  Commerce  v.\nUnited  States  House  of  Representatives,  525  U. S.  316,  347–349  (1999)\n(Scalia, J., concurring in part); Clinton v. City of New York, 524 U. S. 417,\n465–469  (1998)  (Scalia,  J.,  concurring  in  part  and  dissenting  in  part);\nPrintz v. United States, 521 U. S. 898, 905–918 (1997); United States  v.\nGaudin,  515  U. S.  506,  515–519  (1995);  McIntyre  v.  Ohio  Elections\nComm’n,  514  U. S.  334,  375–378,  and  nn.  1–2  (1995)  (Scalia,  J.,\ndissenting);  Plaut  v.  Spendthrift  Farm,  Inc.,  514  U. S.  211,  223–225\n(1995); Board of Ed. of Kiryas Joel Village School Dist. v. Grumet, 512\nU. S. 687, 732, 744 (1994) (Scalia, J., dissenting); Herrera v. Collins, 506\nU. S.  390,  427–428  (1993)  (Scalia,  J.,  concurring);  Richmond  v.  Lewis,\n506 U. S. 40, 54 (1992) (Scalia, J., dissenting); Harmelin v. Michigan, 501\nU. S.  957,  979–985  (1991)  (opinion  of  Scalia,  J.);  Rutan  v.  Republican\nParty of Ill., 497 U. S. 62, 95–97 (1990) (Scalia, J., dissenting); McKoy v.\nNorth  Carolina,  494  U. S.  433,  466,  471  (1990)  (Scalia,  J.,  dissenting);\nHolland v. Illinois, 493 U. S. 474, 481–482, and n. 1 (1990).\n\n\fCite as:  602 U. S. ____ (2024)\n\n15\n\nKAVANAUGH, J., concurring\n\nexamining table and scrutinized for its conformity to some\nabstract  principle”  of  “adjudication  devised  by  this  Court.\nTo the contrary, such traditions are themselves the stuff out\nof which the Court’s principles are to be formed.  They are,\nin  these  uncertain  areas,  the  very  points  of  reference  by\nwhich the legitimacy or illegitimacy of other practices is to\nbe  figured  out.”  Rutan,  497  U. S.,  at  95–96  (Scalia,  J.,\ndissenting) (emphasis in original).\n\nAs leading actors and theorists in the earliest and latest\nchapters  of  the  American  constitutional  story,  Madison,\nMarshall, and Scalia made clear that courts should look to\npost-ratification  history  as  well  as  pre-ratification  history\nto interpret vague constitutional text.\n\nFor  more  than  two  centuries—from  the  early  1800s  to\nthis  case—this  Court  has  done  just  that.  The  Court  has\nrepeatedly employed post-ratification history to determine\nthe meaning of vague constitutional text.  Reliance on post-\nratification  history  “has  shaped  scores  of  Court  cases\nspanning all domains of constitutional law, every era of the\nnation’s  history,  and  Justices  of  every  stripe.”    S.  Girgis,\nLiving  Traditionalism,  98  N.  Y.  U.  L.  Rev.  1477,  1480\n(2023); see, e.g., Consumer Financial Protection Bureau v.\nCommunity Financial Services Assn. of America, Ltd., 601\nU. S. 416, 441–445 (2024) (KAGAN, J., concurring); Trump\nv.  Anderson,  601  U. S.  100,  113–115  (2024)  (per curiam);\nMoore v. Harper, 600 U. S. 1, 22, 32–34 (2023); Kennedy v.\nBremerton  School Dist., 597 U. S. 507, 535–536, 540–541,\nand n. 6 (2022); New York State Rifle & Pistol Assn., Inc. v.\nBruen, 597 U. S. 1, 35–37, 50–70 (2022); City of Austin v.\nReagan  Nat.  Advertising  of  Austin,  LLC,  596  U. S.  61,  75\n(2022); Houston Community College System v. Wilson, 595\nU. S.  468,  474–477  (2022);  PennEast  Pipeline  Co.  v.  New\nJersey,  594  U. S.  482,  494–497,  508  (2021);  TransUnion\nLLC  v.  Ramirez,  594  U. S.  413,  424–425,  432–434  (2021);\nTorres  v.  Madrid,  592  U. S.  306,  314  (2021);  Trump  v.\nMazars USA, LLP, 591 U. S. 848, 858–862 (2020); Chiafalo\n\n\f16\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nv.  Washington,  591  U. S.  578,  592–597  (2020);  American\nLegion  v.  American  Humanist  Assn.,  588  U. S.  29,  58–66\n(2019); Zivotofsky v. Kerry, 576 U. S. 1, 15–17, 23–28 (2015);\nTown of Greece v. Galloway, 572 U. S. 565, 575–579 (2014);\nDistrict of Columbia v. Heller, 554 U. S. 570, 605–619, 626–\n628  (2008);  Crawford  v.  Washington,  541  U. S.  36,  47–50\n(2004); Apprendi v. New Jersey, 530 U. S. 466, 481–483, and\nn. 10 (2000); Medina v. California, 505 U. S. 437, 445–448\n(1992); Holland v. Illinois, 493 U. S. 474, 481–482, and n. 1\n(1990); Marsh v. Chambers, 463 U. S. 783, 786–792 (1983);\nDames  &  Moore  v.  Regan,  453  U. S.  654,  678–682  (1981);\nWalz  v.  Tax  Comm’n  of  City  of  New  York,  397  U. S.  664,\n676–680 (1970); Powell v. McCormack, 395 U. S. 486, 522,\n541–547 (1969); Youngstown Sheet & Tube Co. v. Sawyer,\n343 U. S. 579, 610–613 (1952) (Frankfurter, J., concurring);\nUnited States v. Curtiss-Wright Export Corp., 299 U. S. 304,\n321–329 (1936); The Pocket Veto Case, 279 U. S. 655, 688–\n691 (1929); Myers v. United States, 272 U. S. 52, 155–158\n(1926);  United  States  v.  Midwest  Oil  Co.,  236  U. S.  459,\n469–475  (1915);  Marshall  Field  &  Co.  v.  Clark,  143  U. S.\n649,  683–692  (1892);  Murray’s  Lessee  v.  Hoboken  Land  &\nImprovement Co., 18 How. 272, 279–280 (1856); McCulloch\nv. Maryland, 4 Wheat. 316, 400–401 (1819).6\n\n——————\n\n6 The  Court  has  similarly  relied  on  history  when  deciding  cases\ninvolving textually unenumerated rights under the Due Process Clause\nor the Privileges or Immunities Clause.  In those contexts, the baseline\nis 180-degrees different:  The text supplies no express protection of any\nasserted substantive right.  The Court has recognized exceptions to that\ntextual  baseline,  but  in  doing  so  has  regularly  observed  that  the\nFourteenth  Amendment  “specially  protects  those  fundamental  rights\nand liberties which are, objectively, deeply rooted in this Nation’s history\nand tradition.”  Washington v. Glucksberg, 521 U. S. 702, 720–721 (1997)\n(quotation marks omitted); see, e.g., Pierce v. Society of Sisters, 268 U. S.\n510,  534–535  (1925)  (“liberty  of  parents  and  guardians  to  direct  the\nupbringing and education of children under their control”).\n\n\fCite as:  602 U. S. ____ (2024)\n\n17\n\nKAVANAUGH, J., concurring\n\nC\n  Precedent.  With  a  Constitution  and  a  Supreme  Court\nthat are both more than two centuries old, this Court and\nother  courts  are  rarely  interpreting  a  constitutional\nprovision for the first time.  Rather, a substantial body of\nfor  many\nSupreme  Court  precedent  already  exists\nprovisions of the Constitution.\n\nPrecedent  is  fundamental  to  day-to-day  constitutional\ndecisionmaking  in  this  Court  and  every  American  court.\nThe “judicial Power” established in Article III incorporates\nthe principle of stare decisis, both vertical and horizontal.\nAs Hamilton stated, to “avoid an arbitrary discretion in the\ncourts, it is indispensable that they should be bound down\nby strict rules and precedents” that will “unavoidably swell\nto a very considerable bulk” and “serve to define and point\nout  their  duty  in  every  particular  case  that  comes  before\nthem.”  The Federalist No. 78, at 471 (A. Hamilton).\n\nCourts  must  respect  precedent,  while  at  the  same  time\nrecognizing that precedent on occasion may appropriately\nbe overturned.  See, e.g., Brown, 347 U. S. 483; West Coast\nHotel Co. v. Parrish, 300 U. S. 379 (1937); see also Ramos\nv. Louisiana, 590 U. S. 83, 115–132 (2020) (KAVANAUGH, J.,\nconcurring  in  part).    In  light  of  the  significant  amount  of\nSupreme Court precedent that has built up over time, this\nCourt and other courts often decide constitutional cases by\nreference to those extensive bodies of precedent.\n\nEven then, however, text and history still matter a great\ndeal.  When determining how broadly or narrowly to read a\nprecedent;  when  determining  whether  to  extend,  limit,  or\nnarrow a precedent; or in relatively infrequent cases, when\ndetermining whether to overrule a precedent, a court often\nwill  consider  how  the  precedent  squares  with  the\nConstitution’s text and history.  Therefore, the text, as well\nas  pre-ratification  and  post-ratification  history,  may\nappropriately function as a gravitational pull on the Court’s\ninterpretation  of  precedent.    See  Free  Enterprise  Fund\n\n\f18\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nv. Public  Company  Accounting  Oversight  Bd.,  537  F. 3d\n667,  698  (CADC  2008)  (Kavanaugh,  J.,  dissenting)  (“We\nshould  resolve  questions  about  the  scope  of  those\nprecedents  in  light  of  and  in  the  direction  of  the\nconstitutional text and constitutional history”).\n\nis\n\nBut  the\n\nfirst  stop\n\nin  this  Court’s  constitutional\ndecisionmaking\nprecedents—the\nthe\naccumulated wisdom of jurists from Marshall and Story to\nHarlan  and  Taft;  from  Hughes  and  Black  to  Jackson  and\nWhite;  from  Rehnquist  and  O’Connor  to  Kennedy  and\nScalia; and so on.\n\nCourt’s\n\nIII\nSome  say  that  courts  should  determine  exceptions  to\nbroadly  worded  individual  rights,  including  the  Second\nAmendment,  by  looking  to  policy.    Uphold  a  law  if  it  is  a\ngood idea; strike it down if it is not.  True, the proponents\nof  a  policy-based  approach  to  interpretation  of  broadly\nworded  or  vague  constitutional  text  usually  do  not  say  so\nexplicitly  (although  some  do).  Rather,  they  support  a\nbalancing  approach  variously  known  as  means-end\nscrutiny,  heightened  scrutiny,  tiers  of  scrutiny,  rational\nbasis  with  bite,  or  strict  or  intermediate  or  intermediate-\nplus or rigorous or skeptical scrutiny.  Whatever the label\nof  the  day,  that  balancing  approach  is  policy  by  another\nname.  It requires judges to weigh the benefits against the\nburdens of a law and to uphold the law as constitutional if,\nin  the  judge’s  view,  the  law  is  sufficiently  reasonable  or\nimportant.    See  M.  Barnes  &  E.  Chemerinsky,  The  Once\nand  Future  Equal  Protection  Doctrine?,  43  Conn.  L. Rev.\n1059,  1080  (2011)  (“The  levels  of  scrutiny  are  essentially\nbalancing tests”).\n\nTo  begin,  as  I  have  explained,  that  kind  of  balancing\napproach  to  constitutional  interpretation  departs  from\nwhat Framers such as Madison stated, what jurists such as\nMarshall  and  Scalia  did,  what  judges  as  umpires  should\n\n\fCite as:  602 U. S. ____ (2024)\n\n19\n\nKAVANAUGH, J., concurring\n\nstrive to do, and what this Court has actually done across\nthe constitutional landscape for the last two centuries.\n\nThe  balancing  tests  (heightened  scrutiny  and  the  like)\nare a relatively modern judicial innovation in constitutional\ndecisionmaking.  The “tiers of scrutiny have no basis in the\ntext or original meaning of the Constitution.”  J. Alicea & J.\nOhlendorf,  Against  the  Tiers  of  Constitutional  Scrutiny,\nNational Affairs 72, 73 (2019).  And before the late 1950s,\n“what  we  would  now  call  strict  judicial  scrutiny  did  not\nexist.”  R. Fallon, The Nature of Constitutional Rights: The\nInvention and Logic of Strict Judicial Scrutiny 30 (2019).\nThe Court “appears to have adopted” heightened-scrutiny\ntests  “by  accident”  in  the  1950s  and  1960s  in  a  series  of\nCommunist  speech  cases,  “rather  than  as  the  result  of  a\nconsidered judgment.”  Simon & Schuster, Inc. v. Members\nof N. Y. State Crime Victims Bd., 502 U. S. 105, 125 (1991)\n(Kennedy,  J.,  concurring  in  judgment).    The  Court  has\nemployed balancing only in discrete areas of constitutional\nlaw—and even in those cases, history still tends to play a\nfar larger role than overt judicial policymaking.7\n\nTo be clear, I am not suggesting that the Court overrule\ncases  where  the  Court  has  applied  those  heightened-\nscrutiny tests.  But I am challenging the notion that those\n\n——————\n\n7 The Court has articulated a heightened-scrutiny test in some pockets\nof  free-speech  jurisprudence.    But  even  when  invoking  heightened\nscrutiny in that context, the Court still often relies directly on history.\nSee, e.g., City of Austin v. Reagan Nat. Advertising of Austin, LLC, 596\nU. S.  61,  75  (2022)  (a  city’s  regulation  of  solely  off-premises  billboards\nwas  within  “the  Nation’s  history  of  regulating  off-premises  signs”  as\n“federal, state, and local jurisdictions have repeatedly relied upon on-/off-\npremises  distinctions”  “for  the  last  50-plus  years”);  Perry  Ed.  Assn.  v.\nPerry  Local  Educators’  Assn.,  460  U. S.  37,  45–46  (1983)  (“In  places\nwhich by long tradition” “have been devoted to assembly and debate, the\nrights  of  the  State  to\nlimit  expressive  activity  are  sharply\ncircumscribed”).  The Court has also used heightened scrutiny in certain\nequal protection cases.  As discussed above, the Equal Protection Clause\nrejected the history of racially discriminatory laws and practices.\n\n\f20\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nthe  ordinary  approach\n\ntests  are\nto  constitutional\ninterpretation.  And I am arguing against extending those\ntests to new areas, including the Second Amendment.\n\nOne  major  problem  with  using  a balancing  approach  to\ndetermine  exceptions  to  constitutional  rights  is  that  it\nrequires  highly  subjective  judicial  evaluations  of  how\nimportant a law is—at least unless the balancing test itself\nincorporates history, in which case judges might as well just\ncontinue to rely on history directly.\n\nThe  subjective  balancing  approach  forces  judges  to  act\nmore  like  legislators  who  decide  what  the  law  should  be,\nrather than judges who “say what the law is.”  Marbury v.\nMadison,  1  Cranch  137,  177  (1803).    That  is  because  the\nbalancing approach requires judges to weigh the benefits of\na law against its burdens—a value-laden and political task\nthat is usually reserved for the political branches.  And that\npower in essence vests judges with “a roving commission to\nsecond-guess”\nlegislators  and  administrative  officers\n“concerning  what  is  best  for  the  country.”    W.  Rehnquist,\nThe Notion of a Living Constitution, 54 Texas L. Rev. 693,\n698 (1976).  Stated otherwise, when a court “does not have\na  solid  textual  anchor  or  an  established  social  norm  from\nwhich  to  derive  the  general  rule,  its  pronouncement\nappears  uncomfortably  like  legislation.”    A.  Scalia,  The\nRule of Law as a Law of Rules, 56 U. Chi. L. Rev. 1175, 1185\n(1989).\n\nMoreover,  the  balancing  approach  is  ill-defined.    Some\njudges will apply heightened scrutiny with a presumption\nin favor of deference to the legislature.  Other judges will\napply  heightened  scrutiny  with  a  presumption  in  favor  of\nthe individual right in question.  Because it is unmoored,\nthe  balancing  approach  presents  the  real  “danger”  that\n“judges will mistake their own predilections for the law.”  A.\nScalia, Originalism: The Lesser Evil, 57 U. Cin. L. Rev. 849,\n863 (1989).  Under the balancing approach, to use Justice\nScalia’s  characteristically  vivid  description,  if  “We  The\n\n\fCite as:  602 U. S. ____ (2024)\n\n21\n\nKAVANAUGH, J., concurring\n\nCourt  conclude  that  They  The  People’s  answers  to  a\nproblem” are unwise, “we are free to intervene,” but if we\n“think the States may be on to something, we can loosen the\nleash.”  McDonald  v.  Chicago,  561  U. S.  742,  803  (2010)\n(concurring opinion) (quotation marks omitted).\n\nThe  balancing  approach  can  be  antithetical  to  the\nprinciple that judges must act like umpires.  It turns judges\ninto players.  Justice Black once protested that the Court\nshould not balance away bedrock free speech protections for\nthe perceived policy needs of the moment.  He argued that\n“the  balancing  approach”  “disregards  all  of  the  unique\nfeatures  of  our  Constitution”  by  giving  “the  Court,  along\nwith Congress, a greater power, that of overriding the plain\ncommands  of  the  Bill  of  Rights  on  a  finding  of  weighty\npublic interest.”  H. Black, The Bill of Rights, 35 N. Y. U. L.\nRev. 865, 878–879 (1960).  Like Justice Black, the Court in\nHeller cautioned that a “constitutional guarantee subject to\nfuture\nis  no\nconstitutional guarantee at all.”  554 U. S. 570, 634 (2008).\nSome respond that history can be difficult to decipher.  It\nis true that using history to interpret vague text can require\n“nuanced  judgments,”  McDonald,  561  U. S.,  at  803–804\n(Scalia,  J.,  concurring),  and  is  “sometimes  inconclusive,”\nScalia, Originalism: The Lesser Evil, 57 U. Cin. L. Rev., at\n864.  But at a minimum, history tends to narrow the range\nof  possible  meanings  that  may  be  ascribed  to  vague\nconstitutional  language.  A  history-based  methodology\nimposes  a  neutral  and\nsupplies  direction  and\njudicial\nconstraint\ninfused\ndemocratically\ndecisionmaking.\n\njudges’  assessments  of\n\nits  usefulness\n\non\n\nThe historical approach is not perfect.  But “the question\nto be decided is not whether the historically focused method\nis  a  perfect  means  of  restraining  aristocratic  judicial\nConstitution-writing;  but  whether  it  is  the  best  means\navailable in an imperfect world.”  McDonald, 561 U. S., at\n804 (Scalia, J., concurring) (emphasis in original).  And the\n\n\f22\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\nhistorical  approach  is  superior  to  judicial  policymaking.\nThe historical approach “depends upon a body of evidence\nsusceptible  of  reasoned  analysis  rather  than  a  variety  of\nvague  ethico-political  First  Principles  whose  combined\nconclusion can be found to point in any direction the judges\nfavor.”  Ibid.  Moreover, the historical approach “intrudes\nless  upon  the  democratic  process  because  the  rights  it\nacknowledges  are  those  established  by  a  constitutional\nhistory  formed  by  democratic  decisions;  and  the  rights  it\nfails to acknowledge are left to be democratically adopted or\nrejected by the people.”  Id., at 805.\n\nIV\n\nThis  Court’s  Second  Amendment  jurisprudence  has\ncarefully followed and reinforced the Court’s longstanding\napproach to constitutional interpretation—relying on text,\npre-ratification\nand\nprecedent.\n\npost-ratification  history,\n\nand\n\nIn  Heller,  the  Court  began  with  the  baseline  point  that\nthe Second Amendment textually guarantees an individual\n  The  Court  then  explained  that  the  Second\nright.\nAmendment  right  is,  of  course,  “not  a  right  to  keep  and\ncarry  any  weapon  whatsoever  in  any  manner  whatsoever\nand  for  whatever  purpose”  and  is  subject  to  “important”\nlimitations.  554 U. S. 570, 626–627 (2008).\n\nAlthough  Heller  declined  to  “undertake  an  exhaustive\nhistorical  analysis,”  it  recognized  a  few  categories  of\ntraditional  exceptions  to  the  right.    Id.,  at  626.  For\nexample, Heller indicated that: (i) “prohibitions on carrying\nconcealed  weapons  were\nthe  Second\nAmendment  attaches  only  to  weapons  “in  common  use”\nbecause “that limitation is fairly supported by the historical\ntradition  of  prohibiting  the  carrying  of  dangerous  and\nunusual  weapons”;  and  (iii)  “longstanding  prohibitions  on\nthe possession of firearms by felons and the mentally ill, or\nlaws forbidding the carrying of firearms in sensitive places\n\nlawful”;\n\n(ii)\n\n\fCite as:  602 U. S. ____ (2024)\n\n23\n\nKAVANAUGH, J., concurring\n\nsuch as schools and government buildings, or laws imposing\nconditions  and  qualifications  on  the  commercial  sale  of\narms”  are  presumptively  constitutional.  Id.,  at  626–627\n(quotation marks omitted).\n\nthe\n\nthe\n\nCourt\n\nreiterated\n\nIn  McDonald,  the  Court  held  that  the  Second\nAmendment  was  incorporated  against  the  States.  In  so\nholding,\npresumed\nconstitutionality of the “longstanding regulatory measures”\nidentified  in  Heller.  561  U. S.  742,  786  (2010)  (plurality\nopinion).\n  Then,  in  Bruen,  the  Court  repeated  that  the  “Nation’s\nhistorical  tradition  of  firearm  regulation”  guides  the\nconstitutional analysis of gun regulations and exceptions to\nthe right to bear arms.  597 U. S. 1, 17 (2022); see id., at 79–\n81 (KAVANAUGH, J., concurring).\n\nThis  Court’s  approach  in  those  three  recent  Second\nAmendment  cases—and  in  the  Court’s  opinion  today—is\nentirely  consistent  with  the  Court’s  longstanding  reliance\non history and precedent to determine the meaning of vague\nconstitutional  text.  Heller  rested  on  “constitutional  text\nand history,” ante, at 6 (quotation marks omitted), and laid\nthe foundation for McDonald and then Bruen.\n\nIn  today’s  case,  the  Court  carefully  builds  on  Heller,\nMcDonald, and Bruen.  The Court applies the historical test\nthat those precedents have set forth—namely, “whether the\nnew law is relevantly similar to laws that our tradition is\nunderstood  to  permit.”  Ante,  at  7  (quotation  marks\nomitted).  The Court  examines “our historical tradition of\nfirearm  regulation,”  ante,  at  6  (quotation  marks  omitted),\nand  correctly  holds  that  America’s  “tradition  of  firearm\nregulation  allows  the  Government  to  disarm  individuals\nwho  present  a  credible  threat  to  the  physical  safety  of\nothers,” ante, at 16.  The law before us “fits neatly within\nthe tradition the surety and going armed laws represent.”\nAnte, at 13–14.\n\nAs the Court’s decision today notes, Second Amendment\n\n\f24\n\nUNITED STATES v. RAHIMI\n\nKAVANAUGH, J., concurring\n\njurisprudence is still in the relatively early innings, unlike\nthe  First,  Fourth,  and  Sixth  Amendments,  for  example.\nThat is because the Court did not have occasion to recognize\nthe  Second  Amendment’s  individual  right  until  recently.\nSee generally Heller v. District of Columbia, 670 F. 3d 1244,\n1269–1296  (CADC  2011)  (Kavanaugh,  J.,  dissenting).\nDeciding  constitutional  cases  in  a  still-developing  area  of\nthis Court’s jurisprudence can sometimes be difficult.  But\nthat is not a permission slip for a judge to let constitutional\nanalysis morph into policy preferences under the guise of a\nbalancing  test  that  churns  out  the  judge’s  own  policy\nbeliefs.\n\n*\n\n*\n\ntoday,\n\nconstitutional\n\n*\nAs  exemplified  by  Heller,  McDonald,  Bruen,  and  the\nCourt’s  opinion\ninterpretation\nproperly  takes  account  of  text,  pre-ratification  and  post-\nratification history, and precedent.  Those are the tools of\nthe trade for an American judge interpreting the American\nConstitution.  Of course, difficult subsidiary questions can\narise about how to apply those tools, both generally and in\nparticular  cases.  And  in  some  cases,  text,  history,  and\nprecedent may point in somewhat different directions.  In\nlaw as in life, nothing is perfect.  But in Second Amendment\ncases  as  in  other  constitutional  cases,  text,  history,  and\nprecedent must remain paramount.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nBARRETT, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE BARRETT, concurring.\nDespite  its  unqualified  text,  the  Second  Amendment  is\nnot  absolute.    It  codified  a  pre-existing  right,  and  pre-\nexisting limits on that right are part and parcel of it.  Dis-\ntrict of Columbia v. Heller, 554 U. S. 570, 595, 627 (2008).\nThose limits define the scope of “the right to bear arms” as\nit was originally understood; to identify them, courts must\nexamine  our  “historical  tradition  of  firearm  regulation.”\nNew York State Rifle & Pistol Assn., Inc. v. Bruen, 597 U. S.\n1, 17, 19 (2022).  That evidence marks where the right stops\nand the State’s authority to regulate begins.  A regulation\nis  constitutional  only  if  the  government  affirmatively\nproves that it is “consistent with the Second Amendment’s\ntext and historical understanding.”  Id., at 26.\n\nBecause the Court has taken an originalist approach to\nthe Second Amendment, it is worth pausing to identify the\nbasic  premises  of  originalism.    The  theory  is  built  on  two\ncore  principles:  that  the  meaning  of  constitutional  text  is\nfixed at the time of its ratification and that the “discovera-\nble historical meaning . . . has legal significance and is au-\nthoritative  in  most  circumstances.”    K.  Whittington,\nOriginalism: A Critical Introduction, 82 Ford. L. Rev. 375,\n378 (2013) (Whittington).  Ratification is a democratic act\nthat  renders  constitutional  text  part  of  our  fundamental\nlaw, see Arts. V, VII, and that text “remains law until law-\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nBARRETT, J., concurring\n\nfully altered,” S. Sachs, Originalism: Standard and Proce-\ndure, 135 Harv. L. Rev. 777, 782 (2022).  So for an original-\nist, the history that matters most is the history surrounding\nthe  ratification  of  the  text;  that  backdrop  illuminates  the\nmeaning of the enacted law.  History (or tradition) that long\npostdates  ratification does  not  serve  that  function.    To be\nsure, postenactment history can be an important tool.  For\nexample, it can “reinforce our understanding of the Consti-\ntution’s original meaning”; “liquidate ambiguous constitu-\ntional provisions”; provide persuasive evidence of the origi-\nnal  meaning;  and,  if  stare  decisis  applies,  control  the\noutcome.  See Vidal v. Elster, 602 U. S. ___, ___–___ (2024)\n(BARRETT, J., concurring in part) (slip op., at 13–14).  But\ngenerally  speaking,  the  use  of  postenactment  history  re-\nquires some justification other than originalism simpliciter.\nIn Bruen, the Court took history beyond the founding era,\nconsidering gun regulations that spanned the 19th century.\n597  U. S.,  at  50–70.    I  expressed  reservations  about  the\nscope of that inquiry but concluded that the timing question\ndid not matter to Bruen’s holding.  Id., at 81–83 (concurring\nopinion).    It  bears  emphasis,  however,  that  my  questions\nwere about the time period relevant to discerning the Sec-\nond Amendment’s original meaning—for instance, what is\nthe post-1791 cutoff for discerning how the Second Amend-\nment was originally understood?  Id., at 82 (“How long after\nratification  may  subsequent  practice  illuminate  original\npublic meaning?”).  My doubts were not about whether “tra-\ndition,” standing alone, is dispositive.  Id., at 83 (“[T]oday’s\ndecision should not be understood to endorse freewheeling\nreliance  on  historical  practice  from  the  mid-to-late  19th\ncentury  to  establish  the  original  meaning  of  the  Bill  of\nRights”).  As I have explained elsewhere, evidence of “tradi-\ntion” unmoored from original meaning is not binding law.\nVidal,  602  U. S.,  at  ___–___  (BARRETT,  J.,  concurring  in\npart) (slip op., at 13–15).  And scattered cases or regulations\npulled from history may have little bearing on the meaning\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nBARRETT, J., concurring\n\nof the text.  Samia v. United States, 599 U. S. 635, 656–657\n(2023) (BARRETT, J., concurring in part and  concurring in\njudgment).\n  “Original history”—i.e., the generally dispositive kind—\nplays two roles in the Second Amendment context.  It eluci-\ndates how contemporaries understood the text—for exam-\nple, the meaning of the phrase “bear Arms.”  See Heller, 554\nU. S., at 582–592.  It also plays the more complicated role\nof determining the scope of the pre-existing right that the\npeople  enshrined  in  our  fundamental  law.*    In  Rahimi’s\ncase,  the  Court  uses  history  in  this  latter  way.  Call  this\n“original contours” history: It looks at historical gun regu-\nlations to identify the contours of the right.\n\nCourts have struggled with this use of history in the wake\nof  Bruen.  One  difficulty  is  a  level  of  generality  problem:\nMust the government produce a founding-era relative of the\nchallenged regulation—if not a twin, a cousin?  Or do found-\ning-era gun regulations yield concrete principles that mark\nthe borders of the right?\n\nMany  courts,  including  the  Fifth  Circuit,  have  under-\nstood Bruen to require the former, narrower approach.  But\nBruen emphasized that “analogical reasoning” is not a “reg-\nulatory straightjacket.”  597 U. S., at 30.  To be consistent\nwith historical limits, a challenged regulation need not be\n\n——————\n\n*To  my  mind,  this  use  of  history  walks  a  fine  line  between  original\nmeaning (which controls) and expectations about how the text would ap-\nply (which do not).  See Whittington 383 (“Specific expectations about the\nconsequences  of  a  legal  rule  are  distinct  from  the  meaning  of  the  rule\nitself ”).  Contemporary  government  actors  might  have  been  “wrong\nabout the consequences of their own constitutional rule,” or they “might\nnot have fully and faithfully implemented the adopted constitutional rule\nthemselves.”  Id., at 384.  Thus, while early applications of a constitu-\ntional rule can help illuminate its original scope, an interpreter must ex-\nercise care in considering them.  Id., at 385–386.  In the Second Amend-\nment context, particular gun regulations—even if from the ratification\nera—do not themselves have the status of constitutional law.\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nBARRETT, J., concurring\n\nan updated model of a historical counterpart.  Besides, im-\nposing  a  test  that  demands  overly  specific  analogues  has\nserious problems.  To name two: It forces 21st-century reg-\nulations to follow late-18th-century policy choices, giving us\n“a law trapped in amber.”  Ante, at 7.  And it assumes that\nfounding-era legislatures maximally exercised their power\nto regulate, thereby adopting a “use it or lose it” view of leg-\nislative  authority.    Such  assumptions  are  flawed,  and\noriginalism does not require them.\n\n“Analogical  reasoning”  under  Bruen  demands  a  wider\nlens: Historical regulations reveal a principle, not a mold.\nSee, e.g., 597 U. S., at 28–29 (explaining that the Amend-\nment does not apply only to the catalogue of arms that ex-\nisted  in the 18th century, but rather to all weapons satis-\nfying the “general definition” of “bearable arms” (emphasis\nadded));  id.,  at  30–31  (discussing  the  “ ‘sensitive  places’ ”\nprinciple that limits the right to public carry); cf. Vidal, 602\nU. S., at ___–___ (BARRETT, J., concurring in part) (slip op.,\nat 7–9); Whittington 386 (“The insight to be gleaned is not\nthe authoritative status of the expected application, but the\napparent rule at play given that such an application is ex-\npected to follow from it”).  To be sure, a court must be care-\nful not to read a principle at such a high level of generality\nthat it waters down the right.  Pulling principle from prec-\nedent, whether case law or history, is a standard feature of\nlegal reasoning, and reasonable minds sometimes disagree\nabout how broad or narrow the controlling principle should\nbe.\n\nHere, though, the Court settles on just the right level of\ngenerality: “Since the founding, our Nation’s firearm laws\nhave  included  provisions  preventing  individuals  who\nthreaten physical harm to others from misusing firearms.”\nAnte, at 5; see also Kanter v. Barr, 919 F. 3d 437, 451, 464–\n465  (CA7  2019)  (Barrett,  J.,  dissenting)  (“History  is  con-\nsistent  with  common  sense:  it  demonstrates  that  legisla-\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nBARRETT, J., concurring\n\ntures have the power to prohibit dangerous people from pos-\nsessing guns”).  Section 922(g)(8)(C)(i) fits well within that\nprinciple; therefore, Rahimi’s facial challenge fails.  Harder\nlevel-of-generality problems can await another day.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nJACKSON, J., concurring\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE JACKSON, concurring.\nThis case tests our Second Amendment jurisprudence as\nshaped in particular by New York State Rifle & Pistol Assn.,\nInc. v. Bruen, 597 U. S. 1 (2022).  I disagree with the meth-\nodology of that decision; I would have joined the dissent had\nI been a Member of the Court at that time.  See generally\nid.,  at  83–133  (Breyer,  J.,  dissenting).    But  Bruen  is  now\nbinding law.  Today’s decision fairly applies that precedent,\nso I join the opinion in full.\n\nI write separately because we now have two years’ worth\nof post-Bruen cases under our belts, and the experiences of\ncourts  applying  its  history-and-tradition  test  should  bear\non our assessment of the workability of that legal standard.\nThis case highlights the apparent difficulty faced by judges\non the ground.  Make no mistake: Today’s effort to clear up\n“misunderst[andings],” ante, at 7, is a tacit admission that\nlower courts are struggling.  In my view, the blame may lie\nwith us, not with them.\n\nI\nThe  Court  today  expounds  on  the  history-and-tradition\ninquiry that Bruen requires.  Ante, at 7–8.  We emphasize\nthat  the  Second  Amendment  is  “not  . . .  a  law  trapped  in\namber.”  Ante, at 7.  It “permits more than just those regu-\nlations  identical  to  ones  that  could  be  found  in  1791”;  in-\ndeed,  “a  challenged  regulation  [that]  does  not  precisely\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nJACKSON, J., concurring\n\nmatch its historical precursors . . . ‘still may be analogous\nenough  to  pass  constitutional  muster.’ ”    Ibid.  (quoting\nBruen, 597 U. S., at 30).  Gun regulations need only “com-\nport  with  the  principles  underlying  the  Second  Amend-\nment.”  Ante, at 7–8.  These clarifying efforts are welcome,\ngiven the many questions Bruen left unanswered.\n\nWhen this Court adopts a new legal standard, as we did\nin Bruen, we do not do so in a vacuum.  The tests we estab-\nlish  bind  lower  court  judges,  who  then  apply  those  legal\nstandards  to  the  cases  before  them.  In  my  view,  as  this\nCourt thinks of, and speaks about, history’s relevance to the\ninterpretation  of  constitutional  provisions,  we  should  be\nmindful that our common-law tradition of promoting clarity\nand consistency in the application of our precedent also has\na lengthy pedigree.  So when courts signal they are having\ntrouble with one of our standards, we should pay attention.\nCf. Garcia v. San Antonio Metropolitan Transit Authority,\n469 U. S. 528, 538–539 (1985).\n\nThe message that lower courts are sending now in Second\nAmendment cases could not be clearer.  They say there is\nlittle method to Bruen’s madness.1  It isn’t just that Bruen’s\n\n——————\n\n1See, e.g., Barris v. Stroud Twp., ___ Pa. ___, ___, 310 A. 3d 175, 190\n(2024) (“[M]ore guidance in this challenging and ever-shifting area of the\nlaw  is  welcome”);  State  v.  Wilson,  154  Haw.  8,  21,  543  P. 3d  440,  453\n(2024) (“[B]y turning the test into history and nothing else, [Bruen] dis-\nmantles workable methods to interpret firearms laws”); United States v.\nDubois, 94 F. 4th 1284, 1293 (CA11 2024) (“We require clearer instruc-\ntion from the Supreme Court before we may reconsider the constitution-\nality of [18 U. S. C. §]922(g)(1)”); United States v. Daniels, 77 F. 4th 337,\n358 (CA5 2023) (Higginson, J., concurring) (“[C]ourts, operating in good\nfaith, are struggling at every stage of the Bruen inquiry.  Those struggles\nencompass numerous, often dispositive, difficult questions”); Atkinson v.\nGarland, 70 F. 4th 1018, 1024 (CA7 2023) (“[T]he historical analysis re-\nquired by Bruen will be difficult and no doubt yield some measure of in-\ndeterminancy”); id., at 1036 (Wood, J., dissenting) (“As other courts have\nbegun to apply Bruen, [the] need for further research and further guid-\nance has become clear”); Gonyo v. D. S., 210 N. Y. S. 3d 612, 615, 2024\nN. Y. Slip Op. 24018 (Jan. 19, 2024) (“Interpretations and applications of\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nJACKSON, J., concurring\n\nhistory-and-tradition test is burdensome (though that is no\nsmall thing to courts with heavier caseloads and fewer re-\nsources than we have).  The more worrisome concern is that\nlower courts appear to be diverging in both approach and\noutcome as they struggle to conduct the inquiry Bruen re-\nquires of them.  Scholars report that lower courts applying\nBruen’s approach have been unable to produce “consistent,\nprincipled  results,”  Brief  for  Second  Amendment  Law\nScholars as Amici Curiae 4, and, in fact, they “have come to\nconflicting  conclusions  on  virtually  every  consequential\nSecond Amendment issue to come before them,” id., at 4–5;\nsee also id., at 5–6 (collecting examples).  Given this, it ap-\npears  indisputable  that,  after  Bruen,  “confusion  plagu[es]\nthe lower courts.”  Id., at 6.\n\n——————\nBruen by lower courts have been widely divergent and thus, very difficult\nto apply as precedent”); United States v. Sing-Ledezma, ___ F. Supp. 3d\n___,  ___,  2023  WL  8587869,  *3  (WD  Tex.  Dec.  11,  2023)  (“[T]he  Court\npauses to join the choir of lower courts urging the Supreme Court to re-\nsolve  the  many  unanswered  questions  left  in  Bruen’s  wake”);  United\nStates v. Bartucci, 658 F. Supp. 3d 794, 800 (ED Cal. 2023) (“[T]he unique\ntest  the  Supreme  Court  announced  in  Bruen  does  not  provide  lower\ncourts with clear guidance as to how analogous modern laws must be to\nfounding-era  gun  laws.    In  the  short  time  post-Bruen,  this  has  caused\ndisarray  among  the  lower  courts”);  United  States  v.  Bullock,  679\nF. Supp. 3d 501, 534 (SD Miss. 2023) (raising methodological questions\n“in hopes that future judges and justices can answer them with enough\ndetail to enable trial courts to perform their duties”); Fraser v. Bureau of\nAlcohol,  Tobacco,  Firearms  and  Explosives,  672  F. Supp.  3d  118,  137,\nn. 20  (ED  Va. 2023)  (“The  Court  is  staffed  by  lawyers  who  are  neither\ntrained nor experienced in making the nuanced historical analyses called\nfor by Bruen. . . . The analytical construct specified by Bruen is thus a\ndifficult one for non-historians”); United States v. Jackson, 661 F. Supp.\n3d 392, 406 (Md. 2023) (noting “the challenges created by Bruen’s assign-\nment”); United States v. Love, 647 F. Supp. 3d 664, 670 (ND Ind. 2022)\n(“By . . . announcing an inconsistent and amorphous standard, the Su-\npreme Court has created mountains of work for district courts that must\nnow deal with Bruen-related arguments in nearly every criminal case in\nwhich a firearm is found”).\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nJACKSON, J., concurring\n\nII\nThis  discord  is  striking  when  compared  to  the  relative\nharmony that had developed prior to Bruen.  To be sure, our\ndecision  in  District  of  Columbia  v.  Heller,  554  U. S.  570\n(2008),  which  first  recognized  an  individual  right  to  keep\nand bear arms for self-defense, see id., at 628, was disrup-\ntive in its own way.  After all, before Heller, “[t]he meaning\nof the Second Amendment ha[d] been considered settled by\ncourts and legislatures for over two centuries,” and “judges\nand  legislators  . . .  properly  believed  . . .  that  the  Second\nAmendment did not reach possession of firearms for purely\nprivate activities.”  Id., at 676, n. 38 (Stevens, J., dissent-\ning).  Nonetheless,  after  Heller,  lower  courts  took  up  the\nnecessary  work  of  reviewing  burdens  on  this  newly  un-\nearthed right.  By the time this Court decided Bruen, every\ncourt  of  appeals  evaluating  whether  a  firearm  regulation\nwas consistent with the Second Amendment did so using a\ntwo-step framework that incorporated means-end scrutiny.\nSee Bruen, 597 U. S., at 103 (Breyer, J., dissenting).\n\nRejecting  that  “two-step  approach”  as  having  “one  step\ntoo many,” id., at 19, the Bruen majority subbed in another\ntwo-step evaluation.  Courts must, first, determine whether\n“the Second Amendment’s plain text covers an individual’s\nconduct.”  Id., at 24.  If it does, “[t]he government must then\njustify its regulation by demonstrating that it is consistent\nwith the Nation’s historical tradition of firearm regulation.”\nIbid.\n\nNo one seems to question that “[h]istory has a role to play\nin Second Amendment analysis.”  Ante, at 4 (SOTOMAYOR,\nJ., concurring).  But, per Bruen, courts evaluating a Second\nAmendment  challenge  must  consider  history  to  the  exclu-\nsion of all else.  This means legislators must locate and pro-\nduce—and courts must sift through—troves of centuries-old\ndocumentation looking for supportive historical evidence.2\n\n——————\n\n2 It is not clear what qualifies policymakers or their lawyers (who do\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nJACKSON, J., concurring\n\nThis very case provides a prime example of the pitfalls of\nBruen’s approach.  Having been told that a key marker of a\nconstitutional gun regulation is “a well-established and rep-\nresentative  historical  analogue,”  Bruen,  597  U. S.,  at  30\n(emphasis deleted), Rahimi argued below that “there is lit-\ntle  or  no  historical  evidence  suggesting  disarmament  for\nthose  who  committed  domestic  violence;  and  there  is  cer-\ntainly no tradition of disarming people subject to a no-con-\ntact order related to domestic violence.”  Supp. Brief for Ap-\npellant  in  No.  21–11001  (CA5),  p. 15  (emphasis  deleted).\nThe  Government  then  proffered  what  it  maintained  were\nsufficient historical analogues to 18 U. S. C. §922(g)(8), in-\ncluding surety and going armed laws.  Supp. Brief for Ap-\npellee in No. 21–11001 (CA5), pp. 23, n. 2, 27–31.  But the\nFifth Circuit concluded that the federal statute was uncon-\nstitutional  because  the  Government’s  analogues  were  not\n“ ‘relevantly similar.’ ”  61 F. 4th 443, 460–461 (2023).\n\nNeither the parties nor the Fifth Circuit had the benefit\nof today’s decision, in which we hold that the Government\nhad in fact offered “ample evidence that the Second Amend-\nment  permits  the  disarmament  of  individuals  who  pose  a\ncredible threat to the physical safety of others.”  Ante, at 8.\nBut even setting aside whether the historical examples the\nGovernment  found  were  sufficiently  analogous,  just  can-\nvassing the universe of historical records and gauging the\nsufficiency of such evidence is an exceedingly difficult task.3\n\n——————\nnot ordinarily have the specialized education, knowledge, or training of\nprofessional historians) to engage in this kind of assessment.  And dutiful\nlegislators are not the only stakeholders who are far outside their depth:\nBruen also conscripts parties and judges into service as amateur histori-\nans, casting about for similar historical circumstances.\n\n3 The mad scramble for historical records that Bruen requires also sug-\ngests that only those solutions that States implemented in the distant\npast  comport  with  the  Constitution.    That  premise  is  questionable  be-\ncause,  given  the  breadth  of  some  of  the  Constitution’s  provisions,  it  is\nlikely that the Founders understood that new solutions would be needed\nover  time,  even  for  traditional  problems,  and  that  the  principles  they\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nJACKSON, J., concurring\n\nConsistent analyses and outcomes are likely to remain elu-\nsive because whether Bruen’s test is satisfied in a particular\ncase seems to depend on the suitability of whatever histor-\nical sources the parties can manage to cobble together, as\nwell  as  the  level  of  generality  at  which  a  court  evaluates\nthose sources—neither of which we have as yet adequately\nclarified.\n\nAnd the unresolved questions hardly end there.  Who is\nprotected by the Second Amendment, from a historical per-\nspective?  To what conduct does the Second Amendment’s\nplain  text  apply?  To  what  historical  era  (or  eras)  should\ncourts look to divine a historical tradition of gun regulation?\nHow many analogues add up to a tradition?  Must there be\nevidence that those analogues were enforced or subject to\njudicial  scrutiny?    How  much  support  can  nonstatutory\nsources  lend?  I  could  go  on—as  others  have.    See,  e.g.,\nUnited States v. Daniels, 77 F. 4th 337, 358–360 (CA5 2023)\n(Higginson,  J.,  concurring)  (providing  a  similarly  nonex-\nhaustive list).  But I won’t.\n\nIII\nMaybe  time  will  resolve  these  and  other  key  questions.\nMaybe appellate courts, including ours, will find a way to\n“[b]rin[g] discipline to the increasingly erratic and unprin-\ncipled body of law that is emerging after Bruen.”  J. Blocher\n&  E.  Ruben,  Originalism-by-Analogy  and  Second  Amend-\nment Adjudication, 133 Yale L. J. 99, 174 (2023).  Indeed,\n“[m]any  constitutional  standards  involve  undoubted  gray\n\n——————\nwere adopting would allow for such flexibility.  See District of Columbia\nv. Heller, 554 U. S. 570, 722 (2008) (Breyer, J., dissenting) (expressing\ndoubt that the Framers “intended future generations to ignore [modern-\nday] matters”).  It stifles both helpful innovation and democratic engage-\nment to read the Constitution to prevent advancement in this way.  In\nany event, what we see now is that Bruen’s history-and-tradition test is\nnot  only  limiting  legislative  solutions,  it  also  appears  to  be  creating\nchaos.\n\n\fCite as:  602 U. S. ____ (2024)\n\n7\n\nJACKSON, J., concurring\n\nareas,”  and  “it  normally  might  be  fair  to  venture  the  as-\nsumption  that  case-by-case  development  [will]  lead  to  a\nworkable  standard.”  Garcia,  469  U. S.,  at  540  (internal\nquotation marks and alteration omitted).  By underscoring\nthat gun regulations need only “comport with the principles\nunderlying the Second Amendment,” ante, at 7–8 (emphasis\nadded), today’s opinion inches that ball forward.\n\nBut  it  is  becoming  increasingly  obvious  that  there  are\nmiles  to  go.4    Meanwhile,  the  Rule  of  Law  suffers.    That\nideal—key  to  our  democracy—thrives  on  legal  standards\nthat foster stability, facilitate consistency, and promote pre-\ndictability.  So far, Bruen’s history-focused test ticks none\nof those boxes.\n\n*\n\n*\n\n*\nI concur in today’s decision applying Bruen.  But, in my\nview,  the  Court  should  also  be  mindful  of  how  its  legal\nstandards  are  actually  playing  out  in  real  life.    We  must\nremember  that  legislatures,  seeking  to  implement  mean-\ningful  reform  for  their  constituents  while  simultaneously\nrespecting the Second Amendment, are hobbled without a\nclear,  workable  test  for  assessing  the  constitutionality  of\ntheir proposals.  See Tr. of Oral Arg. 54–57; cf. Bruen, 597\nU. S., at 90–91 (Breyer, J., dissenting).  And courts, which\nare currently at sea when it comes to evaluating firearms\nlegislation, need a solid anchor for grounding their consti-\ntutional pronouncements.  The public, too, deserves clarity\nwhen this Court interprets our Constitution.\n\n——————\n\n4 Extremely  pertinent  inquiries  relevant  to  consistent  application  of\nBruen’s standard await resolution.  For example, in Bruen we acknowl-\nedged  the  existence  of  “an  ongoing  scholarly  debate  on  whether courts\nshould primarily rely on the prevailing understanding of an individual\nright when the Fourteenth Amendment was ratified in 1868 when defin-\ning its scope (as well as the scope of the right against the Federal Gov-\nernment).”    597  U. S.,  at  37.    We  saw  no  need  to  address  the  issue  in\nBruen.  Id.,  at  38.  We  similarly  decline  to  resolve  that  dispute  today.\nAnte, at 8, n. 1.\n\n\fCite as:  602 U. S. ____ (2024)\n\n1\n\nTHOMAS, J., dissenting\n\nSUPREME COURT OF THE UNITED STATES\n\n_________________\n\nNo. 22–915\n_________________\n\nUNITED STATES, PETITIONER v. ZACKEY RAHIMI\n\nON WRIT OF CERTIORARI TO THE UNITED STATES COURT OF\nAPPEALS FOR THE FIFTH CIRCUIT\n\n[June 21, 2024]\n\nJUSTICE THOMAS, dissenting.\nAfter New York State Rifle & Pistol Assn., Inc. v. Bruen,\n597 U. S. 1 (2022), this Court’s directive was clear: A fire-\narm regulation that falls within the Second Amendment’s\nplain text is unconstitutional unless it is consistent with the\nNation’s  historical  tradition  of  firearm  regulation.  Not  a\nsingle historical regulation justifies the statute at issue, 18\nU. S. C. §922(g)(8).  Therefore, I respectfully dissent.\n\nI\nSection 922(g)(8) makes it unlawful for an individual who\nis subject to a civil restraining order to possess firearms or\nammunition.  To trigger §922(g)(8)’s prohibition, a restrain-\ning order must bear three characteristics.  First, the order\nissues  after  a  hearing  where  the  accused  “received\nactual  notice”  and  had  “an  opportunity  to  participate.”\n§922(g)(8)(A).  Second, the order restrains the accused from\nengaging in threatening behavior against an intimate part-\nner or child.  §922(g)(8)(B).  Third, the order has either “a\nfinding  that  [the  accused]  represents  a  credible  threat  to\nthe physical safety of [an] intimate partner or child,” or an\n“explici[t]  prohibit[ion]”  on  “the  use,  attempted  use,  or\nthreatened use of physical force against [an] intimate part-\nner or child.”  §922(g)(8)(C).  If those three characteristics\nare  present,  §922(g)(8)  automatically  bans  the  individual\n\n\f2\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nsubject to the order from possessing “any firearm or ammu-\nnition.”  §922(g).\n\nJust as important as §922(g)(8)’s express terms is what it\nleaves unsaid.  Section 922(g)(8) does not require a finding\nthat a person has ever committed a crime of domestic vio-\nlence.  It is not triggered by a criminal conviction or a per-\nson’s  criminal  history,  unlike  other  §922(g)  subsections.\nSee  §§922(g)(1),  (9).  And,  §922(g)(8)  does  not  distinguish\ncontested orders from joint orders—for example, when par-\nties voluntarily enter a no-contact agreement or when both\nparties seek a restraining order.\n\nIn addition, §922(g)(8) strips an individual of his ability\nto possess firearms and ammunition without any due pro-\ncess.1  Rather, the ban is an automatic, uncontestable con-\nsequence of certain orders.  See §922(g) (“It shall be unlaw-\nful  for  any  [qualifying]  person  [to]  possess  in  or  affecting\ncommerce, any firearm or ammunition”).  There is no hear-\ning or opportunity to be heard on the statute’s applicability,\nand a court need not decide whether a person should be dis-\narmed  under  §922(g)(8).  The  only  process  §922(g)(8)  re-\nquires is that provided (or not) for the underlying restrain-\ning order.\n\nDespite  §922(g)(8)’s  broad  scope  and  lack  of  process,  it\ncarries strong penalties.  Any violation of §922(g)(8) is a fel-\nimprisonment.\nony  punishable  by  up  to  15  years’\n§924(a)(8); see also ante, at 3.  And, a conviction for violat-\ning §922(g)(8) itself triggers a permanent, life-long prohibi-\ntion  on  possessing  firearms  and  ammunition.\nSee\n§922(g)(1).\n\nIn 2020, Zackey Rahimi and his ex-girlfriend, C. M., en-\ntered into a qualifying civil restraining order.  App. 1.  C. M.\nhad  requested  the  order  and  asserted  that  Rahimi  as-\nsaulted  her.   See  id.,  at  2.  Because  the  order  found  that\n\n——————\n\n1 Rahimi  does  not  ask  the  Court  to  consider,  and  I  do  not  address,\n\nwhether §922(g)(8) satisfies the Due Process Clause.\n\n\fCite as:  602 U. S. ____ (2024)\n\n3\n\nTHOMAS, J., dissenting\n\nRahimi presented a credible threat and prohibited him from\nusing physical force against C. M., the order automatically\ntriggered  §922(g)(8)’s  firearms  ban.    A  year  later,  officers\ndiscovered  firearms  in  Rahimi’s  home.  Rahimi  pleaded\nguilty to violating §922(g)(8).\n\nBefore his guilty plea, Rahimi challenged his conviction\nunder  the  Second  Amendment.    He  pointed  to  District  of\nColumbia v. Heller, 554 U. S. 570 (2008), which held that\nthe Second Amendment protects an individual right to keep\nand bear firearms.  Section 922(g)(8), Rahimi argued, vio-\nlates that right by penalizing firearms possession.  The Dis-\ntrict  Court  rejected  Rahimi’s  claim.    At  that  time,  the\nCourts  of  Appeals,  including  the  Fifth  Circuit,  applied  a\nform of means-end scrutiny to Second Amendment claims.\nSee, e.g., United States v. McGinnis, 956 F. 3d 747, 753–754\n(2020).  Applying  Circuit  precedent,  the  Fifth  Circuit  af-\nfirmed the District Court.  2022 WL 2070392 (2022).\n\nRoughly two weeks later, this Court issued its opinion in\nNew  York  State  Rifle  &  Pistol  Assn.,  Inc.  v.  Bruen.  The\nCourt  rejected  the  means-end-scrutiny  approach  and  laid\nout the appropriate framework for assessing whether a fire-\narm regulation is constitutional.  Bruen, 597 U. S., at 17–\n19.  That framework requires the Government to prove that\nthe “regulation is part of the historical tradition that delim-\nits  the  outer  bounds  of  the  right  to  keep  and  bear  arms.”\nId., at 19.  The Fifth Circuit withdrew its opinion to apply\nthe correct framework to Rahimi’s claim.  Relying on Bruen,\nthe Fifth Circuit concluded that the Government failed to\npresent historical evidence that §922(g)(8) “fits within our\nNation’s  historical  tradition  of  firearm  regulation.”    61  F.\n4th 443, 460 (2023).  The Fifth Circuit, accordingly, vacated\nRahimi’s conviction.  We granted certiorari.  600 U. S. ___\n(2023).\n\nII\nThe Second Amendment provides that “[a] well regulated\n\n\f4\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nMilitia, being necessary to the security of a free State, the\nright of the people to keep and bear Arms, shall not be in-\nfringed.”  As  the  Court  recognizes,  Bruen  provides  the\nframework  for  analyzing  whether  a  regulation  such  as\n§922(g)(8)  violates  the  Second  Amendment’s  mandate.\n“[W]hen the Second Amendment’s plain text covers an indi-\nvidual’s  conduct,  the  Constitution  presumptively  protects\nthat conduct.”  597 U. S., at 17.  To overcome this presump-\ntion,  “the  government  must  demonstrate  that  the  regula-\ntion  is  consistent  with  the  Nation’s  historical  tradition  of\nfirearm  regulation.”    Ibid.  The  presumption  against  re-\nstrictions on keeping and bearing firearms is a central fea-\nture of the Second Amendment.  That Amendment does not\nmerely narrow the Government’s regulatory power.  It is a\nbarrier, placing the right to keep and bear arms off limits\nto the Government.\n\nWhen  considering  whether  a  modern  regulation  is  con-\nsistent with historical regulations and thus overcomes the\npresumption against firearms restrictions, our precedents\n“point toward at least two metrics [of comparison]: how and\nwhy the regulations burden a law-abiding citizen’s right to\narmed self-defense.”  Id., at 29.  A historical law must sat-\nisfy both considerations to serve as a comparator.  See ibid.\nWhile  a  historical  law  need  not  be  a  “historical  twin,”  it\nmust be “well-established and representative” to serve as a\nhistorical analogue.  Id., at 30 (emphasis deleted).\n\nIn  some  cases,  “the  inquiry  [is]  fairly  straightforward.”\nId., at 26.  For instance, “when a challenged regulation ad-\ndresses a general societal problem that has persisted since\nthe 18th century, the lack of a distinctly similar historical\nregulation  addressing  that  problem  is  relevant  evidence\nthat the challenged regulation is inconsistent with the Sec-\nond  Amendment.  Likewise,  if  earlier  generations  ad-\ndressed the societal problem, but did so through materially\ndifferent means, that also could be evidence that a modern\nregulation is unconstitutional.”  Id., at 26–27.\n\n\fCite as:  602 U. S. ____ (2024)\n\n5\n\nTHOMAS, J., dissenting\n\nThe  Court  employed  this  “straightforward”  analysis  in\nHeller and Bruen.  Heller considered the District of Colum-\nbia’s “flat ban on the possession of handguns in the home,”\nBruen, 597 U. S., at 27, and Bruen considered New York’s\neffective ban on carrying a firearm in public, see id., at 11–\n13.  The  Court  determined  that  the  District  of  Columbia\nand  New  York  had  “addressed  a  perceived  societal  prob-\nlem—firearm violence in densely populated communities—\nand  [they]  employed  a  regulation  . . .  that  the  Founders\nthemselves could have adopted to confront that problem.”\nId., at 27.  Accordingly, the Court “consider[ed] ‘founding-\nera historical precedent’ ” and looked for a comparable reg-\nulation.  Ibid. (quoting Heller, 554 U. S., at 631).  In both\ncases,  the  Court  found  no  such  law  and  held  the  modern\nregulations unconstitutional.  Id., at 631; Bruen, 597 U. S.,\nat 27.\n\nUnder  our  precedent,  then,  we  must  resolve  two  ques-\ntions to determine if §922(g)(8) violates the Second Amend-\nment:  (1) Does  §922(g)(8)  target  conduct  protected  by  the\nSecond  Amendment’s  plain  text;  and  (2) does  the  Govern-\nment  establish  that  §922(g)(8)  is  consistent  with  the  Na-\ntion’s historical tradition of firearm regulation?\n\nIII\n\nSection 922(g)(8) violates the Second Amendment.  First,\nit targets conduct at the core of the Second Amendment—\npossessing firearms.  Second, the Government failed to pro-\nduce any evidence that §922(g)(8) is consistent with the Na-\ntion’s historical tradition of firearm regulation.  To the con-\ntrary, the founding generation addressed the same societal\nproblem  as  §922(g)(8)  through  the  “materially  different\nmeans” of surety laws.  Id., at 26.\n\nA\nIt  is  undisputed  that  §922(g)(8)  targets  conduct  encom-\npassed  by  the  Second  Amendment’s  plain  text.  After  all,\n\n\f6\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nthe  statute  bans  a  person  subject  to  a  restraining  order\nfrom possessing or using virtually any firearm or ammuni-\ntion.  §922(g)  (prohibiting  covered  individuals  from  “pos-\nsess[ing]” or “receiv[ing] any firearm or ammunition which\nhas  been  shipped  or  transported  in  interstate  or  foreign\ncommerce”).  A  covered  individual  cannot  even  possess  a\nfirearm in his home for self-defense, “the central component\nof the [Second Amendment] right itself.”  Heller, 554 U. S.,\nat 599 (emphasis deleted).  There is no doubt that §922(g)(8)\nis irreconcilable with the Second Amendment’s text.  Id., at\n628–629.\n\nIt is also undisputed that the Second Amendment applies\nto Rahimi.  By its terms, the Second Amendment extends\nto “ ‘the people,’ ” and that “term unambiguously refers to all\nmembers  of  the  political  community,  not  an  unspecified\nsubset.”  Id., at 580.  The Second Amendment thus recog-\nnizes a right “guaranteed to ‘all Americans.’ ”  Bruen, 597\nU. S., at 70 (quoting Heller, 554 U. S., at 581).  Since Rahimi\nis a member of the political community, he falls within the\nSecond Amendment’s guarantee.\n\nB\nThe Government fails to carry its burden of proving that\n§922(g)(8) is “consistent with the Nation’s historical tradi-\ntion of firearm regulation.”  597 U. S., at 24.  Despite can-\nvassing laws before, during, and after our Nation’s found-\ning,  the  Government  does  not  identify  even  a  single\nregulation with an analogous burden and justification.2\n\nThe  Government’s  failure  is  unsurprising  given  that\n\n——————\n\n2 I  agree  with  the  majority  that  we  need  not  address  the  “ ‘ongoing\nscholarly debate on whether courts should primarily rely on the prevail-\ning understanding of an individual right when the Fourteenth Amend-\nment was ratified in 1868 when defining its scope (as well as the scope\nof the right against the Federal Government).’ ”  Ante, at 8, n. 1 (quoting\nNew York State Rifle & Pistol Assn., Inc. v. Bruen, 597 U. S. 1, 37 (2022)).\n\n\fCite as:  602 U. S. ____ (2024)\n\n7\n\nTHOMAS, J., dissenting\n\n§922(g)(8) addresses a societal problem—the risk of inter-\npersonal violence—“that has persisted since the 18th cen-\ntury,” yet was addressed “through [the] materially different\nmeans” of surety laws.  Id., at 26.  Surety laws were, in a\nnutshell, a fine on certain behavior.  If a person threatened\nsomeone in his community, he was given the choice to either\nkeep the peace or forfeit a sum of money.  Surety laws thus\nshared  the  same  justification  as  §922(g)(8),  but  they  im-\nposed a far less onerous burden.  The Government has not\nshown that §922(g)(8)’s more severe approach is consistent\nwith our historical tradition of firearm regulation.\n\n1\nThe Government does not offer a single historical regula-\ntion that is relevantly similar to §922(g)(8).  As the Court\nhas  explained,  the  “central  considerations”  when  compar-\ning modern and historical regulations are whether the reg-\nulations “impose a comparable burden” that is “comparably\njustified.”  Id., at 29.  The Government offers only two cate-\ngories  of  evidence  that  are  even  within  the  ballpark  of\n§922(g)(8)’s burden and justification: English laws disarm-\ning persons “dangerous” to the peace of the kingdom, and\ncommentary  discussing  peaceable  citizens  bearing  arms.\nNeither category ultimately does the job.\n\ni\nThe Government points to various English laws from the\nlate 1600s and early 1700s to argue that there is a tradition\nof restricting the rights of “dangerous” persons.  For exam-\nple, the Militia Act of 1662 authorized local officials to dis-\narm individuals judged “dangerous to the Peace of the King-\ndome.”  14  Car.  2  c.  3,  §13.    And,  in  the  early  1700s,  the\nCrown authorized lords and justices of the peace to “cause\nsearch to be made for arms in the possession of any persons\nwhom they judge dangerous, and seize such arms according\nto  law.”  Calendar  of  State  Papers  Domestic:  William  III,\n\n\f8\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\n1700–1702, p. 234 (E. Bateson ed. 1937) (Calendar William\nIII).\n\nAt first glance, these laws targeting “dangerous” persons\nmight appear relevant.  After all, if the Second Amendment\nright was historically understood to allow an official to dis-\narm  anyone  he  deemed  “dangerous,”  it  may  follow  that\nmodern Congresses can do the same.  Yet, historical context\ncompels the opposite conclusion.  The Second Amendment\nstems from English resistance against “dangerous” person\nlaws.\n\nThe sweeping disarmament authority wielded by English\nofficials during the 1600s, including the Militia Act of 1662,\nprompted  the  English  to  enshrine  an  individual  right  to\nkeep  and  bear  arms.  “[T]he  Stuart  Kings  Charles  II  and\nJames II succeeded in using select militias loyal to them to\nsuppress political dissidents, in part by disarming their op-\nponents.”  Heller, 554 U. S., at 592.  Englishmen, as a re-\nsult,  grew  “to  be  extremely  wary  of  concentrated  military\nforces run by the state and to be jealous of their arms.”  Id.,\nat 593.  Following the Glorious Revolution, they “obtained\nan  assurance  . . .  in  the  Declaration  of  Right  (which  was\ncodified  as  the  English  Bill  of  Rights),  that  Protestants\nwould never be disarmed.”  Ibid.\n\nThe English Bill of Rights “has long been understood to\nbe  the  predecessor  to  our  Second  Amendment.”  Ibid.  In\nfact,  our  Founders  expanded  on  it  and  made  the  Second\nAmendment even more protective of individual liberty.  The\nEnglish Bill of Rights assured Protestants “Arms for their\nDefence,” but only where “suitable to their Conditions and\nas allowed by Law.”  1 Wm. & Mary, ch. 2, (1688), in 6 Stat-\nutes of the Realm 143.  The Second Amendment, however,\ncontains  no  such  qualifiers  and  protects  the  right  of  “the\npeople” generally.  In short, laws targeting “dangerous” per-\nsons  led  to  the  Second  Amendment.    It  would  be  passing\nstrange to permit the Government to resurrect those self-\n\n\fCite as:  602 U. S. ____ (2024)\n\n9\n\nTHOMAS, J., dissenting\n\nsame “dangerous” person laws to chip away at that Amend-\nment’s guarantee.\n\nEven on their own terms, laws targeting “dangerous” per-\nsons cannot support §922(g)(8).  Those laws were driven by\na  justification  distinct  from  that  of  §922(g)(8)—quashing\ntreason and rebellion.  The Stuart Kings’ reign was marked\nby religious and political conflict, which at that time were\noften one and the same.  The Parliament of the late 1600s\n“re-established an intolerant episcopalian church” through\nlegislation targeting other sects, including “[a] fierce penal\ncode” to keep those other sects out of local government and\n“to criminalize nonconformist worship.”  Oxford Handbook\nof the English Revolution 212 (M. Braddick ed. 2015) (Ox-\nford  Handbook);  see  G.  Clark,  The  Later  Stuarts  1660–\n1714, p. 22 (2d ed. 1955).  These laws were driven in large\npart by a desire to suppress rebellion.  “Nonconformist min-\nisters  were  thought  to  preach  resistance  to  divinely  or-\ndained monarchs.”  Oxford Handbook 212; see Calendar of\nState  Papers  Domestic:  Charles  II,  1661–1662,  p. 161  (M.\nGreen  ed.  1861)  (Calendar  Charles  II)  (“[P]reachers  go\nabout from county to county, and blow the flames of rebel-\nlion”).  Various nonconformist insurrections gave credibility\nto  these  fears.    See,  e.g.,  Clark,  The  Later  Stuarts,  at  22;\nPrivy Council to Lord Newport (Mar. 4, 1661), in Transac-\ntions of the Shropshire Archaeological and Natural History\nSociety, Pt. 2, 3d Ser., Vol. 4, p. 161 (1904).\n\nIt is in this turbulent context that the English kings per-\nmitted the disarming of “dangerous persons.”  English lords\nfeared that nonconformists—i.e., people with “ ‘wicked and\nRebellious  Principles’ ”—had  “ ‘furnished  themselves  with\nquantities of Arms, and Ammunition’ ” “ ‘to put in Execution\ntheir Trayterus designs.’ ”  Privy Council to Lord Newport\n(Jan. 8, 1660), in id., at 156; see Calendar Charles II 541\n(“The  fanatics  . . .  are  high  and  insolent,  and  threaten  all\nloyal people; they will soon be in arms”).  In response, the\nCrown  took  measures  to  root  out  suspected  rebels,  which\n\n\f10\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nincluded  “disarm[ing]  all  factious  and  seditious  spirits.”\nId., at 538 (Nov. 1, 1662).  For example, following “turbu-\nlency and difficulties” arising from the Conventicles Act of\n1670, which forbade religious nonconformists from assem-\nbling, the lord mayor of London pressed that “a special war-\nrant or commission [was] necessary” empowering commis-\nsioners  to  “resist,  fight,  kill,  and  execute  such  rebels.”\nCalendar  of  State  Papers,  Domestic  Series,  1670,  p.  236\n(May  25,  1670)  (M.  Green  ed.  1895)  (emphasis  deleted).\nKing  Charles  II  ordered  the  lord  mayor  “to  make  strict\nsearch  in  the  city  and  precincts  for  dangerous  and  disaf-\nfected persons, seize and secure them and their arms, and\ndetain them in custody till our further pleasure.”  Id., at 237\n(May 26, 1670).\n\nHistory repeated itself a few decades later.  In 1701, King\nWilliam  III  declared  that  “great  quantities  of  arms,  and\nother provisions of war” had been discovered in the hands\nof “papists and other disaffected persons, who disown [the]\ngovernment,” and that such persons had begun to assemble\n“in great numbers . . . in the cities of London and Westmin-\nster.”  Calendar William III 233.  He ordered the lord mayor\nof London and the justices of the peace to “secur[e] the gov-\nernment”  by  disarming  “any  persons  whom  they  judge[d]\ndangerous,” including “any papist, or reputed papist.”  Id.,\nat 233–234 (emphasis deleted).  Similar disarmaments tar-\ngeting  “Papists  and  Non-jurors  dangerous  to  the  peace  of\nthe  kingdom”  continued  into  the  1700s.    Privy  Council  to\nthe  Earl  of  Carlisle  (July  30,  1714),  in  Historical  Manu-\nscripts Comm’n, Manuscripts of the Earl of Westmoreland\net al.  10th  Report,  Appx.,  Pt.  4,  p.  343  (1885).    As  before,\ndisarmament was designed to stifle “wicked conspirac[ies],”\nsuch as “raising a Rebellion in this Kingdom in favour of a\nPopish Pretender.”  Lord Lonsdale to Deputy Lieutenants\nof  Cumberland  (May  20,  1722),  in  Historical  Manuscripts\nCommission, Manuscripts of the Earl of Carlisle, 15th Re-\nport, Appx., Pt. 6, pp. 39–40 (1897).\n\n\fCite as:  602 U. S. ____ (2024)\n\n11\n\nTHOMAS, J., dissenting\n\nWhile  the  English  were  concerned  about  preventing  in-\nsurrection  and  armed  rebellion,  §922(g)(8)  is  concerned\nwith preventing interpersonal violence.  “Dangerous” per-\nson laws thus offer the Government no support.\n\nii\nThe Government also points to historical commentary re-\nferring to the right of “peaceable” citizens to carry arms.  It\nprincipally  relies  on  commentary  surrounding  two  failed\nconstitutional proposals.3  First, at the Massachusetts con-\nvention,  Samuel  Adams  unsuccessfully  proposed  that  the\nBill of Rights deny Congress the power “to prevent the peo-\nple of the United States, who are peaceable citizens, from\nkeeping  their  own  arms.”    6  Documentary  History  of  the\nRatification  of  the  Constitution  1453  (J.  Kaminski  &  G.\nSaladino eds. 2000) (Documentary History).  Second, Anti-\nFederalists at the Pennsylvania convention unsuccessfully\nproposed a Bill of Rights providing a “right to bear arms for\nthe defense of themselves and their own state, or the United\nStates, or for the purpose of killing game.”  2 id., at 597–\n598, ¶7 (M. Jensen ed. 1976).  The Anti-Federalists’ Bill of\nRights would also state that “no law shall be passed for dis-\narming  the  people or  any  of  them,  unless  for  crimes  com-\nmitted,  or  real  danger  of  public  injury  from  individuals.”\n\n——————\n\n3 The Government also cites an amendment to the Massachusetts Con-\nstitution providing that “the people have a right to keep and to bear Arms\nfor their Own and the Common defence.”  The Popular Sources of Politi-\ncal  Authority:  Documents  on  the  Massachusetts  Constitution  of  1780,\np. 624 (O. Handlin & M. Handlin eds. 1966).  The Government empha-\nsizes that the amendment’s proponents believed they “Ought Never to be\ndeprived” of their arms, so long as they “Continue[d] honest and Lawfull\nSubjects of Government.”  Ibid.  Even if the amendment contemplated\ndisarming dishonest and unlawful subjects, the Government makes no\neffort to define those terms or explain why they necessarily include the\nindividuals  covered  by  §922(g)(8).    In  any  event,  evidence  concerning\nwhat proponents behind an amendment to a single state constitution be-\nlieved is too paltry to define the Second Amendment right.  See Bruen,\n597 U. S., at 46.\n\n\f12\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nId., at 598.\n\nThese  proposals  carry  little  interpretative  weight.    To\nbegin with, it is “dubious to rely on [drafting] history to in-\nterpret a text that was widely understood to codify a pre-\nexisting  right.”  Heller,  554  U. S.,  at  603.    Moreover,  the\nStates rejected the proposals.  Samuel Adams withdrew his\nown proposal after it “alarmed both Federalists and Anti-\nfederalists.”  6 Documentary History 1453 (internal quota-\ntion marks omitted).4  The Pennsylvania Anti-Federalists’\nproposal similarly failed to gain a majority of the state con-\nvention.  2 B. Schwartz, The Bill of Rights: A Documentary\nHistory 628 (1971).\n\nThe Government never explains why or how language ex-\ncluded from the Constitution could operate to limit the lan-\nguage actually ratified.  The more natural inference seems\nto be the opposite—the unsuccessful proposals suggest that\nthe Second Amendment preserves a more expansive right.\nAfter  all,  the  Founders  considered,  and  rejected,  any  tex-\ntual limitations in favor of an unqualified directive: “[T]he\nright of the people to keep and bear Arms, shall not be in-\nfringed.”\n\nIn addition to the proposals, the Government throws in a\nhodgepodge of sources from the mid-to-late 1800s that use\nthe phrase “peaceable” in relation to firearms.  Many of the\nsources simply make passing reference to the notion.  See,\ne.g., H. R. Rep. No. 30, 39th Cong., 1st Sess., pt. 2, p. 229\n(1866)  (proposed  circular  explaining  freed  slaves  “have\nshown by their peaceful and orderly conduct that they can\nsafely be trusted with fire-arms, and they need them to kill\ngame for subsistence”).  Other sources are individual mus-\nings on firearms policy.  See, e.g., The Sale of Pistols, N. Y.\nTimes, June 22, 1874 (advocating for “including pistols in\n\n——————\n\n4 When  Anti-Federalists  renewed  Samuel  Adams’  proposal,  not  only\ndid the proposal fail, but Adams himself voted against it.  6 Documentary\nHistory 1453.\n\n\fCite as:  602 U. S. ____ (2024)\n\n13\n\nTHOMAS, J., dissenting\n\nthe law against carrying concealed weapons”).  Sources that\ndo  discuss  disarmament  generally  describe  nonpeaceable\ncitizens  as  those  who  threaten  the  public  or  government.\nFor example, the Government quotes a Union General’s or-\nder that “all loyal and peaceable citizens in Missouri will be\npermitted to bear arms.”  Headquarters, Dept. of the Mis-\nsouri, General Orders, No. 86 (Aug. 25, 1863), in The War\nof the Rebellion: A Compilation of the Official Records of the\nUnion and Confederate Armies, Ser. 1, Vol. 22, Pt. 2, p. 475\n(1888).  Yet, the Government fails to mention that the Un-\nion General’s order addresses the “[l]arge numbers of men\n. . .  leaving  the  broken  rebel  armies  . . .  and  returning  to\nMissouri . . . with the purpose of following a career of plun-\nder and murder.”  Id., at 474.  The order provided that “all\nthose  who  voluntarily  abandon[ed]  the  rebel  cause”  could\nreturn  to  Missouri,  but  only  if  they  “surrender[ed]  them-\nselves  and  their  arms,”  “[took]  the  oath  of  allegiance  and\n[gave] bond for their future good conduct.”  Ibid.  By con-\ntrast,  “all  loyal  and  peaceable  citizens  in  Missouri  w[ere]\npermitted  to  bear  arms”  to  “protect  themselves  from  vio-\nlence”  and  “aid  the  troops.”    Id.,  at  475.  Thus,  the  term\n“loyal and peaceable” distinguished between the former re-\nbels residing in Missouri who were disarmed to prevent re-\nbellion  and  those  citizens  who  would  help  fight  against\nthem.\n\nThe  Government’s  smorgasbord  of  commentary  proves\nlittle of relevance, and it certainly does not establish a “his-\ntorical tradition that delimits the outer bounds of the right\nto keep and bear arms.”  Bruen, 597 U. S., at 19.\n\niii\n\nThe  Government’s  remaining  evidence  is  even  further\nafield.  The Government points to an assortment of firearm\nregulations, covering everything from storage practices  to\ntreason and mental illness.  They are all irrelevant for pur-\nposes  of  §922(g)(8).    Again,  the  “central  considerations”\n\n\f14\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nwhen  comparing  modern  and  historical  regulations  are\nwhether they “impose a comparable burden” that is “com-\nparably  justified.”  Id.,  at  29  (emphasis  deleted;  internal\nquotation  marks  omitted).  The  Government’s  evidence\ntouches on one or none of these considerations.\n\nThe Government’s reliance on firearm storage laws is a\nhelpful example.  These laws penalized the improper stor-\nage of firearms with forfeiture of those weapons.  See, e.g.,\nAct of Mar. 1, 1783, ch. 46, 1782 Mass. Acts pp. 119–120.\nFirst, these storage laws did not impose a “comparable bur-\nden” to that of §922(g)(8).  Forfeiture still allows a person to\nkeep their other firearms or obtain additional ones.  It is in\nno  way  equivalent  to  §922(g)(8)’s  complete  prohibition  on\nowning or possessing any firearms.\n\nIn fact, the Court already reached a similar conclusion in\nHeller.  The Court was tasked with comparing laws impos-\ning “a small fine and forfeiture of the weapon” with the Dis-\ntrict of Columbia’s ban on keeping functional handguns at\nhome  for  self-defense,  which  was  punishable  by  a  year  in\nprison.  554 U. S., at 633–634.  We explained that the for-\nfeiture laws were “akin to modern penalties for minor pub-\nlic-safety  infractions  like  speeding  or  jaywalking.”    Id.,  at\n633.  Such  inconsequential  punishment  would  not  have\n“prevented a person in the founding era from using a gun\nto protect himself or his family.”  Id., at 634.  Accordingly,\nwe concluded that the burdens were not equivalent.  See id.,\nat 633–634.  That analysis applies here in full force.  If a\nsmall fine and forfeiture is not equivalent to the District of\nColumbia’s  handgun  ban,  it  certainly  falls  short  of\n§922(g)(8)’s ban on possessing any firearm.\n\nThe Government resists the conclusion that forfeiture is\nless burdensome than a possession ban, arguing that “[t]he\nburdens imposed by bans on keeping, bearing, and obtain-\ning arms are all comparable.”  Reply Brief 10.  But, there is\nsurely a distinction between having no Second Amendment\nrights and having some Second Amendment rights.  If self-\n\n\fCite as:  602 U. S. ____ (2024)\n\n15\n\nTHOMAS, J., dissenting\n\ndefense  is  “the  central  component  of  the  [Second  Amend-\nment]  right,”  then  common  sense  dictates  that  it  matters\nwhether you can defend yourself with a firearm anywhere,\nonly at home, or nowhere.  Heller, 554 U. S., at 599 (empha-\nsis deleted).  And, the Government’s suggestion ignores that\nwe have repeatedly drawn careful distinctions between var-\nious  laws’  burdens.  See,  e.g.,  id.,  at  632  (explaining  that\nlaws  that  “did  not  clearly  prohibit  loaded  weapons  . . .  do\nnot remotely burden the right of self-defense as much as an\nabsolute ban on handguns”); see also Bruen, 597 U. S., at\n48.\n\nOur  careful  parsing  of  regulatory  burdens  makes  sense\ngiven that  the Second  Amendment codifies a right  with  a\n“historically fixed meaning.”  Id., at 28.  Accordingly, his-\ntory is our reference point and anchor.  If we stray too far\nfrom  it  by  eliding  material  differences  between  historical\nand modern laws, we “risk endorsing outliers that our an-\ncestors would never have accepted.”  Id., at 30 (internal quo-\ntation marks and alteration omitted).\n\nSecond, the Government offers no “comparable justifica-\ntion” between laws punishing firearm storage practices and\n§922(g)(8).  It posits that both laws punish persons whose\n“conduct suggested that he would not use [firearms] respon-\nsibly.”  Brief for United States 24.  The Government, how-\never, does not even attempt to ground that justification in\nhistorical evidence.  See infra, at 28–29.\n\nThe  Government’s  proposed  justification  is  also  far  too\ngeneral.  Nearly all firearm regulations can be cast as pre-\nventing  “irresponsible”  or  “unfit”  persons  from  accessing\nfirearms.  In addition, to argue that a law limiting access to\nfirearms is justified by the fact that the regulated groups\nshould  not  have  access  to  firearms  is  a  logical  merry-go-\nround.  As  the  Court  has  made  clear,  such  overly  broad\njudgments cannot suffice.  In Bruen, New York claimed it\ncould  effectively  ban  public  carry  because  “the  island  of\nManhattan [is] a ‘sensitive place.’ ”  597 U. S., at 31.  New\n\n\f16\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nYork defined a “sensitive place” as “all places where people\ntypically congregate and where law-enforcement and other\npublic-safety  professionals  are  presumptively  available.”\nId.,  at  30–31  (internal  quotation  marks  omitted).    The\nCourt  rejected  that  definition  as  “far  too  broa[d]”  as  it\n“would in effect exempt cities from the Second Amendment\nand  would  eviscerate  the  general  right  to  publicly  carry\narms for self-defense.”  Id., at 31.  Likewise, calling a mod-\nern  and  historical  law  comparably  justified  because  they\nboth prevent unfit persons from accessing firearms would\nrender our comparable-justification inquiry toothless.5\n\nIn sum, the Government has not identified any historical\n\nregulation that is relevantly similar to §922(g)(8).\n\n2\n\nThis  dearth  of  evidence  is  unsurprising  because  the\nFounders  responded  to  the  societal  problem  of  interper-\nsonal  violence  through  a  less  burdensome  regime:  surety\nlaws.  Tracing  back  to  early  English  history,  surety  laws\nwere  a  preventative  mechanism  for  ensuring  an  individ-\nual’s future peaceable conduct.  See D. Feldman, The King’s\nPeace,  the  Royal  Prerogative  and  Public  Order,  47  Cam-\nbridge L. J. 101, 101–102 (1988); M. Dalton, The Countrey\nJustice  140–144  (1619).    If  someone  received  a  surety  de-\nmand,  he  was  required  to  go  to  a  court  or  judicial  officer\n——————\n\n5 The Government’s other analogies suffer from the same flaws as the\nfirearm storage laws.  It cites laws restricting firearm sales to and public\ncarry  by  various  groups  such  as  minors  and  intoxicated  persons;  laws\nconfiscating firearms from rioters; and laws disarming insurrectionists\nand rebels.  Brief for United States 22–27.  These laws target different\ngroups of citizens, for different reasons, and through different, less oner-\nous burdens than §922(g)(8).  See Bruen, 597 U. S., at 70 (explaining that\nregulations  “limit[ing]  the  intent  for  which  one  could  carry  arms,  the\nmanner by which one carried arms, or the exceptional circumstances un-\nder which one could not carry arms” do not justify “broadly prohibit[ing]\nthe public carry of commonly used firearms for personal defense”).  None\nestablishes that the particular regulation at issue here would have been\nwithin the bounds of the pre-existing Second Amendment right.\n\n\fCite as:  602 U. S. ____ (2024)\n\n17\n\nTHOMAS, J., dissenting\n\nwith  one  or  more  members  of  the  community—i.e.,  sure-\nties—and comply with certain conditions.  4 W. Blackstone,\nCommentaries  on  the  Laws  of  England  249–250  (1769)\n(Blackstone).    Specifically,  the  person  providing  sureties\nwas required to “keep the peace: either generally . . . or . . .\nwith regard to the person who crave[d] the security” until a\nset date.  Id., at 250.  If he kept the peace, the surety obli-\ngation dissolved on that predetermined date.  See ibid.  If,\nhowever, he breached the peace before that date, he and his\nsureties would owe a set sum of money.  See id., at 249–250.\nEvidence  suggests  that  sureties  were  readily  available.\nEven  children,  who  “[we]re  incapable  of  engaging  them-\nselves to answer any debt,” could still find “security by their\nfriends.”  Id., at 251.\n\nThere  is  little  question  that  surety  laws  applied  to  the\nthreat  of  future  interpersonal  violence.    “[W]herever  any\nprivate man [had] just cause to fear, that another w[ould]\nburn his house, or do him a corporal injury, by killing, im-\nprisoning, or beating him . . . he [could] demand surety of\nthe  peace  against  such  person.”  Id.,  at  252;  see  also  J.\nBackus,  The  Justice  of  the  Peace  25  (1816)  (providing  for\nsureties when a person “stands in fear of his life, or of some\nharm to be done to his person or his estate” (emphasis de-\nleted)).\n\nSurety demands were also expressly available to prevent\ndomestic  violence.  Surety  could  be  sought  by  “a  wife\nagainst her husband who threatens to kill her or beat her\noutrageously, or, if she have notorious cause to fear he will\ndo either.”  Id., at 24; see 1 W. Hawkins, Pleas of the Crown\n253 (6th ed. 1777) (“[I]t is certain, that a wife may demand\n[a surety] against her husband threatening to beat her out-\nrageously, and that a husband also may have it against his\nwife”).  The right to demand sureties in cases of potential\ndomestic violence was recognized not only by treatises, but\nalso the founding-era courts.  Records from before and after\nthe  Second  Amendment’s  ratification  reflect  that  spouses\n\n\f18\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nsuccessfully demanded sureties when they feared future do-\nmestic violence.  See, e.g., Records of the Courts of Quarter\nSessions and Common Pleas of Bucks County, Pennsylva-\nnia,  1684–1700,  pp.  80–81  (1943)  (detailing  surety  de-\nmanded  upon  allegations  that  a  husband  was  “abusive  to\n[his wife] that she was afraid of her Life & of her Childrns\nlifes”); see also Heyn’s Case, 2 Ves. & Bea. 182, 35 Eng. Rep.\n288 (Ch. 1813) (1822) (granting wife’s request to order her\nhusband  who  committed  “various  acts  of  ill  usage  and\nthreats”  to  “find  sufficient  sureties”);  Anonymous,  1\nS. C. Eq. 113 (1785) (order requiring husband to “enter into\nrecognizance . . . with two sureties . . . for keeping the peace\ntowards the complainant (his wife)”).\n\n3\nAlthough surety laws shared a common justification with\n§922(g)(8), surety laws imposed a materially different bur-\nden.  Critically, a surety demand did not alter an individ-\nual’s right to keep and bear arms.  After providing sureties,\na person kept possession of all his firearms; could purchase\nadditional firearms; and could carry firearms in public and\nprivate.  Even  if  he  breached  the  peace,  the  only  penalty\nwas that he and his sureties had to pay a sum of money.  4\nBlackstone  250.  To  disarm  him,  the  Government  would\nhave to take some other action, such as imprisoning him for\na crime.  See Feldman, 47 Cambridge L. J., at 101.\n\nBy contrast, §922(g)(8) strips an individual of his Second\nAmendment  right.    The  statute’s  breadth  cannot  be  over-\nstated.  For one, §922(g) criminalizes nearly all conduct re-\nlated  to  covered  firearms  and  ammunition.    Most  funda-\nmentally,  possession  is  prohibited,  except  in  the  rarest  of\ncircumstances.  See, e.g., United States v. Rozier, 598 F. 3d\n768, 771 (CA11 2010) (per curiam) (concluding that it was\n“irrelevant” whether defendant “possessed the handgun for\npurposes  of  self-defense  (in  his  home)”);  United  States  v.\n\n\fCite as:  602 U. S. ____ (2024)\n\n19\n\nTHOMAS, J., dissenting\n\nGant,  691  F. 2d  1159,  1162  (CA5  1982)  (affirming  convic-\ntion of a business owner under §922(g) predecessor statute\nfor briefly possessing a firearm to ward off suspected rob-\nbers).  Courts  of  Appeals  have  understood  “possession”\nbroadly, upholding convictions where a person “picked up\n. . . three firearms for a few seconds to inspect” each, United\nStates v. Matthews, 520 F. 3d 806, 807 (CA7 2008), or “made\ndirect  contact  with  the  firearm  by  sitting  on  it,”  United\nStates v. Johnson, 46 F. 4th 1183, 1189 (CA10 2022).  They\nhave also construed §922(g) to bar “constructive possession”\nof a firearm, including, for example, ammunition found in a\njointly occupied home.  See, e.g., United States v. Stepp, 89\nF. 4th 826, 832–835 (CA10 2023).\n\nMoreover,  §922(g)  captures  virtually  all  commercially\navailable firearms and ammunition.  It prohibits possessing\na  firearm  “in  or  affecting  commerce”  and  “receiv[ing]  any\nfirearm  or  ammunition  which  has  been  shipped  or  trans-\nported  in  interstate  or  foreign  commerce.”    §922(g).  As\ncourts have interpreted that nexus, if a firearm or ammu-\nnition has at any point crossed interstate lines, it is regu-\nlated  by  §922(g).  See  Scarborough  v.  United  States,  431\nU. S.  563,  566–567  (1977)  (holding  §922(g)’s  predecessor\nstatute covered firearm that “had previously traveled in in-\nterstate  commerce”);  United  States  v.  Lemons,  302  F. 3d\n769,  772  (CA7  2002)  (affirming  conviction  under  §922(g)\nfor  possessing  firearm  that  “crossed  into  Wisconsin  after\nits manufacture at some indeterminate moment in time—\npossibly years before it was discovered in [the defendant’s]\npossession”).6  In fact, the statute goes even further by reg-\nulating not only ammunition but also all constituent parts\n\n——————\n\n6 The  majority  correctly  declines  to  consider  Rahimi’s  Commerce\nClause challenge because he did not raise it below.  See Cutter v. Wil-\nkinson, 544 U. S. 709, 718, n. 7 (2005) (“[W]e are a court of review, not of\nfirst  view”).  That  said,  I  doubt  that  §922(g)(8)  is  a  proper  exercise  of\nCongress’s  power  under  the  Commerce  Clause.  See  United  States  v.\nLopez, 514 U. S. 549, 585 (1995) (THOMAS, J., concurring).\n\n\f20\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nof ammunition—many of which are parts with no danger-\nous function on their own.  See 18 U. S. C. §921(a)(17)(A).\n\nThese sweeping prohibitions are criminally enforced.  To\nviolate the statute is a felony, punishable by up to 15 years.\n§924(a)(8).  That felony conviction, in turn, triggers a per-\nmanent,  life-long  prohibition  on  exercising  the  Second\nAmendment right.  See §922(g)(1).\n\nThe  combination  of  the  Government’s  sweeping  view  of\nthe  firearms  and  ammunition  within  its  regulatory  reach\nand the broad prohibition on any conduct regarding covered\nfirearms  and  ammunition  makes  §922(g)(8)’s  burden  un-\nmistakable: The statute revokes a citizen’s Second Amend-\nment right while the civil restraining order is in place.  And,\nthat  revocation  is  absolute.    It  makes  no  difference  if  the\ncovered  individual  agrees  to  a  no-contact  order,  posts  a\nbond, or even moves across the country from his former do-\nmestic partner—the bar on exercising the Second Amend-\nment right remains.  See United States v. Wilkey, 2020 WL\n4464668, *1 (D Mont., Aug. 4, 2020) (defendant agreed to\nFlorida protection order so he could “ ‘just walk away’ ” and\nwas prosecuted several years later for possessing firearms\nin Montana).\n\nThat combination of burdens places §922(g)(8) in an en-\ntirely different stratum from surety laws.  Surety laws pre-\nserve  the  Second  Amendment  right,  whereas  §922(g)(8)\nstrips an individual of that right.  While a breach of a surety\ndemand was punishable by a fine, §922(g)(8) is punishable\nby a felony conviction, which in turn permanently revokes\nan individual’s Second Amendment right.  At base, it is dif-\nficult  to  imagine  how  surety  laws  can  be  considered  rele-\nvantly similar to a complete ban on firearm ownership, pos-\nsession, and use.\n\nThis observation is nothing new; the Court has already\nrecognized that surety laws impose a lesser relative burden\non the Second Amendment right.  In Bruen, the Court ex-\n\n\fCite as:  602 U. S. ____ (2024)\n\n21\n\nTHOMAS, J., dissenting\n\nplained  that  surety  laws  merely  “provide  financial  incen-\ntives for responsible arms carrying.”  597 U. S., at 59.  “[A]n\naccused arms-bearer ‘could go on carrying without criminal\npenalty’  so  long  as  he  ‘post[ed]  money  that  would  be  for-\nfeited if he breached the peace or injured others.’ ”  Id., at\n56–57  (quoting  Wrenn  v.  District  of  Columbia,  864  F. 3d\n650, 661 (CADC 2017); alteration in original).  As a result,\nwe held that surety laws were not analogous to New York’s\neffective ban on public carry.  597 U. S., at 55.  That conclu-\nsion  is  damning  for  §922(g)(8),  which  burdens  the  Second\nAmendment right even more with respect to covered indi-\nviduals.\n\nSurety laws demonstrate that this case should have been\na  “straightforward”  inquiry.    Id.,  at  27.    The  Government\nfailed to produce a single historical regulation that is rele-\nvantly similar to §922(g)(8).  Rather, §922(g)(8) addresses a\nsocietal problem—the risk of interpersonal violence—“that\nhas  persisted  since  the  18th  century,”  yet  was  addressed\n“through [the] materially different means” of  surety laws.\nId., at 26.\n\nC\n\nThe  Court  has  two  rejoinders,  surety  and  affray  laws.\nNeither is a compelling historical analogue.  As I have ex-\nplained, surety laws did not impose a burden comparable to\n§922(g)(8).  And, affray laws had a dissimilar burden and\njustification.  The  Court  does  not  reckon  with  these  vital\ndifferences,  asserting  that  the  disagreement  is  whether\nsurety and affray laws must be an exact copy of §922(g)(8).\nAnte, at 16.  But, the historical evidence shows that those\nlaws are worlds—not degrees—apart from §922(g)(8).  For\nthis  reason,  the  Court’s  argument  requires  combining  as-\npects of surety and affray laws to justify §922(g)(8).  This\npiecemeal approach is not what the Second Amendment or\nour precedents countenance.\n\n\f22\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\n1\nDespite  the  foregoing  evidence,  the  Court  insists  that\nsurety laws in fact support §922(g)(8).  To make its case, the\nCourt  studiously  avoids  discussing  the  full  extent  of\n§922(g)(8)’s burden as compared to surety laws.  The most\nthe Court does is attack Bruen’s conclusion that surety laws\nwere less burdensome than a public carry ban.  The Court\nreasons that Bruen dealt with a “broad prohibitory regime”\nwhile §922(g)(8) applies to only a subset of citizens.  Ante,\nat 15–16.  Yet, that was only one way in which Bruen dis-\ntinguished  a  public  carry  ban  from  surety  laws’  burden.\nTrue, Bruen noted that, unlike the public carry ban, surety\nlaws did not restrict the general citizenry.  But, Bruen also\nplainly held that surety laws did not “constitut[e] a ‘severe’\nrestraint on public carry, let alone a restriction tantamount\nto a ban.”  597 U. S., at 59.  In fact, that conclusion is re-\npeated throughout the opinion.  Id., at 55–59 (surety laws\n“were not bans on public carry”; “surety laws did not pro-\nhibit  public  carry”;  surety  laws  “were  not  viewed  as  sub-\nstantial restrictions on public carry”; and “surety statutes\ndid not directly restrict public carry”).  Bruen’s conclusion\nis  inescapable  and  correct.  Because  surety  laws  are  not\nequivalent to an effective ban on public carry, they do not\nimpose a burden equivalent to a complete ban on carrying\nand possessing firearms.\n\nNext, the Court relies on affray laws prohibiting “riding\nor  going  armed,  with  dangerous  or  unusual  weapons,  [to]\nterrif[y] the good people of the land.”  4 Blackstone 149 (em-\nphasis deleted).  These laws do not justify §922(g)(8) either.\nAs the Court concedes, why and how a historical regulation\nburdened the right of armed self-defense are central consid-\nerations.  Ante, at 7.  Affray laws are not a fit on either ba-\nsis.\n\nFirst,  affray  laws  had  a  distinct  justification  from\n§922(g)(8) because they regulated only certain public con-\nduct that injured the entire community.  An affray was a\n\n\fCite as:  602 U. S. ____ (2024)\n\n23\n\nTHOMAS, J., dissenting\n\n“common  Nusanc[e],”  1  Hawkins,  Pleas  of  the  Crown,  at\n135, defined as “the fighting of two or more persons in some\npublic place, to the terror of his majesty’s subjects,” 4 Black-\nstone 145.  Even though an affray generally required “ac-\ntual  violence,”  certain  other  conduct  could  suffice.  1  R.\nBurn, The Justice of the Peace, and Parish Officer 13 (2d\ned. 1756).  As relevant here, an affray included arming one-\nself “with dangerous and unusual weapons, in such a man-\nner as [to] naturally cause a terror to the people”—i.e., “go-\ning  armed.”  Ibid.  Many  postfounding  going  armed  laws\nhad a self-defense exception: A person could “go armed with\na[n] . . . offensive and dangerous weapon” so long as he had\n“reasonable cause to fear an assault or other injury.”  Mass.\nRev. Stat., ch. 134, §16 (1836); see also 1838 Terr. of Wis.\nStat.  §16,  p.  381;  1851  Terr.  of  Minn.  Rev.  Stat.,  ch.  112,\n§18.\n\nAffrays  were  defined  by  their  public  nature  and  effect.\nAn affray could occur only in “some public place,” and cap-\ntured  only  conduct  affecting  the  broader  public.    4  Black-\nstone 145.  To that end, going armed laws did not prohibit\ncarrying firearms at home or even public carry generally.\nSee Bruen, 597 U. S., at 47–50.  Instead, they targeted only\npublic  carry  that  was  “accompanied  with  such  circum-\nstances as are apt to terrify the people.”  1 Burn, Justice of\nthe Peace, at 13; see Bruen, 597 U. S., at 50 (explaining that\ngoing  armed  laws  “prohibit  bearing  arms  in  a  way  that\nspreads ‘fear’ or ‘terror’ among the people”).\n\nAffrays  were  intentionally  distinguished  from  assaults\nand private interpersonal violence on that same basis.  See\nCash  v.  State,  2  Tenn.  198,  199  (1813)  (“It  is  because  the\nviolence is committed in a public place, and to the terror of\nthe people, that the crime is called an affray, instead of as-\nsault and battery”); Nottingham v. State, 227 Md. App. 592,\n602, 135 A. 3d 541, 547 (Md. 2016) (“[U]nlike assault and\nbattery,” affray is “not a crime against the person; rather,\naffray  is  a  crime  against  the  public”  (internal  quotation\n\n\f24\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nmarks omitted)).  As treatises shortly before the founding\nexplain, “there may be an Assault which will not amount to\nan Affray; as where it happens in a private Place, out of the\nhearing or seeing of any, except the Parties concerned; in\nwhich Case it cannot be said to be to the Terror of the Peo-\nple.”  1 Hawkins, Pleas of the Crown, at 134; see 1 Burn,\nJustice of the Peace, at 13.  Affrays thus did not cover the\nvery conduct §922(g)(8) seeks to prevent—interpersonal vi-\nolence in the home.\n\nSecond, affray laws did not impose a burden analogous to\n§922(g)(8).  They  regulated  a  niche  subset  of  Second\nAmendment-protected  activity.    As  explained,  affray  laws\nprohibited only carrying certain weapons (“dangerous and\nunusual”) in a particular manner (“terrifying the good peo-\nple of the land” without a need for self-defense) and in par-\nticular places (in public).  Meanwhile, §922(g)(8) prevents a\ncovered person from carrying any firearm or ammunition,\nin any manner, in any place, at any time, and for any rea-\nson.  Section  922(g)(8)  thus  bans  all  Second  Amendment-\nprotected  activity.    Indeed,  this  Court  has  already  con-\ncluded that affray laws do not impose a burden “analogous\nto the burden created by” an effective ban on public carry.\nBruen, 597 U. S., at 50.  Surely, then, a law that imposes a\npublic and private ban on a covered individual cannot have\nan analogous burden either.\n\nThe Court counters that since affray laws “provided for\nimprisonment,”  they\nlesser  burden  than\nimposed  a\n§922(g)(8)’s disarmament.  Ante, at 14.  But, that argument\nserves  only  to  highlight  another  fundamental  difference:\nAffray laws were criminal statutes that penalized past be-\nhavior, whereas §922(g)(8) is triggered by a civil restraining\norder that seeks to prevent future behavior.  Accordingly,\nan  affray’s  burden  was  vastly  harder  to  impose.    To  im-\nprison a person, a State had to prove that he committed the\ncrime of affray beyond a reasonable doubt.  The Constitu-\n\n\fCite as:  602 U. S. ____ (2024)\n\n25\n\nTHOMAS, J., dissenting\n\ntion provided a bevy of protections during that process—in-\ncluding  a  right  to  a  jury  trial,  counsel,  and  protections\nagainst double jeopardy.  See Amdts. 5, 6.\n\nThe  imposition  of  §922(g)(8)’s  burden,  however,  has  far\nfewer  hurdles  to  clear.    There  is  no  requirement  that  the\naccused has actually committed a crime; instead, he need\nonly be prohibited from threatening or using force, or pose\na  “credible  threat”  to  an  “intimate  partner  or  child.”\n§922(g)(8)(C).  Section  922(g)(8)  thus  revokes  a  person’s\nSecond  Amendment  right  based  on  the  suspicion  that  he\nmay  commit  a  crime  in  the  future.    In  addition,  the  only\nprocess required before that revocation is a hearing on the\nunderlying  court  order.   §922(g)(8)(A).  During  that  civil\nhearing—which is not even about §922(g)(8)—a person has\nfewer  constitutional  protections  compared  to  a  criminal\nprosecution  for  affray.  Gone  are  the  Sixth  Amendment’s\npanoply of rights, including the rights to confront witnesses\nand have assistance of counsel, as well as the Fifth Amend-\nment’s  protection  against  double  jeopardy.    See  Turner  v.\nRogers, 564 U. S. 431, 441 (2011) (“[T]he Sixth Amendment\ndoes not govern civil cases”); Hudson v. United States, 522\nU. S. 93, 99 (1997) (“The [Double Jeopardy] Clause protects\nonly  against  the  imposition  of  multiple  criminal  punish-\nments for the same offense”).  Civil proceedings also do not\nrequire proof beyond a reasonable doubt, and some States\neven set aside the rules of evidence, allowing parties to rely\non  hearsay.  See,  e.g.,  Wash.  Rule  Evid.  1101(c)(4)  (2024)\n(providing the state rules of evidence “need not be applied”\nto applications for protection orders (boldface and capitali-\nzation deleted)); Cal. Civ. Proc. Code Ann. §527.6(i) (West\nSupp. 2024) (judge “shall receive any testimony that is rel-\nevant” and issue order based on clear and convincing evi-\ndence).  The differences between criminal prosecutions and\ncivil hearings are numerous and consequential.\n\nAffray  laws  are  wide  of  the  mark.    While  the  Second\nAmendment does not demand a historical twin, it requires\n\n\f26\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nsomething  closer  than  affray  laws,  which  expressly  carve\nout the very conduct §922(g)(8) was designed to prevent (in-\nterpersonal  violence  in  the  home).    Nor  would  I  conclude\nthat affray  laws—criminal laws regulating a  specific type\nof public carry—are analogous to §922(g)(8)’s use of a civil\nproceeding  to  bar  all  Second  Amendment-protected  activ-\nity.\n\n2\nThe Court recognizes that surety and affray laws on their\nown are not enough.  So it takes pieces from each to stitch\ntogether an analogue for §922(g)(8).  Ante, at 13.  Our prec-\nedents foreclose that approach.  The question before us is\nwhether a single historical law has both a comparable bur-\nden  and  justification  as  §922(g)(8),  not  whether  several\nlaws  can  be  cobbled  together  to  qualify.    As  Bruen  ex-\nplained, “determining whether a historical regulation is a\nproper analogue for a distinctly modern firearm regulation\nrequires a determination of whether the two regulations”—\nthe  historical  and  modern  regulations—“are  ‘relevantly\nsimilar.’ ”    597  U. S.,  at  28–29.    In  doing  so,  a  court  must\nconsider  whether\nthat  single  historical  regulation\n“impose[s] a comparable burden on the right of armed self-\ndefense and whether that burden is comparably justified.”\nId., at 29 (emphasis added).\n\nThe  Court’s  contrary  approach  of  mixing  and  matching\nhistorical  laws—relying  on  one  law’s  burden  and  another\nlaw’s  justification—defeats  the  purpose  of  a  historical  in-\nquiry altogether.  Given that imprisonment (which involved\ndisarmament) existed at the founding, the Government can\nalways  satisfy  this  newly  minted  comparable-burden  re-\nquirement.  See  ante,  at  14–15.  That  means  the  Govern-\nment need only find a historical law with a comparable jus-\ntification  to  validate  modern  disarmament  regimes.  As  a\nresult, historical laws fining certain behavior could justify\ncompletely disarming a person for the same behavior.  That\n\n\fCite as:  602 U. S. ____ (2024)\n\n27\n\nTHOMAS, J., dissenting\n\nis  the  exact  sort  of  “regulatory  blank  check”  that  Bruen\nwarns against and the American people ratified the Second\nAmendment to preclude.  597 U. S., at 30.\n\nNeither the Court nor the Government identifies a single\nhistorical regulation with a comparable burden and justifi-\ncation  as  §922(g)(8).  Because  there  is  none,  I  would  con-\nclude  that  the  statute  is  inconsistent  with  the  Second\nAmendment.\n\nIV\n\nThe Government, for its part, tries to rewrite the Second\nAmendment to salvage its case.  It argues that the Second\nAmendment allows Congress to disarm anyone who is not\n“responsible”  and  “law-abiding.”  Not  a  single  Member  of\nthe  Court  adopts  the  Government’s  theory.  Indeed,  the\nCourt  disposes  of  it  in  half  a  page—and  for  good  reason.\nAnte, at 17.  The Government’s argument lacks any basis in\nour  precedents  and  would  eviscerate  the  Second  Amend-\nment altogether.\n\nA\n\nThe Government’s position is a bald attempt to refashion\nthis Court’s doctrine.  At the outset of this case, the Govern-\nment contended that the Court has already held the Second\nAmendment  protects  only  “responsible,  law-abiding”  citi-\nzens.  Brief for United States 6, 11–12.  The plain text of\nthe  Second  Amendment  quashes  this  argument.  The\nAmendment recognizes “the right of the people to keep and\nbear Arms.”  (Emphasis added.)  When the Constitution re-\nfers to “the people,” the term “unambiguously refers to all\nmembers of the political community.”  Heller, 554 U. S., at\n580;  see  also  id.,  at  581  (beginning  its  analysis  with  the\nstrong “presumption that the Second Amendment right . . .\nbelongs  to  all  Americans”).  The  Government’s  claim  that\nthe  Court  already  held  the  Second  Amendment  protects\n\n\f28\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nonly “law-abiding, responsible citizens” is specious at best.7\nSee ante, at 17.\n\nAt argument, the Government invented yet another posi-\ntion.  It explained that when it used the term “responsible”\nin its briefs, it really meant “not dangerous.”  See Tr. of Oral\nArg. 10–11.  Thus, it posited that the Second Amendment\nprotects only law-abiding and non-dangerous citizens.  No\nmatter  how  many  adjectives  the  Government  swaps  out,\nthe fact remains that the Court has never adopted anything\nakin to the Government’s test.  In reality, the “law-abiding,\ndangerous citizen” test is the Government’s own creation,\ndesigned to justify every one of its existing regulations.  It\nhas no doctrinal or constitutional mooring.\n\nThe Government finally tries to cram its dangerousness\ntest into our precedents.  It argues that §922(g)(8) and its\nproffered historical laws have a shared justification of dis-\narming  dangerous  citizens.  The  Government,  however,\ndoes not draw that conclusion by examining the historical\njustification  for  each  law  cited.    Instead,  the  Government\nsimply looks—from a modern vantage point—at the mix of\nlaws and manufactures a possible connection between them\nall.  Yet,  our  task  is  to  “assess  whether  modern  firearms\nregulations  are  consistent  with  the  Second  Amendment’s\ntext and historical understanding.”  Bruen, 597 U. S., at 26\n(emphasis added).  To do so, we must look at the historical\nlaw’s  justification  as  articulated  during  the  relevant  time\nperiod—not at modern post-hoc speculations.  See, e.g., id.,\nat 41–42, 48–49; Heller, 554 U. S., at 631–632.  As I have\nexplained, a historically based study of the evidence reveals\nthat the Government’s position is untenable.  Supra, at 7–\n\n——————\n\n7 The only conceivably relevant language in our precedents is the pass-\ning reference in Heller to laws banning felons and others from possessing\nfirearms.  See 554 U. S., at 626–627, and n. 26.  That discussion is dicta.\nAs for Bruen, the Court used the phrase “ordinary, law-abiding citizens”\nmerely to describe those who were unable to publicly carry a firearm in\nNew York.  See, e.g., 597 U. S., at 9, 15, 31–32, 71.\n\n\fCite as:  602 U. S. ____ (2024)\n\n29\n\nTHOMAS, J., dissenting\n\n13.\n\nAs it does today, the Court should continue to rebuff the\nGovernment’s attempts to rewrite the Second Amendment\nand the Court’s precedents interpreting it.\n\nB\nThe Government’s “law-abiding, dangerous citizen” the-\nory is also antithetical to our constitutional structure.  At\nbottom, its test stems from the idea that the Second Amend-\nment  points  to  general  principles,  not  a  historically\ngrounded  right.  And,  it  asserts  that  one  of  those  general\nprinciples  is  that  Congress  can  disarm  anyone  it  deems\n“dangerous,  irresponsible,  or  otherwise  unfit  to  possess\narms.”  Brief for United States 7.  This approach is wrong\nas a matter of constitutional interpretation, and it under-\nmines the very purpose and function of the Second Amend-\nment.\n\nThe  Second  Amendment  recognizes  a  pre-existing  right\nand that right was “enshrined with the scope” it was “un-\nderstood  to  have  when  the  people  adopted  [the  Amend-\nment].”  Heller, 554 U. S., at 634–635.  Only a subsequent\nconstitutional  amendment  can  alter  the  Second  Amend-\nment’s  terms,  “whether  or  not  future  legislatures  or  . . .\neven future judges think [its original] scope [is] too broad.”\nId., at 635.\n\nYet,  the  Government’s  “law-abiding,  dangerous  citizen”\ntest—and  indeed  any  similar,  principle-based  approach—\nwould hollow out the Second Amendment of any substance.\nCongress could impose any firearm regulation so long as it\ntargets “unfit” persons.  And, of course, Congress would also\ndictate  what  “unfit”  means  and  who  qualifies.    See  Tr.  of\nOral Arg. 7, 51.  The historical understanding of the Second\nAmendment right would be irrelevant.  In fact, the Govern-\nment  posits  that  Congress  could  enact  a  law  that  the\nFounders explicitly rejected.  See id., at 18 (agreeing that\n\n\f30\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nmodern judgment would override “[f]ounding-[e]ra applica-\ntions”).  At base, whether a person could keep, bear, or even\npossess  firearms  would  be  Congress’s  policy  choice  under\nthe Government’s test.\n\nThat would be the direct inverse of the Founders’ and rat-\nifying public’s intent.  Instead of a substantive right guar-\nanteed to every individual against Congress, we would have\na right controlled by Congress.  “A constitutional guarantee\nsubject to future judges’ [or Congresses’] assessments of its\nusefulness  is  no  constitutional  guarantee  at  all.”    Heller,\n554  U. S.,  at  634.  The  Second  Amendment  is  “the  very\nproduct of an interest balancing by the people.”  Id., at 635.\nIt is this policy judgment—not that of modern and future\nCongresses—“that  demands  our  unqualified  deference.”\nBruen, 597 U. S., at 26.\n\nThe Government’s own evidence exemplifies the dangers\nof approaches based on generalized principles.  Before the\nCourt of Appeals, the Government pointed to colonial stat-\nutes “disarming classes of people deemed to be threats, in-\ncluding . . . slaves, and native Americans.”  Supp. Brief for\nUnited States in No. 21–11001 (CA5), p. 33.  It argued that\nsince  early  legislatures  disarmed  groups  considered  to  be\n“threats,” a modern Congress has the same authority.  Ibid.\nThe problem with such a view should be obvious.  Far from\nan exemplar of Congress’s authority, the discriminatory re-\ngimes  the  Government  relied  upon  are  cautionary  tales.\nThey warn that when majoritarian interests alone dictate\nwho is “dangerous,” and thus can be disarmed, disfavored\ngroups become easy prey.  One of many such examples was\nthe  treatment  of  freed  blacks  following  the  Civil  War.\n“[M]any of the over 180,000 African-Americans who served\nin the Union Army returned to the States of the old Confed-\neracy, where systematic efforts were made to disarm them\nand other blacks.”  McDonald v. Chicago, 561 U. S. 742, 771\nformally  prohibited  African-\n(2010).\n  And,\nAmericans  from  possessing  firearms.”\n\nSome  “States\n\n  Ibid.\n\n\fCite as:  602 U. S. ____ (2024)\n\n31\n\nTHOMAS, J., dissenting\n\n“[t]hroughout  the  South,  armed  parties  . . .  forcibly  took\nfirearms  from  newly  freed  slaves.”  Id.,  at  772.  “In  one\ntown, the marshal took all arms from returned colored sol-\ndiers, and was very prompt in shooting the blacks whenever\nan  opportunity  occurred.”    Ibid.  (alterations  and  internal\nquotation  marks  omitted).    A  constitutional  amendment\nwas ultimately “necessary to provide full protection for the\nrights of blacks.”  Id., at 775.\n\nThe Government peddles a modern version of the govern-\nmental authority that led to those historical evils.  Its the-\nory would allow federal majoritarian interests to determine\nwho  can  and  cannot  exercise  their  constitutional  rights.\nWhile Congress cannot revive disarmament laws based on\nrace, one can easily imagine a world where political minor-\nities or those with disfavored cultural views are deemed the\nnext “dangers” to society.  Thankfully, the Constitution pro-\nhibits  such  laws.  The  “very  enumeration  of  the  [Second\nAmendment] right takes out of the hands of government . . .\nthe  power  to  decide  on  a  case-by-case  basis  whether  the\nright is really worth insisting upon.”  Heller, 544 U. S., at\n634.\n\nThe Court rightly rejects the Government’s approach by\nconcluding that any modern regulation must be justified by\nspecific historical regulations.  See ante, at 10–15.  But, the\nCourt should remain wary of any theory in the future that\nwould exchange the Second Amendment’s boundary line—\n“the right of the people to keep and bear Arms, shall not be\ninfringed”—for  vague  (and  dubious)  principles  with  con-\ntours defined by whoever happens to be in power.\n\n*\n\n*\n\n*\nThis case is not about whether States can disarm people\nwho threaten others.  States have a ready mechanism for\ndisarming anyone who uses a firearm to threaten physical\nviolence:  criminal  prosecution.  Most  States,  including\nTexas, classify aggravated assault as a felony, punishable\n\n\f32\n\nUNITED STATES v. RAHIMI\n\nTHOMAS, J., dissenting\n\nby up to 20 years’ imprisonment.  See Tex. Penal Code Ann.\n§§22.02(b), 12.33 (West 2019 and Supp. 2023).  Assuming\nC. M.’s allegations could be proved, Texas could have con-\nvicted and imprisoned Rahimi for every one of his alleged\nacts.  Thus, the question before us is not whether Rahimi\nand  others  like  him  can  be  disarmed  consistent  with  the\nSecond Amendment.  Instead, the question is whether the\nGovernment can strip the Second Amendment right of any-\none subject to a protective order—even if he has never been\naccused or convicted of a crime.  It cannot.  The Court and\nGovernment do not point to a single historical law revoking\na citizen’s Second Amendment  right based on possible in-\nterpersonal  violence.  The  Government  has  not  borne  its\nburden to prove that §922(g)(8) is consistent with the Sec-\nond Amendment’s text and historical understanding.\n\nThe  Framers  and  ratifying  public  understood  “that  the\nright to keep and bear arms was essential to the preserva-\ntion of liberty.”  McDonald, 561 U. S., at 858 (THOMAS, J.,\nconcurring in part and concurring in judgment).  Yet, in the\ninterest of ensuring the Government can regulate one sub-\nset  of  society,  today’s  decision  puts  at  risk  the  Second\nAmendment rights of many more.  I respectfully dissent.\n\n",
  "length": 216803
}